[
  {
    "id": "character-of-god",
    "description": {
      "en": [
        "An introduction to God’s character as the foundation of all truth, revealing who God is and how His nature shapes faith and life."
      ],
      "sw": [
        "Utangulizi wa tabia ya Mungu kama msingi wa ukweli wote, ukifunua Mungu ni nani na jinsi tabia yake inavyojenga imani na maisha."
      ]
    },
    "keyPoints": {
      "en": [
        "God’s character is the foundation of all truth",
        "God is unchanging, holy, just, and merciful",
        "Understanding God shapes how we understand Scripture and life"
      ],
      "sw": [
        "Tabia ya Mungu ni msingi wa ukweli wote",
        "Mungu habadiliki, ni mtakatifu, mwenye haki na rehema",
        "Kumjua Mungu kunaunda uelewa wetu wa Maandiko na maisha"
      ]
    }
  },
  {
    "id": "god-is-love",
    "description": {
      "en": [
        "A study revealing love as God’s very nature, not merely His actions."
      ],
      "sw": [
        "Somo linalofunua kwamba upendo ni asili ya Mungu, si tendo lake tu."
      ]
    },
    "keyPoints": {
      "en": [
        "Love defines who God is",
        "God’s love is unconditional and sacrificial",
        "True love flows from knowing God"
      ],
      "sw": [
        "Upendo unafafanua Mungu ni nani",
        "Upendo wa Mungu hauna masharti na ni wa kujitoa",
        "Upendo wa kweli unatoka katika kumjua Mungu"
      ]
    }
  },
  {
    "id": "law-of-love",
    "description": {
      "en": [
        "An explanation of God’s law as a reflection of His loving character."
      ],
      "sw": [
        "Ufafanuzi wa sheria ya Mungu kama kielelezo cha tabia yake ya upendo."
      ]
    },
    "keyPoints": {
      "en": [
        "God’s law reflects His character of love",
        "Obedience is an expression of love",
        "Love fulfills the law"
      ],
      "sw": [
        "Sheria ya Mungu inaakisi tabia yake ya upendo",
        "Utii ni matokeo ya upendo",
        "Upendo hutimiza sheria"
      ]
    }
  },
  {
    "id": "first-angel-message",
    "description": {
      "en": [
        "The prophecy of the first angel’s message, brought to view in Revelation 14, found its fulfillment in the advent movement of 1840-44. In both Europe and America, men of faith and prayer were deeply moved as their attention was called to the prophecies, and, tracing down the Inspired Record, they saw convincing evidence that the end of all things was at hand. The Spirit of God urged His servants to give the warning. Far and wide spread the message of the everlasting gospel, “Fear God, and give glory to Him; for the hour of His judgment is come.” Revelation 14:7."
        ,"Wherever missionaries had penetrated, were sent the glad tidings of Christ’s speedy return. In different lands were found isolated bodies of Christians, who, solely by the study of the Scriptures, had arrived at the belief that the Saviour’s advent was near. In some portions of Europe, where the laws were so oppressive as to forbid the preaching of the advent doctrine, little children were impelled to declare it, and many listened to the solemn warning.",
         "To William Miller and his co-laborers it was given to preach the message in America, and the light kindled by their labors shone out to distant lands. God sent His angel to move upon the heart of a farmer who had not believed the Bible, to lead  him to search the prophecies. Angels of God repeatedly visited that chosen one, to guide his mind and open to his understanding prophecies which had ever been dark to God’s people. The commencement of the chain of truth was given to him, and he was led on to search for link after link, until he looked with wonder and admiration upon the Word of God. He saw there a perfect chain of truth. That Word, which he had regarded as uninspired, now opened before his vision in its beauty and glory. He saw that one portion of Scripture explains another, and when one passage was closed to his understanding, he found in another part of the Word that which explained it. He regarded the sacred Word of God with joy, and with the deepest respect and awe",
         "As he followed down the prophecies he saw that the inhabitants of the earth were living in the closing scenes of this world’s history; yet they knew it not. He looked at the churches, and saw that they were corrupt; they had taken their affections from Jesus and placed them on the world; they were seeking for worldly honor, instead of that honor which cometh from above; grasping for worldly riches, instead of laying up their treasure in heaven. He could see hypocrisy, darkness, and death everywhere. His spirit was stirred within him. God called him to leave his farm, as He called Elisha to leave his oxen and the field of his labor to follow Elijah",
         "With trembling, William Miller began to unfold to the people the mysteries of the kingdom of God, carrying his hearers down through the prophecies to the second advent of Christ. The testimony of the Scriptures pointing to the coming of Christ in 1843 awakened widespread interest. Many were convinced that the arguments from the prophetic periods were correct,  and, sacrificing their pride of opinion, they joyfully received the truth. Some ministers laid aside their sectarian views and feelings, left their salaries and their churches, and united in proclaiming the coming of Jesus.",
         "There were but few ministers, however, who would accept this message; therefore it was largely committed to humble laymen. Farmers left their fields, mechanics their tools, traders their merchandise, professional men their positions; and yet the number of workers was small in comparison with the work to be accomplished. The condition of an ungodly church and a world lying in wickedness burdened the souls of the true watchmen, and they willingly endured toil, privation, and suffering, that they might call men to repentance unto salvation. Though opposed by Satan, the work went steadily forward, and the advent truth was accepted by many thousands."
      ],
      "sw": [
        "Unabii wa ujumbe wa malaika wa kwanza, unaoonekana katika Ufunuo 14, ulipata utimilifu wake katika harakati za majilio za mwaka 1840-44.",
        "Katika Ulaya na Amerika, watu wa imani na maombi waliguswa sana wakati fikra zao zilipoelekezwa kwenye unabii huo, na walipofuatilia Maandiko Matakatifu (Kumbukumbu Iliyoongozwa na Roho), waliona ushahidi wenye kusadikisha kwamba mwisho wa mambo yote ulikuwa karibu.",
        "Roho wa Mungu aliwahimiza watumishi Wake kutoa onyo hilo.",
        "Kila mahali, ujumbe wa injili ya milele ulienea: \"Mcheni Mungu, na kumtukuza; kwa maana saa ya hukumu yake imekuja.\" (Ufunuo 14:7)."
      ]
    },
    "keyPoints": {
      "en": [
        "Sin is transgression of God’s law",
        "Sin breaks relationship with God",
        "Sin leads to separation and death"
      ],
      "sw": [
        "Dhambi ni kuvunja sheria ya Mungu",
        "Dhambi huvunja uhusiano na Mungu",
        "Dhambi huleta utengano na mauti"
      ]
    }
  },
   {
    "id": "religious-revival",
    "description": {
      "en": [
        "Everywhere was heard the searching testimony warning sinners, both worldlings and church members, to flee from the wrath to come. Like John the Baptist, the forerunner of Christ, the preachers laid the ax at the root of the tree and urged all to bring forth fruit meet for repentance. Their stirring appeals were in marked contrast to the assurances of peace and safety that were heard from popular pulpits, and wherever the message was given, it moved the people.",
        "The simple, direct testimony of the Scriptures, set home by the power of the Holy Spirit, brought a weight of conviction which few were able wholly to resist. Professors of religion were roused from their false security. They saw their backslidings, their worldliness and unbelief, their pride and selfishness. Many sought the Lord with repentance and humiliation. The affections  that had so long clung to earthly things they now fixed upon heaven. The Spirit of God rested upon them, and with hearts softened and subdued they joined to sound the cry, “Fear God, and give glory to Him; for the hour of His judgment is come.” Revelation 14:7",
        "Sinners inquired with weeping, “What must I do to be saved?” Those whose lives had been marked with dishonesty were anxious to make restitution. All who found peace in Christ longed to see others share the blessing. The hearts of parents were turned to their children, and the hearts of children to their parents. The barriers of pride and reserve were swept away. Heartfelt confessions were made, and the members of the household labored for the salvation of those who were nearest and dearest",
        "Often was heard the sound of earnest intercession. Everywhere were souls in deep anguish, pleading with God. Many wrestled all night in prayer for the assurance that their own sins were pardoned, or for the conversion of their relatives or neighbors. That earnest, determined faith gained its object. Had the people of God continued to be thus importunate in prayer, pressing their petitions at the mercy seat, they would be in possession of a far richer experience than they now have. There is too little prayer, too little real conviction of sin; and the lack of living faith leaves many destitute of the grace so richly provided by our gracious Redeemer.",
        "All classes flocked to the Adventist meetings. Rich and poor, high and low, were, from various causes, anxious to hear for themselves the doctrine of the second advent. The Lord held the spirit of opposition in check while His servants explained the reasons of their faith. Sometimes the instrument was feeble; but  the Spirit of God gave power to His truth. The presence of holy angels was felt in these assemblies, and many were daily added to the believers. As the evidences of Christ’s soon coming were repeated, vast crowds listened in breathless silence to the solemn words. Heaven and earth seemed to approach each other. The power of God would be felt upon old and young and middle-aged. Men sought their homes with praises upon their lips, and the glad sound rang out upon the still night air. None who attended those meetings can ever forget those scenes of deepest interest."
       
     
      ],
      "sw": [
        "Unabii wa ujumbe wa malaika wa kwanza, unaoonekana katika Ufunuo 14, ulipata utimilifu wake katika harakati za majilio za mwaka 1840-44.",
        "Katika Ulaya na Amerika, watu wa imani na maombi waliguswa sana wakati fikra zao zilipoelekezwa kwenye unabii huo, na walipofuatilia Maandiko Matakatifu (Kumbukumbu Iliyoongozwa na Roho), waliona ushahidi wenye kusadikisha kwamba mwisho wa mambo yote ulikuwa karibu.",
        "Roho wa Mungu aliwahimiza watumishi Wake kutoa onyo hilo.",
        "Kila mahali, ujumbe wa injili ya milele ulienea: \"Mcheni Mungu, na kumtukuza; kwa maana saa ya hukumu yake imekuja.\" (Ufunuo 14:7)."
      ]
    },
    "keyPoints": {
      "en": [
        "Sin is transgression of God’s law"
        
      ],
      "sw": [
        "Dhambi ni kuvunja sheria ya Mungu",
        "Dhambi huvunja uhusiano na Mungu",
        "Dhambi huleta utengano na mauti"
      ]
    }
  },
  {
    "id": "the-cross-explained",
    "description": {
      "en": [
        "A clear explanation of the cross as the meeting point of God’s justice and mercy."
      ],
      "sw": [
        "Ufafanuzi wa msalaba kama mahali ambapo haki na rehema ya Mungu hukutana."
      ]
    },
    "keyPoints": {
      "en": [
        "The cross reveals God’s love and justice",
        "Christ bore the penalty of sin",
        "Salvation is a gift through sacrifice"
      ],
      "sw": [
        "Msalaba unaonyesha upendo na haki ya Mungu",
        "Kristo alichukua adhabu ya dhambi",
        "Wokovu ni zawadi kupitia dhabihu"
      ]
    }
  },
  {
    "id": "walking-with-god",
    "description": {
      "en": [
        "A study showing that eternal life begins now through a daily relationship with God."
      ],
      "sw": [
        "Somo linaloonyesha kuwa uzima wa milele unaanza sasa kupitia uhusiano wa kila siku na Mungu."
      ]
    },
    "keyPoints": {
      "en": [
        "Eternal life is knowing God",
        "Relationship with God begins now",
        "Daily communion sustains spiritual life"
      ],
      "sw": [
        "Uzima wa milele ni kumjua Mungu",
        "Uhusiano na Mungu unaanza sasa",
        "Ushirika wa kila siku huimarisha maisha ya kiroho"
      ]
    }
  }
]
