[
  {
    "id": "character-of-god",
    "description": {
      "en": [
        "An introduction to God’s character as the foundation of all truth, revealing who God is and how His nature shapes faith and life."
      ],
      "sw": [
        "Utangulizi wa tabia ya Mungu kama msingi wa ukweli wote, ukifunua Mungu ni nani na jinsi tabia yake inavyojenga imani na maisha."
      ]
    },
    "keyPoints": {
      "en": [
        "God’s character is the foundation of all truth",
        "God is unchanging, holy, just, and merciful",
        "Understanding God shapes how we understand Scripture and life"
      ],
      "sw": [
        "Tabia ya Mungu ni msingi wa ukweli wote",
        "Mungu habadiliki, ni mtakatifu, mwenye haki na rehema",
        "Kumjua Mungu kunaunda uelewa wetu wa Maandiko na maisha"
      ]
    }
  },
  {
    "id": "god-is-love",
    "description": {
      "en": [
        "A study revealing love as God’s very nature, not merely His actions."
      ],
      "sw": [
        "Somo linalofunua kwamba upendo ni asili ya Mungu, si tendo lake tu."
      ]
    },
    "keyPoints": {
      "en": [
        "Love defines who God is",
        "God’s love is unconditional and sacrificial",
        "True love flows from knowing God"
      ],
      "sw": [
        "Upendo unafafanua Mungu ni nani",
        "Upendo wa Mungu hauna masharti na ni wa kujitoa",
        "Upendo wa kweli unatoka katika kumjua Mungu"
      ]
    }
  },
  {
    "id": "law-of-love",
    "description": {
      "en": [
        "An explanation of God’s law as a reflection of His loving character."
      ],
      "sw": [
        "Ufafanuzi wa sheria ya Mungu kama kielelezo cha tabia yake ya upendo."
      ]
    },
    "keyPoints": {
      "en": [
        "God’s law reflects His character of love",
        "Obedience is an expression of love",
        "Love fulfills the law"
      ],
      "sw": [
        "Sheria ya Mungu inaakisi tabia yake ya upendo",
        "Utii ni matokeo ya upendo",
        "Upendo hutimiza sheria"
      ]
    }
  },
  {
    "id": "first-angel-message",
    "description": {
      "en": [
        "The prophecy of the first angel’s message, brought to view in Revelation 14, found its fulfillment in the advent movement of 1840-44. In both Europe and America, men of faith and prayer were deeply moved as their attention was called to the prophecies, and, tracing down the Inspired Record, they saw convincing evidence that the end of all things was at hand. The Spirit of God urged His servants to give the warning. Far and wide spread the message of the everlasting gospel, “Fear God, and give glory to Him; for the hour of His judgment is come.” Revelation 14:7.",
        "Wherever missionaries had penetrated, were sent the glad tidings of Christ’s speedy return. In different lands were found isolated bodies of Christians, who, solely by the study of the Scriptures, had arrived at the belief that the Saviour’s advent was near. In some portions of Europe, where the laws were so oppressive as to forbid the preaching of the advent doctrine, little children were impelled to declare it, and many listened to the solemn warning.",
        "To William Miller and his co-laborers it was given to preach the message in America, and the light kindled by their labors shone out to distant lands. God sent His angel to move upon the heart of a farmer who had not believed the Bible, to lead  him to search the prophecies. Angels of God repeatedly visited that chosen one, to guide his mind and open to his understanding prophecies which had ever been dark to God’s people. The commencement of the chain of truth was given to him, and he was led on to search for link after link, until he looked with wonder and admiration upon the Word of God. He saw there a perfect chain of truth. That Word, which he had regarded as uninspired, now opened before his vision in its beauty and glory. He saw that one portion of Scripture explains another, and when one passage was closed to his understanding, he found in another part of the Word that which explained it. He regarded the sacred Word of God with joy, and with the deepest respect and awe",
        "As he followed down the prophecies he saw that the inhabitants of the earth were living in the closing scenes of this world’s history; yet they knew it not. He looked at the churches, and saw that they were corrupt; they had taken their affections from Jesus and placed them on the world; they were seeking for worldly honor, instead of that honor which cometh from above; grasping for worldly riches, instead of laying up their treasure in heaven. He could see hypocrisy, darkness, and death everywhere. His spirit was stirred within him. God called him to leave his farm, as He called Elisha to leave his oxen and the field of his labor to follow Elijah",
        "With trembling, William Miller began to unfold to the people the mysteries of the kingdom of God, carrying his hearers down through the prophecies to the second advent of Christ. The testimony of the Scriptures pointing to the coming of Christ in 1843 awakened widespread interest. Many were convinced that the arguments from the prophetic periods were correct,  and, sacrificing their pride of opinion, they joyfully received the truth. Some ministers laid aside their sectarian views and feelings, left their salaries and their churches, and united in proclaiming the coming of Jesus.",
        "There were but few ministers, however, who would accept this message; therefore it was largely committed to humble laymen. Farmers left their fields, mechanics their tools, traders their merchandise, professional men their positions; and yet the number of workers was small in comparison with the work to be accomplished. The condition of an ungodly church and a world lying in wickedness burdened the souls of the true watchmen, and they willingly endured toil, privation, and suffering, that they might call men to repentance unto salvation. Though opposed by Satan, the work went steadily forward, and the advent truth was accepted by many thousands."
      ],
      "sw": [
        "Unabii wa ujumbe wa malaika wa kwanza, unaoonekana katika Ufunuo 14, ulipata utimilifu wake katika vuguvugu la marejeo la mwaka 1840-44. Katika Ulaya na Amerika, watu wa imani na maombi waligushwa sana wakati fikira zao zilipoelekezwa kwenye unabii, na, wakifuatilia Kumbukumbu Iliyovuviwa, waliona ushahidi wa kusadikisha kwamba mwisho wa mambo yote ulikuwa karibu. Roho wa Mungu aliwahimiza watumishi Wake kutoa onyo. Ujumbe wa injili ya milele ulienea mbali na kote, ukisema, 'Mcheni Mungu, na kumtukuza; kwa maana saa ya hukumu yake imekuja.' Ufunuo 14:7.",
        "Kila mahali ambapo wamisionari walikuwa wamefika, habari njema za kurudi upesi kwa Kristo zilitumwa. Katika nchi mbalimbali kulipatikana makundi ya Wakristo yaliyojitenga, ambao, kwa kujifunza Maandiko pekee, walikuwa wamefikia imani kwamba kuja kwa Mwokozi kulikuwa karibu. Katika baadhi ya sehemu za Ulaya, ambapo sheria zilikuwa za kidikteta kiasi cha kukataza uandishi wa fundisho la marejeo, watoto wadogo walisukumwa kulitangaza, na wengi walisikiliza onyo hilo zito.",
        "Kwa William Miller na wafanyakazi wenzake ilitolewa kazi ya kuhubiri ujumbe huo huko Amerika, na nuru iliyowashwa na kazi zao iliangaza hadi nchi za mbali. Mungu alimtuma malaika Wake kugusa moyo wa mkulima ambaye hakuwa ameiamini Biblia, ili kumwongoza kuchunguza unabii. Malaika wa Mungu walimtembelea mteule huyo mara kwa mara, ili kuongoza akili yake na kufunua ufahamu wake kwenye unabii ambao ulikuwa umekuwa giza kwa watu wa Mungu. Mwanzo wa mnyororo wa ukweli ulitolewa kwake, naye aliongozwa kutafuta kiungo baada ya kiungo, hadi alipotazama kwa mshangao na kustaajabu Neno la Mungu. Aliona hapo mnyororo kamili wa ukweli. Neno hilo, ambalo alikuwa ameliona kama lisilovuvuwa, sasa lilifunguka mbele ya maono yake katika uzuri na utukufu wake. Aliona kwamba sehemu moja ya Maandiko inaelezea nyingine, na wakati fungu moja lilipokuwa limefungwa kwa ufahamu wake, alipata katika sehemu nyingine ya Neno jambo lililolielezea. Alilitazama Neno takatifu la Mungu kwa furaha, na kwa heshima na unyenyekevu mkuu.",
        "Alipokuwa akifuatilia unabii huo, aliona kwamba wenyeji wa dunia walikuwa wakiishi katika matukio ya kufunga ya historia ya ulimwengu huu; lakini hawakujua. Aliyatazama makanisa, na kuona kwamba yalikuwa yameharibika; walikuwa wameondoa upendo wao kwa Yesu na kuuweka kwenye ulimwengu; walikuwa wakitafuta heshima ya kidunia, badala ya heshima ile itokayo juu; wakitafuta utajiri wa kidunia, badala ya kujiwekea hazina mbinguni. Aliweza kuona unafiki, giza, na mauti kila mahali. Roho yake ilisisimka ndani yake. Mungu alimwita auache shamba lake, kama alivyomwita Elisha awaache ng'ombe wake na shamba la kazi yake ili amfuate Eliya.",
        "Kwa kutetemeka, William Miller alianza kuwafunulia watu siri za ufalme wa Mungu, akiwapeleka wasikilizaji wake kupitia unabii hadi kwenye kuja kwa mara ya pili kwa Kristo. Ushuhuda wa Maandiko ukiashiria kuja kwa Kristo mnamo 1843 uliamsha maslahi makubwa. Wengi walisadiki kwamba hoja kutoka kwa vipindi vya unabii zilikuwa sahihi, na, wakidhabihu kiburi chao cha maoni, walipokea ukweli kwa furaha. Baadhi ya wachunguzi waliweka kando mitazamo na hisia zao za kimadhehebu, waliacha mishahara yao na makanisa yao, na kuungana katika kutangaza kuja kwa Yesu.",
        "Walakini, walikuwa wachungaji wachache tu ambao wangekubali ujumbe huu; kwa hivyo ulikabidhiwa kwa kiasi kikubwa kwa walei wanyenyekevu. Wakulima waliondoka mashambani mwao, mafundi waliacha vifaa vyao, wafanyabiashara bidhaa zao, wasomi nafasi zao; na bado idadi ya wafanyakazi ilikuwa ndogo kulinganisha na kazi iliyopaswa kukamilika. Hali ya kanisa lisiloacha dhambi na ulimwengu uliolala katika uovu ililemea roho za walinzi wa kweli, nao walivumilia kwa hiari taabu, upungufu, na mateso, ili wapate kuwaita watu kwenye toba kuelekea wokovu. Ingawa walipingwa na Shetani, kazi iliendelea mbele kwa uthabiti, na ukweli wa marejeo ulikubaliwa na maelfu mengi."
      ]
    },
    "keyPoints": {
      "en": [
        "Sin is transgression of God’s law",
        "Sin breaks relationship with God",
        "Sin leads to separation and death"
      ],
      "sw": [
        "Dhambi ni kuvunja sheria ya Mungu",
        "Dhambi huvunja uhusiano na Mungu",
        "Dhambi huleta utengano na mauti"
      ]
    }
  },
  {
    "id": "religious-revival",
    "description": {
      "en": [
        "Everywhere was heard the searching testimony warning sinners, both worldlings and church members, to flee from the wrath to come. Like John the Baptist, the forerunner of Christ, the preachers laid the ax at the root of the tree and urged all to bring forth fruit meet for repentance. Their stirring appeals were in marked contrast to the assurances of peace and safety that were heard from popular pulpits, and wherever the message was given, it moved the people.",
        "The simple, direct testimony of the Scriptures, set home by the power of the Holy Spirit, brought a weight of conviction which few were able wholly to resist. Professors of religion were roused from their false security. They saw their backslidings, their worldliness and unbelief, their pride and selfishness. Many sought the Lord with repentance and humiliation. The affections  that had so long clung to earthly things they now fixed upon heaven. The Spirit of God rested upon them, and with hearts softened and subdued they joined to sound the cry, “Fear God, and give glory to Him; for the hour of His judgment is come.” Revelation 14:7",
        "Sinners inquired with weeping, “What must I do to be saved?” Those whose lives had been marked with dishonesty were anxious to make restitution. All who found peace in Christ longed to see others share the blessing. The hearts of parents were turned to their children, and the hearts of children to their parents. The barriers of pride and reserve were swept away. Heartfelt confessions were made, and the members of the household labored for the salvation of those who were nearest and dearest",
        "Often was heard the sound of earnest intercession. Everywhere were souls in deep anguish, pleading with God. Many wrestled all night in prayer for the assurance that their own sins were pardoned, or for the conversion of their relatives or neighbors. That earnest, determined faith gained its object. Had the people of God continued to be thus importunate in prayer, pressing their petitions at the mercy seat, they would be in possession of a far richer experience than they now have. There is too little prayer, too little real conviction of sin; and the lack of living faith leaves many destitute of the grace so richly provided by our gracious Redeemer.",
        "All classes flocked to the Adventist meetings. Rich and poor, high and low, were, from various causes, anxious to hear for themselves the doctrine of the second advent. The Lord held the spirit of opposition in check while His servants explained the reasons of their faith. Sometimes the instrument was feeble; but  the Spirit of God gave power to His truth. The presence of holy angels was felt in these assemblies, and many were daily added to the believers. As the evidences of Christ’s soon coming were repeated, vast crowds listened in breathless silence to the solemn words. Heaven and earth seemed to approach each other. The power of God would be felt upon old and young and middle-aged. Men sought their homes with praises upon their lips, and the glad sound rang out upon the still night air. None who attended those meetings can ever forget those scenes of deepest interest."
      ],
      "sw": [
        "Kila mahali palisikika ushuhuda wenye kuchunguza ukiwaonya wenye dhambi, wakiwemo watu wa ulimwengu na washiriki wa kanisa, kuikimbia ghadhabu inayokuja. Kama Yohana Mbatizaji, mtangulizi wa Kristo, wahubiri waliweka shoka kwenye shina la mti na kuwahimiza wote kutoa matunda yapatanayo na toba. Miito yao yenye kusisimua ilikuwa tofauti kabisa na hakikisho za amani na usalama zilizosikika kutoka kwenye mimbari maarufu, na kila mahali ambapo ujumbe huo ulitolewa, uliwatikisa watu.",
        "Ushuhuda rahisi na wa moja kwa moja wa Maandiko, ukikaziwa na nguvu ya Roho Mtakatifu, ulileta uzito wa ushawishi ambao ni wachache walioweza kuupinga kabisa. Waliokiri dini waliamshwa kutoka kwenye usalama wao wa uongo. Waliona kurudi kwao nyuma, kupenda ulimwengu na kutokuamini kwao, kiburi chao na ubinafsi wao. Wengi walimtafuta Bwana kwa toba na unyenyekevu. Upendo ambao kwa muda mrefu ulikuwa umeng’ang’ania mambo ya duniani sasa waliuweka mbinguni. Roho wa Mungu alikaa juu yao, na kwa mioyo iliyolainishwa na kunyenyekezwa, waliungana kutoa ule ukelele, 'Mcheni Mungu, na kumtukuza; kwa maana saa ya hukumu yake imekuja.' Ufunuo 14:7",
        "Wenye dhambi waliuliza kwa kulia, 'Nifanye nini nipate kuokoka?' Wale ambao maisha yao yalikuwa na alama ya ukosefu wa uaminifu walikuwa na hamu ya kufanya matengenezo. Wote waliopata amani ndani ya Kristo walitamani kuona wengine wakishiriki baraka hiyo. Mioyo ya wazazi iligeuzwa kuelekea kwa watoto wao, na mioyo ya watoto kuelekea kwa wazazi wao. Vizuizi vya kiburi na kujitenga vilifutwa. Ungamo la dhati lilifanywa, na washiriki wa kaya walifanya kazi kwa ajili ya wokovu wa wale waliokuwa karibu na wapendwa wao zaidi.",
        "Mara nyingi sauti ya maombezi ya dhati ilisikika. Kila mahali kulikuwa na roho katika uchungu mwingi, wakimsihi Mungu. Wengi walishindana usiku kucha katika maombi kwa ajili ya uhakika kwamba dhambi zao wenyewe zimesamehewa, au kwa ajili ya kuongoka kwa jamaa au majirani zao. Imani hiyo ya dhati na yenye azimio ilipata lengo lake. Kama watu wa Mungu wangeendelea kuwa na kusihi huko katika maombi, wakishinikiza maombi yao kwenye kiti cha rehema, wangekuwa na uzoefu tajiri zaidi kuliko ule walio nao sasa. Kuna maombi kidogo sana, ushawishi mdogo sana wa kweli wa dhambi; na ukosefu wa imani hai unawaacha wengi wakiwa fukara wa neema iliyoandaliwa kwa wingi na Mwokozi wetu mwenye neema.",
        "Matabaka yote yalimiminika kwenye mikutano ya Waadventista. Tajiri na maskini, wakubwa na wadogo, walikuwa, kwa sababu mbalimbali, na hamu ya kujisikilia wenyewe fundisho la kuja kwa mara ya pili. Bwana alizuia roho ya upinzani wakati watumishi Wake walipokuwa wakieleza sababu za imani yao. Wakati mwingine chombo kilikuwa dhaifu; lakini Roho wa Mungu alitoa nguvu kwa ukweli Wake. Uwepo wa malaika watakatifu ulihisiwa katika makusanyiko haya, na wengi waliongezwa kila siku kwenye idadi ya waamini. Ushahidi wa kuja upesi kwa Kristo ulipokaririwa, umati mkubwa wa watu ulisikiliza kwa kimya kikuu maneno hayo mazito. Mbingu na nchi vilionekana kukaribiana. Nguvu ya Mungu ilihisiwa juu ya wazee, vijana, na watu wa makamo. Watu walirudi majumbani mwao kwa sifa midomoni mwao, na sauti hiyo ya furaha ilivuma katika hewa tulivu ya usiku. Hakuna yeyote aliyehudhuria mikutano hiyo anayeweza kusahau matukio hayo ya kuvutia sana."
      ]
    },
    "keyPoints": {
      "en": [
        "Sin is transgression of God’s law"
      ],
      "sw": [
        "Dhambi ni kuvunja sheria ya Mungu",
        "Dhambi huvunja uhusiano na Mungu",
        "Dhambi huleta utengano na mauti"
      ]
    }
  },
  {
    "id": "opposition",
    "description": {
      "en": [
        "The proclamation of a definite time for Christ’s coming called forth great opposition from many of all classes, from the minister in the pulpit down to the most reckless, heaven-daring sinner. “No man knoweth the day nor the hour!” was heard alike from the hypocritical minister and the bold scoffer. They closed their ears to the clear and harmonious explanation of the text by those who were pointing to the close of the prophetic periods and to the signs which Christ Himself had foretold as tokens of His advent.",
        "Many who professed to love the Saviour declared that they had no opposition to the preaching of His coming; they merely objected to the definite time. God’s all-seeing eye read their hearts. They did not wish to hear of Christ’s coming to judge the world in righteousness. They had been unfaithful servants, their works would not bear the inspection of the heart-searching God, and they feared to meet their Lord. Like the Jews at the time of Christ’s first advent, they were not prepared to welcome Jesus. Satan and his angels exulted and flung the taunt in the face of Christ and holy angels, that His professed people had so little love for Him that they did not desire His appearing.",
        "Unfaithful watchmen hindered the progress of the work of God. As the people were roused, and began to inquire the way of salvation, these leaders stepped in between them and the truth, seeking to quiet their fears by falsely interpreting the Word of God. In this work Satan and unconsecrated ministers united, crying, Peace, peace, when God had not spoken peace. Like the Pharisees in Christ’s day, many refused to enter the kingdom of heaven themselves, and those who were entering in they hindered. The blood of these souls will be required at their hand.",
        "Wherever the message of truth was proclaimed, the most humble and devoted in the churches were the first to receive it. Those who studied the Bible for themselves could but see the unscriptural character of the popular views of prophecy, and wherever the people were not deceived by the efforts of the clergy to misstate and pervert the faith, wherever they would search the Word of God for themselves, the advent doctrine needed only to be compared with the Scriptures to establish its divine authority.",
        "Many were persecuted by their unbelieving brethren. In order to retain their position in the church, some consented to be silent in regard to their hope, but others felt that loyalty to God forbade them thus to hide the truths which He had committed to their trust. Not a few were cut off from the fellowship of the church for no other reason than expressing their belief in the coming of Christ. Very precious to those who bore the trial of their faith were the words of the prophet, “Your brethren that hated you, that cast you out for My name’s sake, said, Let the Lord be glorified: but He shall appear to your joy, and they shall be ashamed.” Isaiah 66:5.",
        "Angels of God were watching with the deepest interest the result of the warning. When the churches as a body rejected the message, angels turned away from them in sadness. Yet there were in the churches many who had not yet been tested in regard to the advent truth. Many were deceived by husbands, wives, parents, or children, and were made to believe it a sin even to listen to such heresies as were taught by the Adventists. Angels were bidden to keep faithful watch over these souls; for another light was yet to shine upon them from the throne of God."
      ],
      "sw": [
        "Utangazaji wa muda maalumu wa kuja kwa Kristo ulizua upinzani mkubwa kutoka kwa watu wa matabaka yote, kuanzia kwa mchungaji mimbarini hadi kwa mwenye dhambi mkaidi na asiyemwogopa Mungu. “Hakuna mtu ajuaye siku wala saa!” ilisikika vivyo hivyo kutoka kwa mchungaji mnafiki na mdhihaki mjasiri. Waliziba masikio yao wasisikie maelezo ya wazi na yenye upatano ya fungu hilo kutoka kwa wale waliokuwa wakiashiria mwisho wa vipindi vya unabii na ishara ambazo Kristo Mwenyewe alikuwa amezitabiri kama alama za kuja Kwake.",
        "Wengi waliokiri kumpenda Mwokozi walitangaza kwamba hawakuwa na upinzani dhidi ya kuhubiriwa kwa kuja Kwake; walipinga tu ule muda maalumu. Jicho la Mungu linaloona yote lilisoma mioyo yao. Hawakutaka kusikia juu ya kuja kwa Kristo kuhukumu ulimwengu kwa haki. Walikuwa watumishi wasio waaminifu, matendo yao yasingeweza kustahimili ukaguzi wa Mungu anayechunguza moyo, na waliogopa kukutana na Bwana wao. Kama Wayahudi wakati wa kuja kwa mara ya kwanza kwa Kristo, hawakuwa tayari kumkaribisha Yesu. Shetani na malaika zake walishangilia na kumrushia dhihaka Kristo na malaika watakatifu, kwamba watu Wake wanaokiri jina Lake walikuwa na upendo mdogo sana Kwake kiasi kwamba hawakutamani kutokea Kwake.",
        "Walinzi wasio waaminifu walizuia maendeleo ya kazi ya Mungu. Wakati watu walipoamshwa na kuanza kuuliza njia ya wokovu, viongozi hawa waliingilia kati yao na ukweli, wakitafuta kutuliza hofu zao kwa kulitafsiri Neno la Mungu isivyo kweli. Katika kazi hii Shetani na wachungaji wasiowekwa wakfu waliungana, wakipiga kelele, Amani, amani, wakati Mungu alikuwa hajanena amani. Kama Mafarisayo katika siku za Kristo, wengi walikataa kuingia katika ufalme wa mbinguni wao wenyewe, na wale waliokuwa wakiingia waliwazuia. Damu ya roho hizi itadaiwa mikononi mwao.",
        "Kila mahali ambapo ujumbe wa ukweli ulitangazwa, wanyenyekevu na waliojitolea zaidi makanisani walikuwa wa kwanza kuupokea. Wale waliojifunza Biblia wenyewe hawakuweza kuacha kuona tabia isiyo ya kimaandiko ya mitazamo maarufu ya unabii, na kila mahali ambapo watu hawakudanganywa na juhudi za makasisi kupotosha na kugeuza imani, kila mahali ambapo wangechunguza Neno la Mungu wao wenyewe, fundisho la marejeo lilihitaji tu kulinganishwa na Maandiko ili kuthibitisha mamlaka yake ya kimungu.",
        "Wengi waliteswa na ndugu zao wasioamini. Ili kudumisha nafasi zao kanisani, wengine walikubali kukaa kimya kuhusu tumaini lao, lakini wengine walihisi kwamba uaminifu kwa Mungu uliwakataza kuficha ukweli ambao Yeye alikuwa ameuweka amana kwao. Si wachache waliotengwa na ushirika wa kanisa kwa sababu nyingine yoyote isipokuwa kuelezea imani yao katika kuja kwa Kristo. Yalikuwa ya thamani sana kwa wale waliobeba jaribu la imani yao maneno ya nabii, “Ndugu zenu wawachukiao, waliowatupa kwa ajili ya jina Langu, walisema, Bwana na atukuzwe; lakini Yeye atatokea kwa furaha yenu, nao watatahayari.” Isaya 66:5.",
        "Malaika wa Mungu walikuwa wakitazama kwa maslahi makubwa matokeo ya onyo hilo. Wakati makanisa kama kikundi yalipokataa ujumbe huo, malaika waligeuka kutoka kwao kwa huzuni. Hata hivyo, kulikuwa na wengi makanisani ambao walikuwa bado hawajajaribiwa kuhusiana na ukweli wa marejeo. Wengi walidanganywa na waume, wake, wazazi, au watoto, na kufanywa waamini kuwa ni dhambi hata kusikiliza mafundisho hayo ya kigeni kama yale yaliyofundishwa na Waadventista. Malaika waliamriwa kuendelea kuwalinda kwa uaminifu watu hawa; kwani nuru nyingine ilikuwa bado iwaangazie kutoka kwenye kiti cha enzi cha Mungu."
      ]
    },
    "keyPoints": {
      "en": [
        "Sin is transgression of God’s law"
      ],
      "sw": [
        "Dhambi ni kuvunja sheria ya Mungu",
        "Dhambi huvunja uhusiano na Mungu",
        "Dhambi huleta utengano na mauti"
      ]
    }
  },
  {
    "id": "the-cross-explained",
    "description": {
      "en": [
        "A clear explanation of the cross as the meeting point of God’s justice and mercy."
      ],
      "sw": [
        "Ufafanuzi wa msalaba kama mahali ambapo haki na rehema ya Mungu hukutana."
      ]
    },
    "keyPoints": {
      "en": [
        "The cross reveals God’s love and justice",
        "Christ bore the penalty of sin",
        "Salvation is a gift through sacrifice"
      ],
      "sw": [
        "Msalaba unaonyesha upendo na haki ya Mungu",
        "Kristo alichukua adhabu ya dhambi",
        "Wokovu ni zawadi kupitia dhabihu"
      ]
    }
  },
  {
    "id": "walking-with-god",
    "description": {
      "en": [
        "A study showing that eternal life begins now through a daily relationship with God."
      ],
      "sw": [
        "Somo linaloonyesha kuwa uzima wa milele unaanza sasa kupitia uhusiano wa kila siku na Mungu."
      ]
    },
    "keyPoints": {
      "en": [
        "Eternal life is knowing God",
        "Relationship with God begins now",
        "Daily communion sustains spiritual life"
      ],
      "sw": [
        "Uzima wa milele ni kumjua Mungu",
        "Uhusiano na Mungu unaanza sasa",
        "Ushirika wa kila siku huimarisha maisha ya kiroho"
      ]
    }
  }
]