[
  {
    "id": "character-of-god",
    "description": {
      "en": [
        "“God is love.” 1 John 4:16. His nature, His law, is love. It ever has been; it ever will be. “The high and lofty One that inhabiteth eternity,” whose “ways are everlasting,” changeth not. With Him “is no variableness, neither shadow of turning.” Isaiah 57:15; Habakkuk 3:6; James 1:17. Every manifestation of creative power is an expression of infinite love. The sovereignty of God involves fullness of blessing to all created beings. The psalmist says: “Strong is Thy hand, and high is Thy right hand. Righteousness and judgment are the foundation of Thy throne: Mercy and truth go before Thy face. Blessed is the people that know the joyful sound: They walk, O Lord, in the light of Thy countenance. In Thy name do they rejoice all the day: And in Thy righteousness are they exalted. For Thou art the glory of their strength: ... For our shield belongeth unto Jehovah, And our king to the Holy One.” Psalm 89:13-18, R.V.",
        "The history of the great conflict between good and evil, from the time it first began in heaven to the final overthrow of rebellion and the total eradication of sin, is also a demonstration of God’s unchanging love. The Sovereign of the universe was not alone in His work of beneficence. He had an associate—a co-worker who could appreciate His purposes, and could share His joy in giving happiness to created beings. “In the beginning was the Word, and the Word was with God, and the Word was God. The same was in the beginning with God.” John 1:1, 2. Christ, the Word, the only begotten of God, was one with the eternal Father—one in nature, in character, in purpose—the only being that could enter into all the counsels and purposes of God. “His name shall be called Wonderful, Counselor, The mighty God, The everlasting Father, The Prince of Peace.” Isaiah 9:6. His “goings forth have been from of old, from everlasting.” Micah 5:2. And the Son of God declares concerning Himself: “The Lord possessed Me in the beginning of His way, before His works of old. I was set up from everlasting.... When He appointed the foundations of the earth: then I was by Him, as one brought up with Him: and I was daily His delight, rejoicing always before Him.” Proverbs 8:22-30.",
        "The Father wrought by His Son in the creation of all heavenly beings. “By Him were all things created, ... whether they be thrones, or dominions, or principalities, or powers: all things were created by Him, and for Him.” Colossians 1:16. Angels are God’s ministers, radiant with the light ever flowing from His presence and speeding on rapid wing to execute His will. But the Son, the anointed of God, the “express image of His person,” “the brightness of His glory,” “upholding all things by the word of His power,” holds supremacy over them all. Hebrews 1:3. “A glorious high throne from the beginning,” was the place of His sanctuary (Jeremiah 17:12); “a scepter of righteousness,” the scepter of His kingdom. Hebrews 1:8. “Honor and majesty are before Him: strength and beauty are in His sanctuary.” Psalm 96:6. Mercy and truth go before His face. Psalm 89:14.",
        "The law of love being the foundation of the government of God, the happiness of all intelligent beings depends upon their perfect accord with its great principles of righteousness. God desires from all His creatures the service of love—service that springs from an appreciation of His character. He takes no pleasure in a forced obedience; and to all He grants freedom of will, that they may render Him voluntary service. So long as all created beings acknowledged the allegiance of love, there was perfect harmony throughout the universe of God. It was the joy of the heavenly host to fulfill the purpose of their Creator. They delighted in reflecting His glory and showing forth His praise. And while love to God was supreme, love for one another was confiding and unselfish. There was no note of discord to mar the celestial harmonies.",
        "But a change came over this happy state. There was one who perverted the freedom that God had granted to His creatures. Sin originated with him who, next to Christ, had been most honored of God and was highest in power and glory among the inhabitants of heaven. Lucifer, “son of the morning,” was first of the covering cherubs, holy and undefiled. He stood in the presence of the great Creator, and the ceaseless beams of glory enshrouding the eternal God rested upon him. “Thus saith the Lord God; Thou sealest up the sum, full of wisdom, and perfect in beauty. Thou hast been in Eden the garden of God; every precious stone was thy covering.... Thou art the anointed cherub that covereth; and I have set thee so: thou wast upon the holy mountain of God; thou hast walked up and down in the midst of the stones of fire. Thou wast perfect in thy ways from the day that thou wast created, till iniquity was found in thee.” Ezekiel 28:12-15.",
        "Little by little Lucifer came to indulge the desire for self-exaltation. The Scripture says, “Thine heart was lifted up because of thy beauty, thou hast corrupted thy wisdom by reason of thy brightness.” Ezekiel 28:17. “Thou hast said in thine heart, ...I will exalt my throne above the stars of God.... I will be like the Most High.” Isaiah 14:13, 14. Though all his glory was from God, this mighty angel came to regard it as pertaining to himself. Not content with his position, though honored above the heavenly host, he ventured to covet homage due alone to the Creator. Instead of seeking to make God supreme in the affections and allegiance of all created beings, it was his endeavor to secure their service and loyalty to himself. And coveting the glory with which the infinite Father had invested His Son, this prince of angels aspired to power that was the prerogative of Christ alone.",
        "Now the perfect harmony of heaven was broken. Lucifer’s disposition to serve himself instead of his Creator aroused a feeling of apprehension when observed by those who considered that the glory of God should be supreme. In heavenly council the angels pleaded with Lucifer. The Son of God presented before him the greatness, the goodness, and the justice of the Creator, and the sacred, unchanging nature of His law. God Himself had established the order of heaven; and in departing from it, Lucifer would dishonor his Maker and bring ruin upon himself. But the warning, given in infinite love and mercy, only aroused a spirit of resistance. Lucifer allowed his jealousy of Christ to prevail, and became the more determined.",
        "To dispute the supremacy of the Son of God, thus impeaching the wisdom and love of the Creator, had become the purpose of this prince of angels. To this object he was about to bend the energies of that master mind, which, next to Christ’s, was first among the hosts of God. But He who would have the will of all His creatures free, left none unguarded to the bewildering sophistry by which rebellion would seek to justify itself. Before the great contest should open, all were to have a clear presentation of His will, whose wisdom and goodness were the spring of all their joy.",
        "The King of the universe summoned the heavenly hosts before Him, that in their presence He might set forth the true position of His Son and show the relation He sustained to all created beings. The Son of God shared the Father’s throne, and the glory of the eternal, self-existent One encircled both. About the throne gathered the holy angels, a vast, unnumbered throng—“ten thousand times ten thousand, and thousands of thousands” (Revelation 5:11.), the most exalted angels, as ministers and subjects, rejoicing in the light that fell upon them from the presence of the Deity. Before the assembled inhabitants of heaven the King declared that none but Christ, the Only Begotten of God, could fully enter into His purposes, and to Him it was committed to execute the mighty counsels of His will.",
        "The Son of God had wrought the Father’s will in the creation of all the hosts of heaven; and to Him, as well as to God, their homage and allegiance were due. Christ was still to exercise divine power, in the creation of the earth and its inhabitants. But in all this He would not seek power or exaltation for Himself contrary to God’s plan, but would exalt the Father’s glory and execute His purposes of beneficence and love. The angels joyfully acknowledged the supremacy of Christ, and prostrating themselves before Him, poured out their love and adoration. Lucifer bowed with them, but in his heart there was a strange, fierce conflict. Truth, justice, and loyalty were struggling against envy and jealousy. The influence of the holy angels seemed for a time to carry him with them.",
        "As songs of praise ascended in melodious strains, swelled by thousands of glad voices, the spirit of evil seemed vanquished; unutterable love thrilled his entire being; his soul went out, in harmony with the sinless worshippers, in love to the Father and the Son. But again he was filled with pride in his own glory. His desire for supremacy returned, and envy of Christ was once more indulged. The high honors conferred upon Lucifer were not appreciated as God’s special gift, and therefore, called forth no gratitude to his Creator. He gloried in his brightness and exaltation and aspired to be equal with God. He was beloved and reverenced by the heavenly host, angels delighted to execute his commands, and he was clothed with wisdom and glory above them all. Yet the Son of God was exalted above him, as one in power and authority with the Father. He shared the Father’s counsels, while Lucifer did not thus enter into the purposes of God.",
        "“Why,” questioned this mighty angel, “should Christ have the supremacy? Why is He honored above Lucifer?” Leaving his place in the immediate presence of the Father, Lucifer went forth to diffuse the spirit of discontent among the angels. He worked with mysterious secrecy, and for a time concealed his real purpose under an appearance of reverence for God. He began to insinuate doubts concerning the laws that governed heavenly beings, intimating that though laws might be necessary for the inhabitants of the worlds, angels, being more exalted, needed no such restraint, for their own wisdom was a sufficient guide. They were not beings that could bring dishonor to God; all their thoughts were holy; it was no more possible for them than for God Himself to err.",
        "The exaltation of the Son of God as equal with the Father was represented as an injustice to Lucifer, who, it was claimed, was also entitled to reverence and honor. If this prince of angels could but attain to his true, exalted position, great good would accrue to the entire host of heaven; for it was his object to secure freedom for all. But now even the liberty which they had hitherto enjoyed was at an end; for an absolute Ruler had been appointed them, and to His authority all must pay homage. Such were the subtle deceptions that through the wiles of Lucifer were fast obtaining in the heavenly courts.",
        "There had been no change in the position or authority of Christ. Lucifer’s envy and misrepresentation and his claims to equality with Christ had made necessary a statement of the true position of the Son of God; but this had been the same from the beginning. Many of the angels were, however, blinded by Lucifer’s deceptions. Taking advantage of the loving, loyal trust reposed in him by the holy beings under his command, he had so artfully instilled into their minds his own distrust and discontent that his agency was not discerned. Lucifer had presented the purposes of God in a false light—misconstruing and distorting them to excite dissent and dissatisfaction.",
        "He cunningly drew his hearers on to give utterance to their feelings; then these expressions were repeated by him when it would serve his purpose, as evidence that the angels were not fully in harmony with the government of God. While claiming for himself perfect loyalty to God, he urged that changes in the order and laws of heaven were necessary for the stability of the divine government. Thus while working to excite opposition to the law of God and to instill his own discontent into the minds of the angels under him, he was ostensibly seeking to remove dissatisfaction and to reconcile disaffected angels to the order of heaven. While secretly fomenting discord and rebellion, he with consummate craft caused it to appear as his sole purpose to promote loyalty and to preserve harmony and peace.",
        "The spirit of dissatisfaction thus kindled was doing its baleful work. While there was no open outbreak, division of feeling imperceptibly grew up among the angels. There were some who looked with favor upon Lucifer’s insinuations against the government of God. Although they had heretofore been in perfect harmony with the order which God had established, they were now discontented and unhappy because they could not penetrate His unsearchable counsels; they were dissatisfied with His purpose in exalting Christ. These stood ready to second Lucifer’s demand for equal authority with the Son of God.",
        "But angels who were loyal and true maintained the wisdom and justice of the divine decree and endeavored to reconcile this disaffected being to the will of God. Christ was the Son of God; He had been one with Him before the angels were called into existence. He had ever stood at the right hand of the Father; His supremacy, so full of blessing to all who came under its benignant control, had not heretofore been questioned. The harmony of heaven had never been interrupted; wherefore should there now be discord? The loyal angels could see only terrible consequences from this dissension, and with earnest entreaty they counseled the disaffected ones to renounce their purpose and prove themselves loyal to God by fidelity to His government.",
        "In great mercy, according to His divine character, God bore long with Lucifer. The spirit of discontent and disaffection had never before been known in heaven. It was a new element, strange, mysterious, unaccountable. Lucifer himself had not at first been acquainted with the real nature of his feelings; for a time he had feared to express the workings and imaginings of his mind; yet he did not dismiss them. He did not see whither he was drifting. But such efforts as infinite love and wisdom only could devise, were made to convince him of his error. His disaffection was proved to be without cause, and he was made to see what would be the result of persisting in revolt.",
        "Lucifer was convinced that he was in the wrong. He saw that “the Lord is righteous in all His ways, and holy in all His works” (Psalm 145:17); that the divine statutes are just, and that he ought to acknowledge them as such before all heaven. Had he done this, he might have saved himself and many angels. He had not at that time fully cast off his allegiance to God. Though he had left his position as covering cherub, yet if he had been willing to return to God, acknowledging the Creator’s wisdom, and satisfied to fill the place appointed him in God’s great plan, he would have been reinstated in his office. The time had come for a final decision; he must fully yield to the divine sovereignty or place himself in open rebellion. He nearly reached the decision to return, but pride forbade him.",
        "It was too great a sacrifice for one who had been so highly honored to confess that he had been in error, that his imaginings were false, and to yield to the authority which he had been working to prove unjust. A compassionate Creator, in yearning pity for Lucifer and his followers, was seeking to draw them back from the abyss of ruin into which they were about to plunge. But His mercy was misinterpreted. Lucifer pointed to the long-suffering of God as an evidence of his own superiority, an indication that the King of the universe would yet accede to his terms. If the angels would stand firmly with him, he declared, they could yet gain all that they desired.",
        "He persistently defended his own course, and fully committed himself to the great controversy against his Maker. Thus it was that Lucifer, “the light bearer,” the sharer of God’s glory, the attendant of His throne, by transgression became Satan, “the adversary” of God and holy beings and the destroyer of those whom Heaven had committed to his guidance and guardianship. Rejecting with disdain the arguments and entreaties of the loyal angels, he denounced them as deluded slaves. The preference shown to Christ he declared an act of injustice both to himself and to all the heavenly host, and announced that he would no longer submit to this invasion of his rights and theirs.",
        "He would never again acknowledge the supremacy of Christ. He had determined to claim the honor which should have been given him, and take command of all who would become his followers; and he promised those who would enter his ranks a new and better government, under which all would enjoy freedom. Great numbers of the angels signified their purpose to accept him as their leader. Flattered by the favor with which his advances were received, he hoped to win all the angels to his side, to become equal with God Himself, and to be obeyed by the entire host of heaven.",
        "Still the loyal angels urged him and his sympathizers to submit to God; and they set before them the inevitable result should they refuse: He who had created them could overthrow their power and signally punish their rebellious daring. No angel could successfully oppose the law of God, which was as sacred as Himself. They warned all to close their ears against Lucifer’s deceptive reasoning, and urged him and his followers to seek the presence of God without delay and confess the error of questioning His wisdom and authority. Many were disposed to heed this counsel, to repent of their disaffection, and seek to be again received into favor with the Father and His Son.",
        "But Lucifer had another deception ready. The mighty revolter now declared that the angels who had united with him had gone too far to return; that he was acquainted with the divine law, and knew that God would not forgive. He declared that all who should submit to the authority of Heaven would be stripped of their honor, degraded from their position. For himself, he was determined never again to acknowledge the authority of Christ. The only course remaining for him and his followers, he said, was to assert their liberty, and gain by force the rights which had not been willingly accorded them.",
        "So far as Satan himself was concerned, it was true that he had now gone too far to return. But not so with those who had been blinded by his deceptions. To them the counsel and entreaties of the loyal angels opened a door of hope; and had they heeded the warning, they might have broken away from the snare of Satan. But pride, love for their leader, and the desire for unrestricted freedom were permitted to bear sway, and the pleadings of divine love and mercy were finally rejected. God permitted Satan to carry forward his work until the spirit of disaffection ripened into active revolt. It was necessary for his plans to be fully developed, that their true nature and tendency might be seen by all.",
        "Lucifer, as the anointed cherub, had been highly exalted; he was greatly loved by the heavenly beings, and his influence over them was strong. God’s government included not only the inhabitants of heaven, but of all the worlds that He had created; and Lucifer had concluded that if he could carry the angels of heaven with him in rebellion, he could carry also all the worlds. He had artfully presented his side of the question, employing sophistry and fraud to secure his objects. His power to deceive was very great. By disguising himself in a cloak of falsehood, he had gained an advantage. All his acts were so clothed with mystery that it was difficult to disclose to the angels the true nature of his work. Until fully developed, it could not be made to appear the evil thing it was.",
        "Even the loyal angels could not fully discern his character or see to what his work was leading. Lucifer had at first so conducted his temptations that he himself stood uncommitted. The angels whom he could not bring fully to his side, he accused of indifference to the interests of heavenly beings. The very work which he himself was doing, he charged upon the loyal angels. It was his policy to perplex with subtle arguments concerning the purposes of God. Everything that was simple he shrouded in mystery, and by artful perversion cast doubt upon the plainest statements of Jehovah. And his high position, so closely connected with the divine government, gave greater force to his representations.",
        "God could employ only such means as were consistent with truth and righteousness. Satan could use what God could not—flattery and deceit. He had sought to falsify the word of God and had misrepresented His plan of government, claiming that God was not just in imposing laws upon the angels; that in requiring submission and obedience from His creatures, He was seeking merely the exaltation of Himself. It was therefore necessary to demonstrate before the inhabitants of heaven, and of all the worlds, that God’s government is just, His law perfect. Satan had made it appear that he himself was seeking to promote the good of the universe. The true character of the usurper and his real object must be understood by all. He must have time to manifest himself by his wicked works.",
        "The discord which his own course had caused in heaven, Satan charged upon the government of God. All evil he declared to be the result of the divine administration. He claimed that it was his own object to improve upon the statutes of Jehovah. Therefore God permitted him to demonstrate the nature of his claims, to show the working out of his proposed changes in the divine law. His own work must condemn him. Satan had claimed from the first that he was not in rebellion. The whole universe must see the deceiver unmasked. Even when he was cast out of heaven, Infinite Wisdom did not destroy Satan. Since only the service of love can be acceptable to God, the allegiance of His creatures must rest upon a conviction of His justice and benevolence.",
        "The inhabitants of heaven and of the worlds, being unprepared to comprehend the nature or consequences of sin, could not then have seen the justice of God in the destruction of Satan. Had he been immediately blotted out of existence, some would have served God from fear rather than from love. The influence of the deceiver would not have been fully destroyed, nor would the spirit of rebellion have been utterly eradicated. For the good of the entire universe through ceaseless ages, he must more fully develop his principles, that his charges against the divine government might be seen in their true light by all created beings, and that the justice and mercy of God and the immutability of His law might be forever placed beyond all question.",
        "Satan’s rebellion was to be a lesson to the universe through all coming ages—a perpetual testimony to the nature of sin and its terrible results. The working out of Satan’s rule, its effects upon both men and angels, would show what must be the fruit of setting aside the divine authority. It would testify that with the existence of God’s government is bound up the well-being of all the creatures He has made. Thus the history of this terrible experiment of rebellion was to be a perpetual safeguard to all holy beings, to prevent them from being deceived as to the nature of transgression, to save them from committing sin, and suffering its penalty.",
        "He that ruleth in the heavens is the one who sees the end from the beginning—the one before whom the mysteries of the past and the future are alike outspread, and who, beyond the woe and darkness and ruin that sin has wrought, beholds the accomplishment of His own purposes of love and blessing. Though “clouds and darkness are round about Him: righteousness and judgment are the foundation of His throne.” Psalm 97:2, R.V. And this the inhabitants of the universe, both loyal and disloyal, will one day understand. “His work is perfect: for all His ways are judgment: a God of truth and without iniquity, just and right is He.” Deuteronomy 32:4."
      ],
      "sw": [
        "“Mungu ni pendo” 1 Yohana 4:16. Asili Yake, Sheria Yake, ni upendo. Daima imekuwa; daima itaendelea kuwa. “Aliye juu, akaaye mahali palipoinuka, akaaye milele,” ambaye “miendo yake ilikuwa kama siku za kale” habadiliki. Kwake Yeye “hakuna kigeugeu, wala kivuli cha kugeuka geuka.” Isaya 57:15; Habakuki 3:6; Yakobo 1:17. Kila udhihirisho wa nguvu ya uumbaji ni sura ya upendo usio na mwisho. Utawala wa Mungu umejazwa na mibaraka kwa viumbe vyote. Mtunga zaburi anasema: “Mkono wako ni mkono wenye uweza, Mkono wako una nguvu, mkono wako wa Kuume umetukuka. Haki na hukumu ndio msingi wa kiti chako. Fadhili na kweli Zahudhuria mbele za uso wako. Heri watu wale waijuao sauti ya shangwe , Ee Bwana, huenda katika nuru ya uso Wako. Kwa jina lako hufarahi mchana kutwa, na kwa haki yako hutukuzwa. Maana fahari ya nguvu zao ni wewe. Na kwa radhi yako pembe yetu itatukuka. Maana ngao yetu ina Bwana. Na mfalme wetu ni wake. Mtakatifu wa Israeli.” Zaburi 89:13-18.",
        "Historia ya pambano kuu kati ya wema na uovu, tokea wakati lilipoanza kwa mara ya kwanza mbinguni hadi mwisho wa kushindwa kwa uasi na kufutiliwa kwa dhambi, pia ni kielelezo cha upendo wa Mungu usiobadilika. Mtawala wa ulimwengu hakuwa peke yake katika kazi Yake. Alikuwa na mshirika – mfanya kazi mwenzake ambaye angethamini makusudi Yake, na angeshiriki furaha Yake kwa kutoa furaha kwa viumbe. “Hapo mwanzo kulikuwako Neno, naye Neno Alikuwa pamoja na Mungu, naye Neno alikuwa Mungu. Huyo alikuwa pamoja na Mungu hapo mwanzo.” Yohana 1:1,2. Kristo, ambaye ni Neno, mwana wa pekee wa Mungu, ndiye aliyekuwa pamoja na Baba wa milele – mmoja katika asili, katika tabia, katika makusudi – ambaye pekee alishiriki katika mashauri na makusudi ya Mungu. “Naye ataitwa Jina lake Mshauri wa ajabu, Mungu mwenye nguvu, Baba wa milele, Mfalme wa amani.” Isaya 9:6. “Matokeo Yake yamekuwa tangu zamani za kale, tangu milele.” Mika 5:2.",
        "Na mwana wa Mungu alijisema Yeye Mwenyewe: “Bwana alikuwa nami katika mwanzo wa njia yake, kabla ya matendo yake ya kale. Nalitukuka tokea milele…..alipoweka misingi ya dunia: nilikuwa Naye, kama mmoja aliyetokea pamoja Naye: na nilikuwa furaha Yake ya kila siku, nikifurahi wakati wote mbele Zake. Mithali 8:22-30. Baba alisema kwa Mwana wake wakati wa uumbaji wa viumbe wa mbinguni. “Vitu vyote viliumbwa katika yeye….ikiwa ni vitu vya enzi, au usultani, au enzi, au mamlaka, vitu vyote viliumbwa kwa njia yake na kwa ajili yake.” Wakolosai 1:16. Malaika ni watumishi wa Mungu, wakiakisi nuru inayotoka daima kutoka uwepo wake na kusambaa haraka katika mabawa ili kutenda mapenzi yake. Lakini Mwana, mtiwa mafuta wa Mungu, “sura ya nafsi Yake”, “mng`ao wa utukufu Wake” “Akivishika vitu vyote kwa neno la nguvu Zake,” mwenye uwezo mkuu juu ya wote. Waebrania 1:3.",
        "“Kiti cha enzi cha juu chenye utukufu tokea mwanzo,” palikuwa mahali pa patakatifu Pake (Yeremia 17:12); “Fimbo ya haki,” fimbo ya ufalme. Waebrania 1:8. “Heshima na ukuu viko mbele Zake: nguvu na uzuri viko ndani ya patakatifu Pake.” Zaburi 96:6. Rehema na kweli ziko mbele ya uso Wake. Zaburi 89:14. Sheria ya upendo ikiwa ndio msingi wa serikali ya Mungu, furaha ya viumbe wote inategemea utii kamili wa kanuni kuu za haki. Mungu anatamani kutoka katika viumbe Wake wote utumishi wa upendo – utumishi unaotoka kwenye chemichemi ya thamani ya tabia Yake. Hafurahii katika utii wa kulazimishwa; na kwa wote anatoa uhuru wa utii, ili watoe utumishi wa kujitoa. Kadri viumbe wote walipotambua utii wa upendo, kulikuwepo na upatanifu mkamilifu katika ulimwengu wote wa Mungu.",
        "Alikuwepo mmoja aliyepotosha uhuru ambao Mungu aliutoa kwa viumbe wake. Dhambi ilianzia kwake ambaye alimfuatia Kristo, alikuwa akiheshimiwa kwa Mungu na alikuwa mwenye nguvu na utukufu kuzidi wote miongoni mwa wakazi wa mbinguni. Lucifer, “mwana wa asubuhi,” alikuwa kerubi afunikaye wa kwanza, mtakatifu na asiye na uchafu. Alisimama mbele ya muumbaji Mkuu, na miali isiyokwisha ya utukufu ikitokea kwa Mungu wa milele ilikuwa juu yake. “Bwana Mungu asema hivi: Wewe wakitia muhuri kipimo, umejaa hekima na ukamilifu wa uzuri. Ulikuwa ndani ya Edeni, bustani ya Mungu, kila jiwe la thamani lilikuwa kifuniko chako…Wewe ulikuwa kerubi mwenye kutiwa mafuta afunikaye; nami nalikuweka hata ukawa juu ya mlima mtakatifu wa Mungu, umetembea huko na huko kati ya mawe ya moto. Ulikuwa mkamilifu katika njia zako tangu siku ile ulipoumbwa, hata uovu ulipoonekana ndani yako.” Ezekieli 28:12-15.",
        "Taratibu Lucifer alijiingiza katika tamaa ya kujikweza nafsi. Maandiko yanasema, “Moyo wako uliinuka kwa sababu ya uzuri wako, umeiharibu hekima yako kwa sababu ya mwangaza wako.” Ezekieli 28:17. “Nawe ulisema moyoni mwako,…..Nitakiinua kiti changu juu kuliko nyota za Mungu…….Nitafanana na yeye aliye Juu.” Isaya 14:13,14. Ingawa utukufu wake wote ulitoka kwa Mungu, malaika huyu mwenye nguvu alijichukulia kana kwamba ulitokana na yeye mwenyewe. Bila kujali nafasi yake, ingawa aliheshiwa na wakazi wa mbinguni, alithubutu kudai heshima kuu ambayo ni stahili kwa Muumba pekee. Badala ya kutaka kumfanya Mungu atiiwe na viumbe vyote, ilikuwa ni jitihada yake kutaka kutumikiwa na kutiiwa yeye mwenyewe. Na akitamani utukufu ambao Baba wa milele alimpa Mwana wake, mfalme huyu wa malaika alitamani kuwa na nguvu ambazo ni haki ya Kristo pekee.",
        "Sasa upatanifu kamili wa mbinguni ulivunjwa. Mpango wa Lucifer wa kutaka kutumikiwa badala ya Muumba wake uliamsha hofu ulipotazamwa na wale walioona kuwa utukufu wa Mungu ndio wenye nguvu. Katika baraza la mbinguni malaika walimsihi Lucifer. Mwana wa Mungu aliweka mbele yake ukuu, uzuri, na haki ya Muumba, na utakatifu, kutokubadika kwa asili ya sheria Yake. Mungu mwenyewe ndiye aliyeweka utaratibu wa mbinguni; na kutoka katika utaratibu huu, Lucifer angemdharau Muumba wake na kuleta vita juu yake mwenyewe. Lakini tahadhari iliyotolewa kwa upendo usio na mwisho na rehema, iliamsha roho ya kupinga. Lucifer aliruhusu wivu wake dhidi ya Kristo umshinde, na akawa na ushindani zaidi. Kushindana dhidi ya Ukuu wa Mwana wa Mungu, hivyo kuishitaki hekima na upendo wa Muumbaji, limekuwa ni kusudi la mfalme huyu wa malaika.",
        "Mfalme wa ulimwengu alilikusanya jeshi la mbinguni mbele Yake, ili katika uwepo wao Aweze kuweka dhahiri nafasi ya Mwana wake na kuonyesha uhusiano alioubainisha kwa viumbe wote. Mwana wa Mungu alishiriki katika kiti cha enzi cha Baba, na utukufu wa milele, uwezo wa kuwepo mwenyewe vyote viwili vilimzunguka. Karibu na kiti cha enzi walikuwepo malaika watakatifu, kundi kubwa lisiloweza kuhesabika, - “Kumi elfu mara kumi elfu na maelfu kwa maelfu” (Ufunuo 5:11), malaika waliotukuka mno, kama watumishi na raia, wakifuhia nuru iliyowaangukia kutoka katika uwepo wa Mungu. Mbele ya kusanyiko la mbinguni Mfalme alitangaza kwamba, hakuna mwingine isipokuwa Mwana pekee wa Mungu angeweza kushiriki katika makusudi Yake, na kwa Huyo alipewa kutekeleza mashauri ya nguvu ya nia Yake.",
        "Mwana wa Mungu alifanyia kazi mapenzi ya Baba katika uumbaji wa jeshi lote la mbinguni; na Kwake, kama ilivyo kwa Mungu, utii wao ulipaswa kuelekezwa. Kristo alipaswa bado kutumia nguvu zake za Uungu katika uumbaji wa dunia na wakaaji wake. Lakini katika yote haya Hakutafuta nguvu ya kujikweza mwenyewe kinyume na mpango wa Mungu, lakini aliukweza utukufu wa Baba na kutekeleza nia Yake ya upendo. Kwa furaha malaika walitambua ukuu wa Kristo, na wakasujudu mbele Zake, wakaabudu kwa upendo wao. Lucifer alisujudu pamoja nao, lakini ndani ya moyo wake kulikwa na kitu kigeni, vita kali. Ukweli, haki na utii vilikuwa vinapambana dhidi ya wivu. Mvuto wa malaika watakatifu ulionekana kwa wakati fulani kumfunika. Kadri sauti tamu za nyimbo zilivyosikika, roho ya uasi ilionekana, kutokuonyesha upendo kulizingira uwepo wake.",
        "Alijazwa na kiburi kwa sababu ya utukufu wake. Tamaa yake ya ukuu ilirudi tena, na chuki dhidi ya Kristo ilizidi kukua. Heshima kubwa aliyopewa Lucifer hakuichukulia kama zawadi maalumu toka kwa Mungu, na hivyo hakuweza kushukuru kwa muumba wake. Alijitukuza kutokana na mng‘ao wake na akajikweza na kutaka awe sawa na Mungu. Alikuwa mpendwa wa jeshi la mbinguni, malaika walifurahia kutekeleza amri zake, na alivishwa kwa hekima na utukufu zaidi ya malaika wote. Hata hivyo Mwana wa Mungu alikwezwa juu yake, kama aliye sawa na Mungu katika nguvu na mamlaka. Alishiriki mashauri ya Baba, wakati Lucifer hakushiriki katika malengo ya Mungu. “Kwa nini,” aliuliza malaika huyu mwenye nguvu, “Kristo awe na ukuu? Kwa nini anaheshimiwa zaidi ya Lucifer?”",
        "Akiwa ameacha mahali pake katika uwepo wa Baba, Lucifer aliendelea kueneza roho ya kutotii miongoni mwa malaika. Alifanya kazi kwa siri ya ajabu, na kwa wakati alificha nia yake alipoonekana kwa Mungu. Alianza kuwa na wasiwasi kuhusu sheria inayotawala mbinguni, akiwaza moyoni kwamba ingawa sheria inaweza kuwa muhimu kwa wakaaji katika malimwengu, malaika, wakiwa wako juu zaidi, hawakuhitaji kizuizi hicho cha sheria, maana hekima yao ilikuwa inatosha kuwaongoza. Hawakuwa viumbe ambao wasingemheshimu Mungu; mawazo yao yote yalikuwa matakatifu, hapakuwepo na uwezekano kwao wa kukosa kama ilivyo kwa Mungu. Ukuu wa Mwana wa Mungu kuwa sawa na ukuu wa Mungu ulionekana kama kutokuwa wa haki mbele za Lucifer, ambaye, alidai, alipaswa kuabudiwa na kuheshimiwa.",
        "Malaika wengi walipofushwa na madanganyo ya Lucifer. Akijivunia uaminifu uliotolewa kwa upendo katika utii ulioonyeshwa kwake na viumbe watakatifu, aliingiza kwa ujanja kutokuamini kwake ndani ya akili zao bila wao kutambua. Lucifer alionyesha malengo ya Mungu katika nuru isiyo sahihi – akiwapotosha na kuwachochea wasisimuke kwa kutokukubali na kutoridhika. Kwa werevu aliwafanya wasikilizaji wake watoe matamko ya hisia zao; kisha maelezo hayo akayarudia yeye kana kwamba yalikuwa sawa na lengo lake, kuwa uthibitisho kwamba malaika hawakukubaliana kikamilifu na serikali ya Mungu. Akiwa anadai kuwa na utii mkamilifu kwa Mungu, alisihi kuwa mabadiliko katika utaratibu na sheria za mbinguni ni lazima kwa ajili ya kuifanya imara serikali ya mbinguni.",
        "Roho ya kutokuridhika iliyowashwa ilikuwa ikifanya kazi yake nzito. Ikiwa hapakuonekana wazi, utengano katika hisia ulikuwa miongoni mwa malaika. Wapo waliomtazama Lucifer kwa kumuunga mkono kinyume na serikali ya Mungu. Ingawa walikuwa na upatano na utaratibu ambao Mungu aliuanzisha, kwa sasa hawakuridhika na hawakuwa na furaha kwa sababu hawakuweza kuingia ndani ya mashauri Yake yasiyochunguzika; hawakuridhishwa na mpango wa kumkweza Kristo. Hawa walisimama nafasi ya pili kutoka kwa Lucifer tayari kudai uwepo usawa wa madaraka na Mwana wa Mungu. Lakini malaika waliokuwa watiifu waliendeleza hekima na haki ya tangazo la mbinguni na waliendelea kuwapatanisha viumbe ambao hawakuridhishwa na nia ya Mungu.",
        "Kristo alikuwa Mwana wa Mungu; amekuwa pamoja na Mungu kabla ya kuwapo kwa malaika. Amekuwa katika mkono wa kuume wa Baba, utawala Wake, ukijawa na baraka kwa wale walioukubali, haukuwahi kutiliwa mashaka. Upatano wa mbinguni haujawahi kamwe kuingiliwa; kutokukubali huku kumetoka wapi? Malaika watakatifu waliona matokeo ya hatari kutokana na ukaidi huu, na kwa moyo wa kusihi waliwashauri ambao hawakuridhika kuachana na mpango wao na kujihakikisha wenyewe kuwa ni watiifu kwa Mungu na waaminifu kwa serikali Yake. Kwa rehema nyingi, kutokana na tabia Yake ya Uungu, Mungu alichukuliana kwa mda mrefu na Lucifer. Roho ya kutokukubali na kutoridhika haikujulikana hapo kabla huko mbinguni.",
        "Lucifer mwenyewe awali hakuwa ameielewa asili ya hisia zake; maana kwa wakati aliogopa kuelezea kazi na fikra za nia yake; hata hivyo hakuachana nazo. Hakuweza kuona kwamba alikuwa anakwenda mbali. Lakini juhudi hizo ambazo ni upendo usio na mwisho na hekima pekee zinazoweza kuanzisha, zilifanywa kumthibitisha na kosa. Kutokuridhika kwake kulionyeshwa kuwa hakukuwa na sababu, na alionyeshwa kitakachokuwa matokeo ya msimamo wa maasi. Lucifer aliridhishwa kuwa alikuwa mwenye makosa. Aliona kwamba “Bwana ni mwenye haki katika njia zake zote, na Mtakatifu katika kazi zake zote.” (Zaburi 145:17); kwamba sheria ya mbinguni ni ya haki, na kwamba alipaswa kuzitambua kama zilivyo katika mbingu yote.",
        "Kama angefanya hivyo, angeweza kujiokoa na kuokoa malaika wengi. Kwa wakati huo hakuwa amefutiliwa mbali na Mungu kwa kutokutii kwake. Ingawa alikuwa ameacha nafasi yake kama Kerubi afunikaye, bado kama angekuwa na nia ya kurudi kwa Mungu, kutambua hekima ya Muumbaji, na kuridhika na nafasi aliyoteuliwa katika mpango mkuu wa Mungu, angerudishwa katika ofisi yake. Mda ulifika kwa maamuzi ya mwisho; anapaswa kutii serikali ya mbinguni kikamilifu au kujiweka wazi mwenyewe katika nafasi ya uasi. Karibu angefikia uamuzi wa kurudi, lakini kiburi kilimzuia. Ilikuwa ni kafara kubwa kwa ambaye alikuwa anaheshimiwa kuomba msamaha kwamba alikuwa mkosaji, kwamba fikra zake zilikuwa potofu, na kujiweka katika mamlaka ambayo amekuwa akiyaona kuwa hayana haki.",
        "Muumba mwenye huruma, kwa kuwaonea huruma Lucifer na wafuasi wake, alikuwa akitaka kuwavuta kwake kutoka kwenye shimo la kuzimu la machafuko ambalo walikuwa wanakaribia kuingia. Lakini rehema Zake zilipuuzwa. Lucifer alionyesha kuwa maumivu ya mda mrefu ya Mungu ni udhihirisho wa ubora wake, ikionyesha kwamba Mfalme wa ulimwengu angeridhia matakwa yake. Kama malaika wangesimama imara pamoja naye, alitamka, wangepata vyote walivyotamani. Alionyesha msimamo wake wa pambano kuu dhidi ya Muumba wake. Hivyo ilikuwa Lucifer, “mwenye nuru,” aliyemshiriki wa utukufu wa Mungu, muangalizi wa kiti Chake cha enzi, kwa kuasi akawa shetani, “mshitaki” wa Mungu na viumbe watakatifu na mharibifu wa wale ambao mbingu imejitoa kuwalinda na kuwaongoza.",
        "Kwa dharau akikataa ushawishi wa malaika watakatifu, aliwaita watumwa waliodanganywa. Hali iliyoonyeshwa kwa Kristo aliita kuwa ni kitendo ambacho si cha haki kwake yeye na kwa jeshi lote la mbinguni, na akatangaza kwamba hatajisalimisha kwa uvamizi huu wa haki yake na yao. Kamwe hatatambua tena utawala wa Kristo. Amekuwa akidai heshima ambayo angepewa, na kutoa amri juu ya wale ambao wangekuwa wafuasi wake; na aliwaahadi wale watakaokuwa chini yake kuwa na serikali mpya nzuri zaidi, ambapo wote wangefurahia uhuru. Idadi kubwa ya malaika walithibitisha malengo yao na kumkubali awe kiongozi wao. Wakisifu kwa upendeleo ambao waliupokea, alitumaini kuwapata malaika wote, na kuwa sawa na Mungu mwenyewe.",
        "Bado malaika watakatifu walimsihi yeye na wafuasi wake wajisalimishe kwa Mungu; na wakawaonyesha matokeo yasiyozuilika kama wangekataa: Yeye aliyewaumba angewatupa pamoja na nguvu zao na kuonyesha ishara ya kuwaadhibu watakaojaribu kuasi. Hakuna malaika ambaye angeweza kuonyesha ushindani dhidi ya sheria ya Mungu ambayo ni takatifu kama Yeye. Walionywa wote kuziba masikio yao wasisikie madanganyo na tafakari za Lucifer na kumshawishi yeye na wafuasi wake kutafuta uwepo wa Mungu bila kuchelewa na kutubu kosa la kuhoji hekima yake na mamlaka. Wengi walielekea kujali ushauri huu, ili kutubu kwa kutokuridhika kwao, na kutafuta kupokelewa na Baba na Mwana Wake.",
        "Lakini Lucifer alikuwa na uongo mwingine tayari. Muasi mwenye nguvu alitangaza kwamba malaika walioungana naye wamekwenda mbali sana kiasi cha kutoweza kurudi; kwamba alifahamishwa sheria ya mbinguni, na alifahamu kuwa Mungu hatawasamehe. Alitanganza kwamba wote watakao jisalimisha katika mamlaka ya mbinguni watanyang‘anywa heshima yao na kushushwa vyeo. Kwa yeye alikuwa ameshaamua kamwe kutokutambua mamlaka ya Kristo. Alisema kuwa, kilichokuwa kimebaki kwake na wafuasi wake, ilikuwa ni kudai uhuru wao, tena kwa nguvu haki ambayo hawakupewa kama walivyotaka. Kadri shetani mwenyewe alivyohusika, ilikuwa kweli kwamba alikuwa amekwenda mbali asiweze kurudi. Lakini si mbali kiasi hicho kwa wale waliokuwa wamepofushwa na madanganyo yake.",
        "Mungu alimruhusu shetani kuendelea na kazi yake hadi roho ya kutokuridhishwa ilipokomaa kwa uasi halisi. Ilikuwa lazima mipango yake ikamilike, ili asili yao halisi na tabia vionekane wazi na wote. Lucifer, kama Kerubi aliyetiwa mafuta, alikuwa akiheshimiwa sana, alikuwa akipendwa sana na viumbe wa mbinguni, na mvuto yake kwao ulikuwa na nguvu. Serikali ya Mungu haikuwahusisha tu wakazi wa mbinguni, lakini pia malimwengu yote aliyoyaumba; na Lucifer alikuwa amehitimisha kwamba kama angewashawishi malaika wote wa mbinguni katika uasi, angechukua malimwengu yote pia. Kwa werevu alikuwa ameonyeshaupande wa swali lake, akitumia ujanja na werevu katika kufikia malengo yake. Uwezo wake wa kudanganya ulikuwa mkubwa.",
        "Matendo yake yote yalivishwa siri ambayo ilikuwa vigumu kwa malaika kuigundua asili yake halisi. Hadi ilipokomaa, haikuwa rahisi kuonekana uovu kama ilivyokuwa; kutokuridhika kwake hakukuonekana kuwa ni uasi. Hata malaika watiifu hawakuweza kutambua tabia yake au kuona mwelekeo wa kazi yake. Mwanzoni Lucifer alianzisha majaribu yake akiwa hajadhamiria. Malaika ambao hakuweza kuwavuta upande wake, aliwashutumu kwa kutokujali matakwa ya viumbe wa mbinguni. Kazi aliyokuwa anaifanya, aliwashutumu malaika watakatifu kuwa wanaifanya. Ilikuwa mazoea yake kukanganya kwa hoja ngumu kuhusu matakwa ya Mungu. Kila kitu kilichokuwa rahisi alikianzisha kwa siri, na kwa upotoshaji wa werevu akiweka mashaka juu ya matamshi wazi ya Yehova.",
        "Mungu alitumia njia hizo tu kwa vile zilikuwa katika utaratibu wa kweli na haki. Shetani alitumia kile ambacho Mungu hakutumia – kujisifu na udanganyifu. Alipanga kupotosha neno la Mungu na kuvuruga mpango wa serikali Yake, akidai kwamba Mungu hakutenda haki katika kutoa sheria kwa malaika; kwamba katika kutaka kujisalimisha na utii kutoka kwa viumbe Wake, alikuwa anatafuta kujikweza mwenyewe. Kwa hiyo ilikuwa lazima kutoa kielelezo mbele ya wakazi wa mbinguni, na malimwengu yote, kwamba serikali ya Mungu si ya haki, sheria Yake timilifu. Shetani alifanikiwa kuonyesha kwamba yeye mwenyewe alikuwa anautakia ulimwengu mambo mazuri. Tabia sahihi ya mwenye nguvu na lengo lake halisi lazima vijulikane kwa wote.",
        "Kwa kutokukubali kwake ambako amekuonyesha mbinguni, shetani aliishitaki serikali ya Mungu. Alitangaza kuwa mabaya yote ni matokeo ya uongozi wa mbinguni. Alidai kwamba lilikuwa lengo lake kuboresha sheria ya Yehova. Hivyo Mungu alimruhusu kudhihirisha asili ya madai yake, kuonyesha mapendekezo yake yakifanya kazi katika sheria ya mbinguni. Kazi yake lazima iwe kinyume na yeye mwenyewe. Shetani alidai tangu mwanzo kwamba hakuwa muasi. Ulimwengu wote lazima uone mdanganyifu akifunuliwa. Hata baada ya kutupwa kutoka mbinguni. Hekima isiyo na mwisho haikumharibu shetani. Kwa vile utumishi wa upendo ndio pekee unakubalika kwa Mungu, utii wa viumbe Wake lazima utokane na uthibitisho wa haki na ukarimu Wake.",
        "Wakazi wa mbinguni na malimwengu, wakiwa hawakuandaliwa kukabili asili ya matokeo ya dhambi, wasingeona haki ya Mungu katika kumuangamiza shetani. Kama angefutiliwa mbali asionekane, baadhi wangemtumikia Mungu kwa hofu na si kwa upendo. Mvuto wa mdanganyifu usingeharibiwa kabisa, wala roho ya uasi isingekuwa imefutwa. Kwa ajili ya ulimwengu wote katika vizazi visivyokoma, alipaswa aendeleze kufunua kanuni zake, ili shitaka lake dhidi ya serikali ya mbinguni liweze kuonekana na viumbe wote katika hali yake halisi, na kwamba haki na rehema ya Mungu na kutokubadilika kwa sheria Yake kuweze kuwa wazi pasipo na mashaka.",
        "Uasi wa shetani umekuwa somo kwa ulimwengu wote katika vizazi vyote vijavyo – ushuhuda wa kudumu wa asili na matokeo ya dhambi. Kufanya kazi kwa utawala wa shetani, madhara kwa wanadamu na malaika, kunapaswa kuonyesha kitakachokuwa tunda la kuweka kando mamlaka ya mbinguni. Kutadhihirisha kwamba kwa kuwepo serikali ya Mungu ni kuzingirwa na mambo mazuri kwa viumbe Aliowaumba. Hivyo historia ya jaribio hatari la uasi ni tahadhari kwa viumbe wote watakatifu, kuwakinga wasidanganyike na asili ya uasi, kuwalinda wasitende dhambi, na kupata adhabu yake.",
        "Anayetawala mbinguni ndiye Aonaye mwisho tangu mwanzo – ambaye siri zilizopita na zijazo zi wazi mbele zake, ambaye mbele zaidi ya ole na giza na machafuko yaliyoletwa na dhambi, hufikia hitimisho la matakwa Yake ya upendo na mibaraka. Ingawa “mawingu na giza vyamzunguka: Haki na hukumu ni msingi wa kiti chake cha enzi.” Zaburi 97:2. Na hawa ndio wakazi wa ulimwengu, watiifu na wasiowatiifu, siku moja watafahamu. “Kazi yake ni kamilifu: maana njia zake zote ni haki: Mungu wa uaminifu asiye na uovu, Yeye ndiye mwenye haki na adili.” Kumbukumbu la Torati 32:4."
      ]
    },
    "keyPoints": {
      "en": [
        "God’s character is the foundation of all truth",
        "God is unchanging, holy, just, and merciful",
        "Understanding God shapes how we understand Scripture and life"
      ],
      "sw": [
        "Tabia ya Mungu ni msingi wa ukweli wote",
        "Mungu habadiliki, ni mtakatifu, mwenye haki na rehema",
        "Kumjua Mungu kunaunda uelewa wetu wa Maandiko na maisha"
      ]
    }
  },
  {
    "id": "plan-of-salvation",
    "description": {
      "en": [
        "Sorrow filled heaven, as it was realized that man was lost and that world which God had created was to be filled with mortals doomed to misery, sickness, and death, and there was no way of escape for the offender. The whole family of Adam must die. I saw the lovely Jesus and beheld an expression of sympathy and sorrow upon His countenance. Soon I saw Him approach the exceeding bright light which enshrouded the Father.",
        "Three times He was shut in by the glorious light about the Father, and the third time He came out from the Father, His person could be seen. His countenance was calm, free from all perplexity and doubt, and shone with benevolence and loveliness. He then made known to the angelic host that a way of escape had been made for lost man. He told them that He had been pleading with His Father, and had offered to give His life a ransom, to take the sentence of death upon Himself.",
        "Jesus told them that He would stand between the wrath of His Father and guilty man, that He would bear iniquity and scorn. He would leave all His glory in heaven, appear upon earth as a man, humble Himself as a man, and become acquainted by His own experience with the various temptations with which man would be beset. Finally, after His mission as a teacher would be accomplished, He would die the cruelest of deaths, hung up between the heavens and the earth as a guilty sinner.",
        "Not merely agony of body would He suffer, but mental agony, that with which bodily suffering could in no wise be compared. The weight of the sins of the whole world would be upon Him. He told them He would die and rise again the third day, and would ascend to His Father to intercede for wayward, guilty man."
      ],
      "sw": [
        "Huzuni ilijaza mbingu, ilipofahamika kuwa mwanadamu amepotea na ulimwengu ule ambao Mungu aliubuni ungejazwa na viumbe wenye kufa waliohukumiwa taabu, ugonjwa, na mauti, na hapakuwa na njia ya kutoroka kwa mkosaji. Familia nzima ya Adamu ilipaswa kufa. Nilimwona Yesu mwenye upendo na nikaona kielelezo cha huruma na huzuni katika uso Wake. Punde si punde nikamwona akikaribia ile nuru inayong'aa kupita kiasi iliyomfunika Baba.",
        "Mara tatu alifungiwa ndani na ile nuru tukufu inayomzunguka Baba, na mara ya tatu alipotoka kwa Baba, nafsi Yake iliweza kuonekana. Uso Wake ulikuwa mtulivu, huru kutoka kwa mahangaiko na shaka yote, na uling'aa kwa wema na uzuri. Kisha akawajulisha jeshi la malaika kuwa njia ya kutoroka imetengenezwa kwa ajili ya mwanadamu aliyepotea. Akawaambia kuwa amekuwa akimsihi Baba Yake, na amejitolea kutoa maisha Yake kuwa fidia, ili kuchukua hukumu ya mauti juu Yake Mwenyewe.",
        "Yesu akawaambia kuwa angesimama kati ya ghadhabu ya Baba Yake na mwanadamu mwenye hatia, kwamba angebeba uovu na dharau. Angeacha utukufu Wake wote mbinguni, aonekane duniani kama mwanadamu, ajinyenyekeze kama mwanadamu, na kufahamiana kwa uzoefu Wake mwenyewe na majaribu mbalimbali ambayo mwanadamu angekabiliana nayo. Hatimaye, baada ya utume Wake kama mwalimu kukamilika, angekufa kifo cha kikatili zaidi, akiwa ametundikwa kati ya mbingu na nchi kama mwenye dhambi mwenye hatia.",
        "Siyo tu maumivu ya mwili ambayo angasumbuka nayo, bali maumivu ya akili, ambayo mateso ya mwili hayawezi kulinganishwa nayo kwa namna yoyote. Uzito wa dhambi za ulimwengu wote ungekuwa juu Yake. Akawaambia kuwa angekufa na kufufuka siku ya tatu, na angepaa kwa Baba Yake ili kuwaombea wanadamu wakaidi na wenye hatia."
      ]
    },
    "keyPoints": {
      "en": [
        "Love defines who God is",
        "God’s love is unconditional and sacrificial",
        "True love flows from knowing God"
      ],
      "sw": [
        "Upendo unafafanua Mungu ni nani",
        "Upendo wa Mungu hauna masharti na ni wa kujitoa",
        "Upendo wa kweli unatoka katika kumjua Mungu"
      ]
    }
  },
  {
    "id": "possible-way-0f-salvation",
    "description": {
      "en": [
        "The angels prostrated themselves before Him. They offered their lives. Jesus said to them that He would by His death save many, that the life of an angel could not pay the debt. His life alone could be accepted of His Father as a ransom for man. Jesus also told them that they would have a part to act, to be with Him and at different times strengthen Him; that He would take man’s fallen nature, and His strength would not be even equal with theirs.",
        "Then joy, inexpressible joy, filled heaven. And the heavenly host sang a song of praise and adoration. They touched their harps and sang a note higher than they had done before, for the great mercy and condescension of God in yielding up His dearly Beloved to die for a race of rebels. Said the angel, “Think ye that the Father yielded up His dearly beloved Son without a struggle? No, no. It was even a struggle with the God of heaven, whether to let guilty man perish, or to give His beloved Son to die for him.”",
        "I was shown Satan as he once was, a happy, exalted angel. Then I was shown him as he now is. He still bears a kingly form. His features are still noble, for he is an angel fallen. But the expression of his countenance is full of anxiety, care, unhappiness, malice, hate, mischief, deceit, and every evil. His eyes were cunning, sly, and showed great penetration.",
        "In humility and inexpressible sadness Adam and Eve left the lovely garden wherein they had been so happy until they disobeyed the command of God. The atmosphere was changed. God clothed them with coats of skins to protect them from the sense of chilliness and then of heat to which they were exposed."
      ],
      "sw": [
        "Malaika walisujudu mbele Yake. Walitoa maisha yao. Yesu akawaambia kuwa kwa kifo Chake angewaokoa wengi, kwamba maisha ya malaika yasingeweza kulipa deni hilo. Maisha Yake pekee ndiyo yangeweza kukubalika na Baba Yake kama fidia kwa mwanadamu. Yesu pia aliwaambia kuwa watakuwa na sehemu ya kufanya, kuwa Naye na kumtia nguvu nyakati tofauti; kwamba angechukua asili ya mwanadamu aliyeanguka, na nguvu Zake zisingekuwa sawa na zao.",
        "Kisha furaha, furaha isiyoelezeka, ikajaza mbingu. Na jeshi la mbinguni likaimba wimbo wa sifa na kuabudu. Waligusa vinanda vyao na kuimba kwa sauti ya juu zaidi kuliko walivyowahi kufanya hapo awali, kwa ajili ya rehema kuu na unyenyekevu wa Mungu katika kumtoa Mpendwa Wake afe kwa ajili ya kizazi cha waasi. Malaika akasema, “Je, mnafikiri kwamba Baba alimtoa Mwanawe mpendwa bila mapambano? Hapana, hapana. Lilikuwa ni pambano hata kwa Mungu wa mbinguni, ikiwa amwache mwanadamu mwenye hatia aangamie, au amtoe Mwanawe mpendwa afe kwa ajili yake.”",
        "Nilionyeshwa Shetani kama alivyokuwa zamani, malaika mwenye furaha na aliyekwezwa. Kisha nikaonyeshwa jinsi alivyo sasa. Bado ana umbo la kifalme. Sura yake bado ni ya kishujaa, kwani yeye ni malaika aliyeanguka. Lakini usemi wa uso wake umejaa mahangaiko, huzuni, ukosefu wa furaha, chuki, hila, udanganyifu, na kila uovu. Macho yake yalikuwa ya ujanja, siri, na yalionyesha uwezo mkubwa wa kupenya.",
        "Kwa unyenyekevu na huzuni isiyoelezeka, Adamu na Hawa waliondoka katika bustani ile nzuri ambamo walikuwa na furaha sana mpaka walipoasi amri ya Mungu. Anga lilibadilika. Halikuwa tena la utulivu kama kabla ya uasi. Mungu akawavika mavazi ya ngozi ili kuwalinda na hali ya baridi na kisha joto ambalo walikumbana nalo."
      ]
    },
    "keyPoints": {
      "en": [
        "Love defines who God is",
        "God’s love is unconditional and sacrificial",
        "True love flows from knowing God"
      ],
      "sw": [
        "Upendo unafafanua Mungu ni nani",
        "Upendo wa Mungu hauna masharti na ni wa kujitoa",
        "Upendo wa kweli unatoka katika kumjua Mungu"
      ]
    }
  },
  {
    "id": "God-law",
    "description": {
      "en": [
        "All heaven mourned on account of the disobedience and fall of Adam and Eve, which brought the wrath of God upon the whole human race. They were cut off from communing with God, and were plunged in hopeless misery. The law of God could not be changed to meet man’s necessity, for in God’s arrangement it was never to lose its force nor give up the smallest part of its claims.",
        "Through Christ a door of hope was opened, that man, notwithstanding his great sin, should not be under the absolute control of Satan. Probation would be granted him in which, through a life of repentance and faith in the atonement of the Son of God, he might be redeemed from his transgression of the Father’s law, and thus be elevated to a position where his efforts to keep His law could be accepted.",
        "Adam was informed that an angel’s life could not pay the debt. The law of Jehovah, the foundation of His government in heaven and upon earth, was as sacred as God Himself; and for this reason the life of an angel could not be accepted of God as a sacrifice for its transgression. The Father could not abolish or change one precept of His law to meet man in his fallen condition.",
        "But the Son of God, who had in unison with the Father created man, could make an atonement for man acceptable to God, by giving His life a sacrifice and bearing the wrath of His Father. Angels informed Adam that, as his transgression had brought death and wretchedness, life and immortality would be brought to light through the sacrifice of Jesus Christ."
      ],
      "sw": [
        "Mbingu zote ziliomboleza kwa sababu ya kutokuwa na utii na kuanguka kwa Adamu na Hawa, jambo ambalo lilileta ghadhabu ya Mungu juu ya kizazi chote cha wanadamu. Walitengwa na ushirika na Mungu, na kutupwa katika huzuni isiyo na tumaini. Sheria ya Mungu haikuweza kubadilishwa ili kukidhi uhitaji wa mwanadamu, kwani katika mpangilio wa Mungu haikupaswa kamwe kupoteza nguvu yake wala kuachia sehemu ndogo kabisa ya madai yake.",
        "Kupitia Kristo mlango wa tumaini ulifunguliwa, ili mwanadamu, licha ya dhambi yake kuu, asiwe chini ya utawala kamili wa Shetani. Kipindi cha rehema kingetolewa kwake ambacho, kupitia maisha ya toba na imani katika upatanisho wa Mwana wa Mungu, angeweza kukombolewa kutoka katika uasi wake wa sheria ya Baba, na hivyo kuinuliwa hadi nafasi ambapo juhudi zake za kushika sheria Yake zingeweza kukubalika.",
        "Adamu alifahamishwa kuwa maisha ya malaika yasingeweza kulipa deni hilo. Sheria ya Yehova, msingi wa serikali Yake mbinguni na duniani, ilikuwa takatifu kama Mungu Mwenyewe; na kwa sababu hii maisha ya malaika hayakuweza kukubalika na Mungu kama dhabihu kwa ajili ya uasi wa sheria. Baba hakuweza kufuta wala kubadilisha amri hata moja ya sheria Yake ili kukutana na mwanadamu katika hali yake ya kuanguka.",
        "Lakini Mwana wa Mungu, ambaye kwa umoja na Baba alimuumba mwanadamu, angeweza kufanya upatanisho kwa ajili ya mwanadamu unaokubalika kwa Mungu, kwa kutoa maisha Yake kuwa dhabihu na kubeba ghadhabu ya Baba Yake. Malaika walimfahamisha Adamu kwamba, kama vile uasi wake ulivyoleta mauti na unyonge, uzima na kutokufa vingeletwa kwenye nuru kupitia dhabihu ya Yesu Kristo."
      ]
    },
    "keyPoints": {
      "en": [
        "Love defines who God is",
        "God’s love is unconditional and sacrificial",
        "True love flows from knowing God"
      ],
      "sw": [
        "Upendo unafafanua Mungu ni nani",
        "Upendo wa Mungu hauna masharti na ni wa kujitoa",
        "Upendo wa kweli unatoka katika kumjua Mungu"
      ]
    }
  },
  {
    "id": "view-of-future",
    "description": {
      "en": [
        "To Adam were revealed future important events, from his expulsion from Eden to the Flood, and onward to the first advent of Christ upon the earth... Such a sacrifice was of sufficient value to save the whole world; but only a few would avail themselves of the salvation brought to them through such a wonderful sacrifice. The many would not comply with the conditions required of them that they might be partakers of His great salvation.",
        "Adam was carried down through successive generations and saw the increase of crime, of guilt and defilement, because man would yield to his naturally strong inclinations to transgress the holy law of God. He was shown the curse of God resting more and more heavily upon the human race, upon the cattle, and upon the earth, because of man’s continued transgression.",
        "Adam was made to comprehend what sin is—the transgression of the law. He was shown that moral, mental, and physical degeneracy would result to the race, from transgression, until the world would be filled with human misery of every type. The days of man were shortened by his own course of sin in transgressing the righteous law of God.",
        "Yet, notwithstanding the weakness, and enfeebled mental, moral, and physical powers of the human race, Christ, true to the purpose for which He left heaven, continues His interest in the feeble, depreciated, degenerate specimens of humanity, and invites them to hide their weakness and great deficiencies in Him."
      ],
      "sw": [
        "Adamu alifunuliwa matukio muhimu ya baadaye, kuanzia kufukuzwa kwake Edeni hadi Gharika, na kuendelea hadi kuja kwa kwanza kwa Kristo duniani... Dhabihu kama hiyo ilikuwa na thamani ya kutosha kuokoa ulimwengu wote; lakini ni wachache tu ambao wangeitumia wokovu ulioletwa kwao kupitia dhabihu hiyo ya ajabu. Wengi wasingetii masharti yanayotakiwa kwao ili waweze kuwa washiriki wa wokovu Wake mkuu.",
        "Adamu alionyeshwa vizazi vilivyofuatana na kuona kuongezeka kwa uhalifu, hatia na uchafu, kwa sababu mwanadamu angejiachia kwenye mielekeo yake ya asili yenye nguvu ya kuasi sheria takatifu ya Mungu. Alionyeshwa laana ya Mungu ikitua kwa uzito zaidi na zaidi juu ya jamii ya wanadamu, juu ya wanyama, na juu ya nchi, kwa sababu ya uasi wa mwanadamu unaoendelea.",
        "Adamu alifanywa kuelewa dhambi ni nini—uasi wa sheria. Alionyeshwa kuwa kuzorota kwa maadili, akili, na mwili kungetokana na uasi kwa jamii hiyo, hadi ulimwengu utakapojawa na taabu za kila aina za kibinadamu. Siku za mwanadamu zilifupishwa na mwenendo wake mwenyewe wa dhambi katika kuasi sheria ya haki ya Mungu.",
        "Lakini, licha ya udhaifu, na kudhoofika kwa nguvu za akili, maadili, na mwili za jamii ya wanadamu, Kristo, akiwa mwaminifu kwa kusudi ambalo aliondokea mbinguni, anaendelea kuwa na nia na mifano hii dhaifu, iliyoshushwa thamani, na iliyozorota ya ubinadamu, na kuwaalika wafiche udhaifu wao na upungufu wao mkubwa ndani Yake."
      ]
    },
    "keyPoints": {
      "en": [
        "Love defines who God is",
        "God’s love is unconditional and sacrificial",
        "True love flows from knowing God"
      ],
      "sw": [
        "Upendo unafafanua Mungu ni nani",
        "Upendo wa Mungu hauna masharti na ni wa kujitoa",
        "Upendo wa kweli unatoka katika kumjua Mungu"
      ]
    }
  },
  {
    "id": "sacrificial-offering",
    "description": {
      "en": [
        "When Adam, according to God’s special directions, made an offering for sin, it was to him a most painful ceremony. His hand must be raised to take life, which God alone could give, and make an offering for sin. It was the first time he had witnessed death. As he looked upon the bleeding victim, writhing in the agonies of death, he was to look forward by faith to the Son of God, whom the victim prefigured, who was to die man’s sacrifice.",
        "This ceremonial offering, ordained of God, was to be a perpetual reminder to Adam of his guilt, and also a penitential acknowledgment of his sin. This act of taking life gave Adam a deeper and more perfect sense of his transgression, which nothing less than the death of God’s dear Son could expiate. He marveled at the infinite goodness and matchless love which would give such a ransom to save the guilty.",
        "As Adam was slaying the innocent victim, it seemed to him that he was shedding the blood of the Son of God by his own hand. He knew that if he had remained steadfast to God, and true to His holy law, there would have been no death of beast nor of man. Yet in the sacrificial offerings... there appeared a star of hope to illuminate the dark and terrible future.",
        "In the beginning the head of each family was considered ruler and priest of his own household. The blood of beasts was to be associated in the minds of sinners with the blood of the Son of God. The death of the victim was to evidence to all that the penalty of sin was death. By the act of sacrifice the sinner acknowledged his guilt and manifested his faith."
      ],
      "sw": [
        "Wakati Adamu, kulingana na maelekezo maalum ya Mungu, alipotoa sadaka kwa ajili ya dhambi, ilikuwa kwake sherehe yenye maumivu makali zaidi. Mkono wake ulipaswa kuinuliwa ili kuondoa uhai, ambao Mungu pekee ndiye angeweza kuutoa, na kutoa sadaka kwa ajili ya dhambi. Ilikuwa ni mara yake ya kwanza kushuhudia kifo. Alipomtazama yule mnyama aliyetolewa dhabihu akivuja damu na kutaabika katika maumivu ya mauti, alipaswa kutazama mbele kwa imani kwa Mwana wa Mungu, ambaye mnyama huyo alimwakilisha, ambaye angekufa kama dhabihu ya mwanadamu.",
        "Sadaka hii ya kisherehe, iliyoamriwa na Mungu, ilipaswa kuwa kikumbusho cha kudumu kwa Adamu juu ya hatia yake, na pia ukiri wa toba wa dhambi yake. Kitendo hiki cha kuondoa uhai kilimpa Adamu ufahamu wa kina na mkamilifu zaidi wa uasi wake, ambao hakuna kitu kingine isipokuwa kifo cha Mwana mpendwa wa Mungu kingeweza kuufuta. Alishangazwa na wema usio na kikomo na upendo usio na kifani ambao ungetoa fidia kama hiyo ili kuokoa mwenye hatia.",
        "Wakati Adamu alipokuwa akimchinja yule mnyama asiye na hatia, ilionekana kwake kana kwamba alikuwa akimwaga damu ya Mwana wa Mungu kwa mkono wake mwenyewe. Alijua kwamba kama angeendelea kuwa thabiti kwa Mungu, na mwaminifu kwa sheria Yake takatifu, pasingekuwa na kifo cha mnyama wala cha mwanadamu. Lakini katika sadaka za dhabihu... ilionekana nyota ya tumaini ya kuangazia maisha ya baadaye yenye giza na ya kutisha.",
        "Hapo mwanzo kichwa cha kila familia alizingatiwa kuwa mtawala na kuhani wa nyumba yake mwenyewe. Damu ya wanyama ilipaswa kuhusishwa katika akili za wenye dhambi na damu ya Mwana wa Mungu. Kifo cha mnyama dhabihu kilikuwa ushahidi kwa wote kwamba adhabu ya dhambi ilikuwa mauti. Kwa kitendo cha dhabihu, mwenye dhambi alikiri hatia yake na kudhihirisha imani yake."
      ]
    },
    "keyPoints": {
      "en": [
        "Love defines who God is",
        "God’s love is unconditional and sacrificial",
        "True love flows from knowing God"
      ],
      "sw": [
        "Upendo unafafanua Mungu ni nani",
        "Upendo wa Mungu hauna masharti na ni wa kujitoa",
        "Upendo wa kweli unatoka katika kumjua Mungu"
      ]
    }
  },
  {
    "id": "first-angel-message",
    "description": {
      "en": [
        "The prophecy of the first angel’s message, brought to view in Revelation 14, found its fulfillment in the advent movement of 1840-44. In both Europe and America, men of faith and prayer were deeply moved as their attention was called to the prophecies, and, tracing down the Inspired Record, they saw convincing evidence that the end of all things was at hand. The Spirit of God urged His servants to give the warning. Far and wide spread the message of the everlasting gospel, “Fear God, and give glory to Him; for the hour of His judgment is come.” Revelation 14:7.",
        "Wherever missionaries had penetrated, were sent the glad tidings of Christ’s speedy return. In different lands were found isolated bodies of Christians, who, solely by the study of the Scriptures, had arrived at the belief that the Saviour’s advent was near. In some portions of Europe, where the laws were so oppressive as to forbid the preaching of the advent doctrine, little children were impelled to declare it, and many listened to the solemn warning.",
        "To William Miller and his co-laborers it was given to preach the message in America, and the light kindled by their labors shone out to distant lands. God sent His angel to move upon the heart of a farmer who had not believed the Bible, to lead  him to search the prophecies. Angels of God repeatedly visited that chosen one, to guide his mind and open to his understanding prophecies which had ever been dark to God’s people. The commencement of the chain of truth was given to him, and he was led on to search for link after link, until he looked with wonder and admiration upon the Word of God. He saw there a perfect chain of truth. That Word, which he had regarded as uninspired, now opened before his vision in its beauty and glory. He saw that one portion of Scripture explains another, and when one passage was closed to his understanding, he found in another part of the Word that which explained it. He regarded the sacred Word of God with joy, and with the deepest respect and awe",
        "As he followed down the prophecies he saw that the inhabitants of the earth were living in the closing scenes of this world’s history; yet they knew it not. He looked at the churches, and saw that they were corrupt; they had taken their affections from Jesus and placed them on the world; they were seeking for worldly honor, instead of that honor which cometh from above; grasping for worldly riches, instead of laying up their treasure in heaven. He could see hypocrisy, darkness, and death everywhere. His spirit was stirred within him. God called him to leave his farm, as He called Elisha to leave his oxen and the field of his labor to follow Elijah",
        "With trembling, William Miller began to unfold to the people the mysteries of the kingdom of God, carrying his hearers down through the prophecies to the second advent of Christ. The testimony of the Scriptures pointing to the coming of Christ in 1843 awakened widespread interest. Many were convinced that the arguments from the prophetic periods were correct,  and, sacrificing their pride of opinion, they joyfully received the truth. Some ministers laid aside their sectarian views and feelings, left their salaries and their churches, and united in proclaiming the coming of Jesus.",
        "There were but few ministers, however, who would accept this message; therefore it was largely committed to humble laymen. Farmers left their fields, mechanics their tools, traders their merchandise, professional men their positions; and yet the number of workers was small in comparison with the work to be accomplished. The condition of an ungodly church and a world lying in wickedness burdened the souls of the true watchmen, and they willingly endured toil, privation, and suffering, that they might call men to repentance unto salvation. Though opposed by Satan, the work went steadily forward, and the advent truth was accepted by many thousands."
      ],
      "sw": [
        "Unabii wa ujumbe wa malaika wa kwanza, unaoonekana katika Ufunuo 14, ulipata utimilifu wake katika vuguvugu la marejeo la mwaka 1840-44. Katika Ulaya na Amerika, watu wa imani na maombi waligushwa sana wakati fikira zao zilipoelekezwa kwenye unabii, na, wakifuatilia Kumbukumbu Iliyovuviwa, waliona ushahidi wa kusadikisha kwamba mwisho wa mambo yote ulikuwa karibu. Roho wa Mungu aliwahimiza watumishi Wake kutoa onyo. Ujumbe wa injili ya milele ulienea mbali na kote, ukisema, 'Mcheni Mungu, na kumtukuza; kwa maana saa ya hukumu yake imekuja.' Ufunuo 14:7.",
        "Kila mahali ambapo wamisionari walikuwa wamefika, habari njema za kurudi upesi kwa Kristo zilitumwa. Katika nchi mbalimbali kulipatikana makundi ya Wakristo yaliyojitenga, ambao, kwa kujifunza Maandiko pekee, walikuwa wamefikia imani kwamba kuja kwa Mwokozi kulikuwa karibu. Katika baadhi ya sehemu za Ulaya, ambapo sheria zilikuwa za kidikteta kiasi cha kukataza uandishi wa fundisho la marejeo, watoto wadogo walisukumwa kulitangaza, na wengi walisikiliza onyo hilo zito.",
        "Kwa William Miller na wafanyakazi wenzake ilitolewa kazi ya kuhubiri ujumbe huo huko Amerika, na nuru iliyowashwa na kazi zao iliangaza hadi nchi za mbali. Mungu alimtuma malaika Wake kugusa moyo wa mkulima ambaye hakuwa ameiamini Biblia, ili kumwongoza kuchunguza unabii. Malaika wa Mungu walimtembelea mteule huyo mara kwa mara, ili kuongoza akili yake na kufunua ufahamu wake kwenye unabii ambao ulikuwa umekuwa giza kwa watu wa Mungu. Mwanzo wa mnyororo wa ukweli ulitolewa kwake, naye aliongozwa kutafuta kiungo baada ya kiungo, hadi alipotazama kwa mshangao na kustaajabu Neno la Mungu. Aliona hapo mnyororo kamili wa ukweli. Neno hilo, ambalo alikuwa ameliona kama lisilovuvuwa, sasa lilifunguka mbele ya maono yake katika uzuri na utukufu wake. Aliona kwamba sehemu moja ya Maandiko inaelezea nyingine, na wakati fungu moja lilipokuwa limefungwa kwa ufahamu wake, alipata katika sehemu nyingine ya Neno jambo lililolielezea. Alilitazama Neno takatifu la Mungu kwa furaha, na kwa heshima na unyenyekevu mkuu.",
        "Alipokuwa akifuatilia unabii huo, aliona kwamba wenyeji wa dunia walikuwa wakiishi katika matukio ya kufunga ya historia ya ulimwengu huu; lakini hawakujua. Aliyatazama makanisa, na kuona kwamba yalikuwa yameharibika; walikuwa wameondoa upendo wao kwa Yesu na kuuweka kwenye ulimwengu; walikuwa wakitafuta heshima ya kidunia, badala ya heshima ile itokayo juu; wakitafuta utajiri wa kidunia, badala ya kujiwekea hazina mbinguni. Aliweza kuona unafiki, giza, na mauti kila mahali. Roho yake ilisisimka ndani yake. Mungu alimwita auache shamba lake, kama alivyomwita Elisha awaache ng'ombe wake na shamba la kazi yake ili amfuate Eliya.",
        "Kwa kutetemeka, William Miller alianza kuwafunulia watu siri za ufalme wa Mungu, akiwapeleka wasikilizaji wake kupitia unabii hadi kwenye kuja kwa mara ya pili kwa Kristo. Ushuhuda wa Maandiko ukiashiria kuja kwa Kristo mnamo 1843 uliamsha maslahi makubwa. Wengi walisadiki kwamba hoja kutoka kwa vipindi vya unabii zilikuwa sahihi, na, wakidhabihu kiburi chao cha maoni, walipokea ukweli kwa furaha. Baadhi ya wachunguzi waliweka kando mitazamo na hisia zao za kimadhehebu, waliacha mishahara yao na makanisa yao, na kuungana katika kutangaza kuja kwa Yesu.",
        "Walakini, walikuwa wachungaji wachache tu ambao wangekubali ujumbe huu; kwa hivyo ulikabidhiwa kwa kiasi kikubwa kwa walei wanyenyekevu. Wakulima waliondoka mashambani mwao, mafundi waliacha vifaa vyao, wafanyabiashara bidhaa zao, wasomi nafasi zao; na bado idadi ya wafanyakazi ilikuwa ndogo kulinganisha na kazi iliyopaswa kukamilika. Hali ya kanisa lisiloacha dhambi na ulimwengu uliolala katika uovu ililemea roho za walinzi wa kweli, nao walivumilia kwa hiari taabu, upungufu, na mateso, ili wapate kuwaita watu kwenye toba kuelekea wokovu. Ingawa walipingwa na Shetani, kazi iliendelea mbele kwa uthabiti, na ukweli wa marejeo ulikubaliwa na maelfu mengi."
      ]
    },
    "keyPoints": {
      "en": [
        "Sin is transgression of God’s law",
        "Sin breaks relationship with God",
        "Sin leads to separation and death"
      ],
      "sw": [
        "Dhambi ni kuvunja sheria ya Mungu",
        "Dhambi huvunja uhusiano na Mungu",
        "Dhambi huleta utengano na mauti"
      ]
    }
  },
  {
    "id": "religious-revival",
    "description": {
      "en": [
        "Everywhere was heard the searching testimony warning sinners, both worldlings and church members, to flee from the wrath to come. Like John the Baptist, the forerunner of Christ, the preachers laid the ax at the root of the tree and urged all to bring forth fruit meet for repentance. Their stirring appeals were in marked contrast to the assurances of peace and safety that were heard from popular pulpits, and wherever the message was given, it moved the people.",
        "The simple, direct testimony of the Scriptures, set home by the power of the Holy Spirit, brought a weight of conviction which few were able wholly to resist. Professors of religion were roused from their false security. They saw their backslidings, their worldliness and unbelief, their pride and selfishness. Many sought the Lord with repentance and humiliation. The affections  that had so long clung to earthly things they now fixed upon heaven. The Spirit of God rested upon them, and with hearts softened and subdued they joined to sound the cry, “Fear God, and give glory to Him; for the hour of His judgment is come.” Revelation 14:7",
        "Sinners inquired with weeping, “What must I do to be saved?” Those whose lives had been marked with dishonesty were anxious to make restitution. All who found peace in Christ longed to see others share the blessing. The hearts of parents were turned to their children, and the hearts of children to their parents. The barriers of pride and reserve were swept away. Heartfelt confessions were made, and the members of the household labored for the salvation of those who were nearest and dearest",
        "Often was heard the sound of earnest intercession. Everywhere were souls in deep anguish, pleading with God. Many wrestled all night in prayer for the assurance that their own sins were pardoned, or for the conversion of their relatives or neighbors. That earnest, determined faith gained its object. Had the people of God continued to be thus importunate in prayer, pressing their petitions at the mercy seat, they would be in possession of a far richer experience than they now have. There is too little prayer, too little real conviction of sin; and the lack of living faith leaves many destitute of the grace so richly provided by our gracious Redeemer.",
        "All classes flocked to the Adventist meetings. Rich and poor, high and low, were, from various causes, anxious to hear for themselves the doctrine of the second advent. The Lord held the spirit of opposition in check while His servants explained the reasons of their faith. Sometimes the instrument was feeble; but  the Spirit of God gave power to His truth. The presence of holy angels was felt in these assemblies, and many were daily added to the believers. As the evidences of Christ’s soon coming were repeated, vast crowds listened in breathless silence to the solemn words. Heaven and earth seemed to approach each other. The power of God would be felt upon old and young and middle-aged. Men sought their homes with praises upon their lips, and the glad sound rang out upon the still night air. None who attended those meetings can ever forget those scenes of deepest interest."
      ],
      "sw": [
        "Kila mahali palisikika ushuhuda wenye kuchunguza ukiwaonya wenye dhambi, wakiwemo watu wa ulimwengu na washiriki wa kanisa, kuikimbia ghadhabu inayokuja. Kama Yohana Mbatizaji, mtangulizi wa Kristo, wahubiri waliweka shoka kwenye shina la mti na kuwahimiza wote kutoa matunda yapatanayo na toba. Miito yao yenye kusisimua ilikuwa tofauti kabisa na hakikisho za amani na usalama zilizosikika kutoka kwenye mimbari maarufu, na kila mahali ambapo ujumbe huo ulitolewa, uliwatikisa watu.",
        "Ushuhuda rahisi na wa moja kwa moja wa Maandiko, ukikaziwa na nguvu ya Roho Mtakatifu, ulileta uzito wa ushawishi ambao ni wachache walioweza kuupinga kabisa. Waliokiri dini waliamshwa kutoka kwenye usalama wao wa uongo. Waliona kurudi kwao nyuma, kupenda ulimwengu na kutokuamini kwao, kiburi chao na ubinafsi wao. Wengi walimtafuta Bwana kwa toba na unyenyekevu. Upendo ambao kwa muda mrefu ulikuwa umeng’ang’ania mambo ya duniani sasa waliuweka mbinguni. Roho wa Mungu alikaa juu yao, na kwa mioyo iliyolainishwa na kunyenyekezwa, waliungana kutoa ule ukelele, 'Mcheni Mungu, na kumtukuza; kwa maana saa ya hukumu yake imekuja.' Ufunuo 14:7",
        "Wenye dhambi waliuliza kwa kulia, 'Nifanye nini nipate kuokoka?' Wale ambao maisha yao yalikuwa na alama ya ukosefu wa uaminifu walikuwa na hamu ya kufanya matengenezo. Wote waliopata amani ndani ya Kristo walitamani kuona wengine wakishiriki baraka hiyo. Mioyo ya wazazi iligeuzwa kuelekea kwa watoto wao, na mioyo ya watoto kuelekea kwa wazazi wao. Vizuizi vya kiburi na kujitenga vilifutwa. Ungamo la dhati lilifanywa, na washiriki wa kaya walifanya kazi kwa ajili ya wokovu wa wale waliokuwa karibu na wapendwa wao zaidi.",
        "Mara nyingi sauti ya maombezi ya dhati ilisikika. Kila mahali kulikuwa na roho katika uchungu mwingi, wakimsihi Mungu. Wengi walishindana usiku kucha katika maombi kwa ajili ya uhakika kwamba dhambi zao wenyewe zimesamehewa, au kwa ajili ya kuongoka kwa jamaa au majirani zao. Imani hiyo ya dhati na yenye azimio ilipata lengo lake. Kama watu wa Mungu wangeendelea kuwa na kusihi huko katika maombi, wakishinikiza maombi yao kwenye kiti cha rehema, wangekuwa na uzoefu tajiri zaidi kuliko ule walio nao sasa. Kuna maombi kidogo sana, ushawishi mdogo sana wa kweli wa dhambi; na ukosefu wa imani hai unawaacha wengi wakiwa fukara wa neema iliyoandaliwa kwa wingi na Mwokozi wetu mwenye neema.",
        "Matabaka yote yalimiminika kwenye mikutano ya Waadventista. Tajiri na maskini, wakubwa na wadogo, walikuwa, kwa sababu mbalimbali, na hamu ya kujisikilia wenyewe fundisho la kuja kwa mara ya pili. Bwana alizuia roho ya upinzani wakati watumishi Wake walipokuwa wakieleza sababu za imani yao. Wakati mwingine chombo kilikuwa dhaifu; lakini Roho wa Mungu alitoa nguvu kwa ukweli Wake. Uwepo wa malaika watakatifu ulihisiwa katika makusanyiko haya, na wengi waliongezwa kila siku kwenye idadi ya waamini. Ushahidi wa kuja upesi kwa Kristo ulipokaririwa, umati mkubwa wa watu ulisikiliza kwa kimya kikuu maneno hayo mazito. Mbingu na nchi vilionekana kukaribiana. Nguvu ya Mungu ilihisiwa juu ya wazee, vijana, na watu wa makamo. Watu walirudi majumbani mwao kwa sifa midomoni mwao, na sauti hiyo ya furaha ilivuma katika hewa tulivu ya usiku. Hakuna yeyote aliyehudhuria mikutano hiyo anayeweza kusahau matukio hayo ya kuvutia sana."
      ]
    },
    "keyPoints": {
      "en": [
        "Sin is transgression of God’s law"
      ],
      "sw": [
        "Dhambi ni kuvunja sheria ya Mungu",
        "Dhambi huvunja uhusiano na Mungu",
        "Dhambi huleta utengano na mauti"
      ]
    }
  },
  {
    "id": "opposition",
    "description": {
      "en": [
        "The proclamation of a definite time for Christ’s coming called forth great opposition from many of all classes, from the minister in the pulpit down to the most reckless, heaven-daring sinner. “No man knoweth the day nor the hour!” was heard alike from the hypocritical minister and the bold scoffer. They closed their ears to the clear and harmonious explanation of the text by those who were pointing to the close of the prophetic periods and to the signs which Christ Himself had foretold as tokens of His advent.",
        "Many who professed to love the Saviour declared that they had no opposition to the preaching of His coming; they merely objected to the definite time. God’s all-seeing eye read their hearts. They did not wish to hear of Christ’s coming to judge the world in righteousness. They had been unfaithful servants, their works would not bear the inspection of the heart-searching God, and they feared to meet their Lord. Like the Jews at the time of Christ’s first advent, they were not prepared to welcome Jesus. Satan and his angels exulted and flung the taunt in the face of Christ and holy angels, that His professed people had so little love for Him that they did not desire His appearing.",
        "Unfaithful watchmen hindered the progress of the work of God. As the people were roused, and began to inquire the way of salvation, these leaders stepped in between them and the truth, seeking to quiet their fears by falsely interpreting the Word of God. In this work Satan and unconsecrated ministers united, crying, Peace, peace, when God had not spoken peace. Like the Pharisees in Christ’s day, many refused to enter the kingdom of heaven themselves, and those who were entering in they hindered. The blood of these souls will be required at their hand.",
        "Wherever the message of truth was proclaimed, the most humble and devoted in the churches were the first to receive it. Those who studied the Bible for themselves could but see the unscriptural character of the popular views of prophecy, and wherever the people were not deceived by the efforts of the clergy to misstate and pervert the faith, wherever they would search the Word of God for themselves, the advent doctrine needed only to be compared with the Scriptures to establish its divine authority.",
        "Many were persecuted by their unbelieving brethren. In order to retain their position in the church, some consented to be silent in regard to their hope, but others felt that loyalty to God forbade them thus to hide the truths which He had committed to their trust. Not a few were cut off from the fellowship of the church for no other reason than expressing their belief in the coming of Christ. Very precious to those who bore the trial of their faith were the words of the prophet, “Your brethren that hated you, that cast you out for My name’s sake, said, Let the Lord be glorified: but He shall appear to your joy, and they shall be ashamed.” Isaiah 66:5.",
        "Angels of God were watching with the deepest interest the result of the warning. When the churches as a body rejected the message, angels turned away from them in sadness. Yet there were in the churches many who had not yet been tested in regard to the advent truth. Many were deceived by husbands, wives, parents, or children, and were made to believe it a sin even to listen to such heresies as were taught by the Adventists. Angels were bidden to keep faithful watch over these souls; for another light was yet to shine upon them from the throne of God."
      ],
      "sw": [
        "Utangazaji wa muda maalumu wa kuja kwa Kristo ulizua upinzani mkubwa kutoka kwa watu wa matabaka yote, kuanzia kwa mchungaji mimbarini hadi kwa mwenye dhambi mkaidi na asiyemwogopa Mungu. “Hakuna mtu ajuaye siku wala saa!” ilisikika vivyo hivyo kutoka kwa mchungaji mnafiki na mdhihaki mjasiri. Waliziba masikio yao wasisikie maelezo ya wazi na yenye upatano ya fungu hilo kutoka kwa wale waliokuwa wakiashiria mwisho wa vipindi vya unabii na ishara ambazo Kristo Mwenyewe alikuwa amezitabiri kama alama za kuja Kwake.",
        "Wengi waliokiri kumpenda Mwokozi walitangaza kwamba hawakuwa na upinzani dhidi ya kuhubiriwa kwa kuja Kwake; walipinga tu ule muda maalumu. Jicho la Mungu linaloona yote lilisoma mioyo yao. Hawakutaka kusikia juu ya kuja kwa Kristo kuhukumu ulimwengu kwa haki. Walikuwa watumishi wasio waaminifu, matendo yao yasingeweza kustahimili ukaguzi wa Mungu anayechunguza moyo, na waliogopa kukutana na Bwana wao. Kama Wayahudi wakati wa kuja kwa mara ya kwanza kwa Kristo, hawakuwa tayari kumkaribisha Yesu. Shetani na malaika zake walishangilia na kumrushia dhihaka Kristo na malaika watakatifu, kwamba watu Wake wanaokiri jina Lake walikuwa na upendo mdogo sana Kwake kiasi kwamba hawakutamani kutokea Kwake.",
        "Walinzi wasio waaminifu walizuia maendeleo ya kazi ya Mungu. Wakati watu walipoamshwa na kuanza kuuliza njia ya wokovu, viongozi hawa waliingilia kati yao na ukweli, wakitafuta kutuliza hofu zao kwa kulitafsiri Neno la Mungu isivyo kweli. Katika kazi hii Shetani na wachungaji wasiowekwa wakfu waliungana, wakipiga kelele, Amani, amani, wakati Mungu alikuwa hajanena amani. Kama Mafarisayo katika siku za Kristo, wengi walikataa kuingia katika ufalme wa mbinguni wao wenyewe, na wale waliokuwa wakiingia waliwazuia. Damu ya roho hizi itadaiwa mikononi mwao.",
        "Kila mahali ambapo ujumbe wa ukweli ulitangazwa, wanyenyekevu na waliojitolea zaidi makanisani walikuwa wa kwanza kuupokea. Wale waliojifunza Biblia wenyewe hawakuweza kuacha kuona tabia isiyo ya kimaandiko ya mitazamo maarufu ya unabii, na kila mahali ambapo watu hawakudanganywa na juhudi za makasisi kupotosha na kugeuza imani, kila mahali ambapo wangechunguza Neno la Mungu wao wenyewe, fundisho la marejeo lilihitaji tu kulinganishwa na Maandiko ili kuthibitisha mamlaka yake ya kimungu.",
        "Wengi waliteswa na ndugu zao wasioamini. Ili kudumisha nafasi zao kanisani, wengine walikubali kukaa kimya kuhusu tumaini lao, lakini wengine walihisi kwamba uaminifu kwa Mungu uliwakataza kuficha ukweli ambao Yeye alikuwa ameuweka amana kwao. Si wachache waliotengwa na ushirika wa kanisa kwa sababu nyingine yoyote isipokuwa kuelezea imani yao katika kuja kwa Kristo. Yalikuwa ya thamani sana kwa wale waliobeba jaribu la imani yao maneno ya nabii, “Ndugu zenu wawachukiao, waliowatupa kwa ajili ya jina Langu, walisema, Bwana na atukuzwe; lakini Yeye atatokea kwa furaha yenu, nao watatahayari.” Isaya 66:5.",
        "Malaika wa Mungu walikuwa wakitazama kwa maslahi makubwa matokeo ya onyo hilo. Wakati makanisa kama kikundi yalipokataa ujumbe huo, malaika waligeuka kutoka kwao kwa huzuni. Hata hivyo, kulikuwa na wengi makanisani ambao walikuwa bado hawajajaribiwa kuhusiana na ukweli wa marejeo. Wengi walidanganywa na waume, wake, wazazi, au watoto, na kufanywa waamini kuwa ni dhambi hata kusikiliza mafundisho hayo ya kigeni kama yale yaliyofundishwa na Waadventista. Malaika waliamriwa kuendelea kuwalinda kwa uaminifu watu hawa; kwani nuru nyingine ilikuwa bado iwaangazie kutoka kwenye kiti cha enzi cha Mungu."
      ]
    },
    "keyPoints": {
      "en": [
        "Sin is transgression of God’s law"
      ],
      "sw": [
        "Dhambi ni kuvunja sheria ya Mungu",
        "Dhambi huvunja uhusiano na Mungu",
        "Dhambi huleta utengano na mauti"
      ]
    }
  },
  {
    "id": "meet-lord",
    "description": {
      "en": [
        "With unspeakable desire those who had received the message watched for the coming of their Saviour. The time when they expected to meet Him was at hand. They approached this hour with a calm solemnity. They rested in sweet communion with God, an earnest of the peace that was to be theirs in the bright hereafter. None who experienced this hope and trust can forget those precious hours of waiting. Worldly business was for the most part laid aside for a few weeks. Believers carefully examined every thought and emotion of their hearts as if upon their deathbeds and in a few hours to close their eyes upon earthly scenes. There was no making of “ascension robes,” but all felt the need of internal evidence that they were prepared to meet the Saviour; their white robes were purity of soul, characters cleansed from sin by the atoning blood of Christ.",
        "God designed to prove His people. His hand covered a mistake in the reckoning of the prophetic periods. Adventists did not discover the error, nor was it discovered by the most learned of their opponents. The latter said, “Your reckoning of the prophetic periods is correct. Some great event is about to take place, but it is not what Mr. Miller predicts; it is the conversion of the world, and not the second advent of Christ.”",
        "The time of expectation passed, and Christ did not appear for the deliverance of His people. Those who with sincere faith and love had looked for their Saviour experienced a bitter disappointment. Yet the Lord had accomplished His purpose: He had tested the hearts of those who had professed to be waiting for His appearing. There were among them many who had been actuated by no higher motive than fear. Their profession of faith had not affected their hearts or their lives. When the expected event failed to take place, these persons declared that they were not disappointed; they had never believed that Christ would come. They were among the first to ridicule the sorrow of the true believers.",
        "But Jesus and all the heavenly host looked with love and sympathy upon the tried and faithful yet disappointed ones. Could the veil separating the visible from the invisible world have been swept back, angels would have been seen drawing near to these steadfast souls and shielding them from the shafts of Satan."
      ],
      "sw": [
        "Kwa hamu isiyoelezeka, wale waliokuwa wameupokea ujumbe walikesha wakingojea kuja kwa Mwokozi wao. Wakati waliotegemea kukutana Naye ulikuwa karibu. Waliafikia saa hii kwa utulivu na unyenyekevu mkuu. Walipumzika katika ushirika mtamu na Mungu, kionjo cha amani ambayo ingekuwa yao katika maisha yajayo yenye utukufu. Hakuna yeyote aliyepitia tumaini hili na uaminifu huu anayeweza kusahau saa hizo za thamani za kungoja. Shughuli za kidunia kwa kiasi kikubwa ziliwekwa kando kwa wiki chache. Waumini walichunguza kwa makini kila fikira na hisia za mioyo yao kana kwamba wako kwenye vitanda vyao vya mauti na baada ya saa chache wangefunga macho yao kuacha mambo ya duniani. Hakukuwa na utengenezaji wa “makanzu ya kupaa,” lakini wote walihisi hitaji la ushahidi wa ndani kwamba walikuwa tayari kukutana na Mwokozi; kanzu zao nyeupe zilikuwa usafi wa roho, tabia zilizosafishwa dhidi ya dhambi kwa damu ya upatanisho ya Kristo.",
        "Mungu alikusudia kuwajaribu watu Wake. Mkono Wake ulifunika kosa fulani katika ukokotoaji wa vipindi vya unabii. Waadventista hawakugundua kosa hilo, wala halikugunduliwa na wapinzani wao waliosoma sana. Hawa wa mwisho walisema, “Ukokotoaji wenu wa vipindi vya unabii ni sahihi. Tukio fulani kubwa liko karibu kutokea, lakini si lile ambalo Bw. Miller anatabiri; ni kuongoka kwa ulimwengu, na si kuja kwa mara ya pili kwa Kristo.”",
        "Muda wa matarajio ulipita, na Kristo hakutokea kwa ajili ya ukombozi wa watu Wake. Wale ambao kwa imani ya dhati na upendo walikuwa wamemngojea Mwokozi wao walipata tamaa chungu. Hata hivyo Bwana alikuwa ametimiza kusudi Lake: Alikuwa ameijaribu mioyo ya wale waliokuwa wamekiri kuwa wanangojea kutokea Kwake. Walikuwepo miongoni mwao wengi ambao walikuwa wakiongozwa na nia isiyo na uzito zaidi ya hofu. Ukiri wao wa imani haukuwa umegusa mioyo yao wala maisha yao. Tukio lililotarajiwa liliposhindwa kutokea, watu hawa walitangaza kwamba hawakukata tamaa; hawakuwahi kuamini kwamba Kristo angekuja. Walikuwa miongoni mwa wa kwanza kudhihaki huzuni ya waumini wa kweli.",
        "Lakini Yesu na jeshi lote la mbinguni walitazama kwa upendo na huruma wale waliojaribiwa na waaminifu, ingawa walikuwa wamekata tamaa. Kama pazia linalotenganisha ulimwengu unaoonekana na usioonekana lingeweza kuondolewa, malaika wangeonekana wakisogea karibu na roho hizi thabiti na kuwakinga dhidi ya mishale ya Shetani."
      ]
    },
    "keyPoints": {
      "en": [
        "Sin is transgression of God’s law"
      ],
      "sw": [
        "Dhambi ni kuvunja sheria ya Mungu",
        "Dhambi huvunja uhusiano na Mungu",
        "Dhambi huleta utengano na mauti"
      ]
    }
  },
  {
    "id": "second-angel-message",
    "description": {
      "en": [
        "The churches that refused to receive the first angel’s message rejected light from heaven. That message was sent in mercy to arouse them to see their true condition of worldliness and backsliding, and to seek a preparation to meet their Lord. It was to separate the church of Christ from the corrupting influence of the world that the first angel’s message was given. But with the multitude, even of professed Christians, the ties which bound them to earth were stronger than the attractions heavenward. They chose to listen to the voice of worldly wisdom, and turned away from the heart-searching message of truth.",
        "God gives light to be cherished and obeyed, not to be despised and rejected. The light which He sends becomes darkness to those who disregard it. When the Spirit of God ceases to impress the truth upon the hearts of men, all hearing is vain, and all preaching also is vain. When the churches spurned the counsel of God by rejecting the advent message, the Lord rejected them. The first angel was followed by a second, proclaiming, “Babylon is fallen, is fallen, that great city, because she made all nations drink of the wine of the wrath of her fornication.” Revelation 14:8.",
        "This message was understood by Adventists to be an announcement of the moral fall of the churches in consequence of their rejection of the first message. The proclamation, “Babylon is fallen,” was given in the summer of 1844, and as the result, about fifty thousand withdrew from these churches.",
        "Those who preached the first message had no purpose or expectation of causing divisions in the churches, or of forming separate organizations. “In all my labors,” said William Miller, “I never had the desire or thought to establish any separate interest from that of existing denominations, or to benefit one at the expense of another. I thought to benefit all. My whole object was a desire to convert souls to God, to notify the world of a coming judgment, and to induce my fellow men to make that preparation of heart which will enable them to meet their God in peace.”",
        "For a time many of the churches welcomed his labors, but as they decided against the advent truth, they desired to suppress all agitation of the subject. Those who had accepted the doctrine were thus placed in a position of great trial and perplexity. They loved their churches, and were loth to separate from them; but as they were ridiculed and oppressed, many at last arose and cast off the yoke that had been imposed upon them.",
        "Adventists, seeing that the churches rejected the testimony of God’s Word, could no longer regard them as constituting the church of Christ, “the pillar and ground of the truth;” and as the message, “Babylon is fallen,” began to be proclaimed, they felt themselves justified in separating from their former connection.",
        "Since the rejection of the first message, a sad change has taken place in the churches. As truth is spurned, error is received and cherished. Love for God and faith in His Word have grown cold. The churches have grieved the Spirit of the Lord, and it has been in a great measure withdrawn."
      ],
      "sw": [
        "Makanisa yaliyokataa kupokea ujumbe wa malaika wa kwanza yalikataa nuru kutoka mbinguni. Ujumbe huo ulitumwa kwa rehema ili kuwaamsha waone hali yao halisi ya kupenda ulimwengu na kurudi nyuma, na kutafuta maandalizi ya kukutana na Bwana wao. Ilikuwa ni kwa ajili ya kuitenga kanisa la Kristo na ushawishi wa ufisadi wa ulimwengu ndipo ujumbe wa malaika wa kwanza ulitolewa. Lakini kwa umati wa watu, hata wa wale waliojiita Wakristo, vifungo vilivyowafunga duniani vilikuwa na nguvu kuliko mvuto wa kuelekea mbinguni. Walichagua kusikiliza sauti ya hekima ya kidunia, na wakageuka na kuuacha ujumbe wa ukweli unaochunguza moyo.",
        "Mungu hutoa nuru ili ithaminiwe na kutiiwa, si ili idharauliwe na kukataliwa. Nuru Anayotuma inakuwa giza kwa wale wanaoipuuza. Wakati Roho wa Mungu anapoacha kukazia ukweli juu ya mioyo ya wanadamu, kusikia kote ni ubatili, na kuhubiri kote pia ni ubatili. Wakati makanisa yalipokataa shauri la Mungu kwa kuukataa ujumbe wa marejeo, Bwana aliwakataa. Malaika wa kwanza alifuatiwa na wa pili, akitangaza, “Umeanguka, umeanguka Babeli, mji ule ulio mkuu, kwa kuwa umewanywesha mataifa yote divai ya ghadhabu ya uasherati wake.” Ufunuo 14:8.",
        "Ujumbe huu ulieleweka na Waadventista kuwa ni tangazo la anguko la kimaadili la makanisa kama matokeo ya kukataa kwao ujumbe wa kwanza. Tangazo la “Babeli umeanguka,” lilitolewa katika majira ya joto ya mwaka 1844, na kama matokeo, takriban watu elfu hamsini walijiondoa kwenye makanisa hayo.",
        "Wale waliohubiri ujumbe wa kwanza hawakuwa na dhumuni wala mategemeo ya kusababisha migawanyiko katika makanisa, au kuanzisha mashirika tofauti. William Miller alisema, “Katika kazi zangu zote, sijawahi kuwa na hamu au wazo la kuanzisha maslahi yoyote tofauti na yale ya madhehebu yaliyopo, au kumnufaisha mmoja kwa gharama ya mwingine. Nilifikiri kuwanufaisha wote. Lengo langu lote lilikuwa hamu ya kuongoza roho kwa Mungu, kuuambia ulimwengu juu ya hukumu inayokuja, na kuwahimiza wanadamu wenzangu kufanya matengenezo hayo ya moyo yatakayowawezesha kukutana na Mungu wao kwa amani.”",
        "Kwa muda fulani makanisa mengi yalikaribisha kazi zake, lakini walipoamua kupinga ukweli wa marejeo, walitaka kukandamiza msisimko wowote wa somo hilo. Wale waliokuwa wamekubali fundisho hilo walijikuta katika hali ya majaribu makubwa na mkanganyiko. Walipenda makanisa yao, na walikuwa na kusita kujitenga nayo; lakini walipodhihakiwa na kudhulumiwa, wengi hatimaye walisimama na kutupilia mbali nira waliyokuwa wamewekewa.",
        "Waadventista, wakiona kuwa makanisa yalikataa ushuhuda wa Neno la Mungu, hawakuweza tena kuyaona kama yanayounda kanisa la Kristo, “nguzo na msingi wa kweli;” na ujumbe wa “Babeli umeanguka” ulipoanza kutangazwa, walijihisi kuwa na haki ya kujitenga na uhusiano wao wa zamani.",
        "Tangu kukataliwa kwa ujumbe wa kwanza, mabadiliko ya kusikitisha yametokea katika makanisa. Wakati ukweli unapodhaliwa, kosa hupokelewa na kuthaminiwa. Upendo kwa Mungu na imani katika Neno Lake vimepoa. Makanisa yamemhuzunisha Roho wa Bwana, naye amejiondoa kwa kiasi kikubwa."
      ]
    },
    "keyPoints": {
      "en": [
        "Sin is  of God’s law"
      ],
      "sw": [
        "Dhambi huleta utengano na mauti"
      ]
    }
  },
  {
    "id": "tarrying-time",
    "description": {
      "en": [
        "When the year 1843 entirely passed away unmarked by the advent of Jesus, those who had looked in faith for His appearing were for a time left in doubt and perplexity. But notwithstanding their disappointment, many continued to search the Scriptures, examining anew the evidences of their faith, and carefully studying the prophecies to obtain further light. The Bible testimony in support of their position seemed clear and conclusive. Signs which could not be mistaken pointed to the coming of Christ as near. The believers could not explain their disappointment; yet they felt assured that God had led them in their past experience.",
        "Their faith was greatly strengthened by the direct and forcible application of those scriptures which set forth a tarrying time. As early as 1842, the Spirit of God had moved upon Charles Fitch to devise the prophetic chart, which was generally regarded by Adventists as a fulfillment of the command given by the prophet Habakkuk, to “write the vision, and make it plain upon tables.” No one, however, then saw the tarrying time which was brought to view in the same prophecy. After the disappointment the full meaning of this scripture became apparent. Thus speaks the prophet: “Write the vision, and make it plain upon tables, that he may run that readeth it. For the vision is yet for an appointed time, but at the end it shall speak, and not lie: though it tarry, wait for it, because it will surely come, it will not tarry.” Habakkuk 2:2, 3.",
        "The waiting ones rejoiced that He who knows the end from the beginning had looked down through the ages, and, foreseeing their disappointment, had given them words of courage and hope. Had it not been for such portions of Scripture, showing that they were in the right path, their faith would have failed in that trying hour.",
        "In the parable of the ten virgins, Matthew 25, the experience of Adventists is illustrated by the incidents of an Eastern marriage. “Then shall the kingdom of heaven be likened unto ten virgins, which took their lamps, and went forth to meet the bridegroom.” “While the bridegroom tarried, they all slumbered and slept.”",
        "The widespread movement under the proclamation of the first message, answered to the going forth of the virgins, while the passing of the time of expectation, the disappointment, and the delay, were represented by the tarrying of the bridegroom. After the definite time had passed, the true believers were still united in the belief that the end of all things was at hand; but it soon became evident that they were losing, to some extent, their zeal and devotion, and were falling into the state denoted in the parable by the slumbering of the virgins during the tarrying time.",
        "About this time fanaticism began to appear. Some who professed to be zealous believers in the message rejected the Word of God as the one infallible guide, and, claiming to be led by the Spirit, gave themselves up to the control of their own feelings, impressions, and imaginations. There were some who manifested a blind and bigoted zeal, denouncing all who would not sanction their course. Their fanatical ideas and exercises met with no sympathy from the great body of Adventists; yet they served to bring reproach upon the cause of truth.",
        "The preaching of the first message in 1843, and of the midnight cry in 1844, tended directly to repress fanaticism and dissension. Those who participated in these solemn movements were in harmony; their hearts were filled with love for one another, and for Jesus, whom they expected soon to see. The one faith, the one blessed hope, lifted them above the control of any human influence and proved a shield against the assaults of Satan."
      ],
      "sw": [
        "Wakati mwaka 1843 ulipopita kabisa bila kuonekana kwa kuja kwa Yesu, wale waliokuwa wamengojea kwa imani kutokea Kwake waliachwa kwa muda katika shaka na mkanganyiko. Lakini licha ya kukata tamaa kwao, wengi waliendelea kuchunguza Maandiko, wakichunguza upya ushahidi wa imani yao, na kusoma kwa makini unabii ili kupata nuru zaidi. Ushahidi wa Biblia katika kuunga mkono msimamo wao ulionekana kuwa wazi na wa kuhitimisha. Ishara ambazo hazikuweza kukosewa ziliashiria kuja kwa Kristo kuwa karibu. Waumini hawakuweza kuelezea kukata tamaa kwao; lakini walihisi uhakika kwamba Mungu alikuwa amewaongoza katika uzoefu wao wa huko nyuma.",
        "Imani yao iliimarishwa sana na utumiaji wa moja kwa moja na wenye nguvu wa maandiko hayo ambayo yalionyesha wakati wa kukawia. Mapema mwaka 1842, Roho wa Mungu alikuwa amemwongoza Charles Fitch kubuni chati ya unabii, ambayo kwa ujumla ilichukuliwa na Waadventista kama utimilifu wa amri iliyotolewa na nabii Habakuki, “iandike njozi, ukaifanye iwe wazi katika vibao.” Hakuna mtu, hata hivyo, aliyeona wakati wa kukawia ambao ulionyeshwa katika unabii huo huo wakati huo. Baada ya kukata tamaa, maana kamili ya andiko hili ikawa dhahiri. Nabii asema hivi: “Iandike njozi, ukaifanye iwe wazi katika vibao, ili aisomaye apate kupiga mbio. Kwa maana njozi hii bado ni kwa wakati ulioamriwa, lakini mwishoni itanena, wala haitasema uongo: ijapokawia, ingojee, kwa sababu itakuja bila shaka, haitakawia.” Habakuki 2:2, 3.",
        "Wale waliokuwa wakingoja walifurahi kwamba Yeye ajuaye mwisho tangu mwanzo alikuwa ametazama chini kupitia karne zote, na, akiona mbele kukata tamaa kwao, alikuwa amewapa maneno ya ujasiri na tumaini. Isingekuwa kwa sehemu kama hizo za Maandiko, zikionyesha kwamba walikuwa katika njia sahihi, imani yao ingekuwa imeshindwa katika saa hiyo ya jaribu.",
        "Katika mfano wa wanawali kumi, Mathayo 25, uzoefu wa Waadventista unafananishwa na matukio ya ndoa ya Mashariki. “Ndipo ufalme wa mbinguni utakapofanana na wanawali kumi, waliotwaa taa zao, wakatoka kwenda kumlaki bwana arusi.” “Na bwana arusi alipokawia, wote wakasinzia wakalala usingizi.”",
        "Vuguvugu lililoenea sana chini ya utangazaji wa ujumbe wa kwanza, lililingana na kule kutoka kwa wanawali, wakati kupita kwa muda wa matarajio, kukata tamaa, na kuchelewa, kuliwakilishwa na kukawia kwa bwana arusi. Baada ya muda maalumu kupita, waumini wa kweli walikuwa bado wameungana katika imani kwamba mwisho wa mambo yote ulikuwa karibu; lakini punde ilionekana wazi kwamba walikuwa wakipoteza, kwa kiasi fulani, bidii na ujitoleaji wao, na walikuwa wakianguka katika hali iliyoonyeshwa katika mfano kwa kusinzia kwa wanawali wakati wa kukawia.",
        "Karibu na wakati huu ushabiki ulianza kuonekana. Baadhi ya wale waliojidai kuwa waumini wenye bidii katika ujumbe huo walilikataa Neno la Mungu kama mwongozo pekee usio na makosa, na, wakidai kuongozwa na Roho, walijitoa kwenye udhibiti wa hisia, miguso, na mawazo yao wenyewe. Kulikuwa na wengine walioonyesha bidii ya upofu na ya kishabiki, wakiwashutumu wote ambao hawangeidhinisha mwenendo wao. Mawazo yao ya kishabiki na mazoezi yao hayakupata huruma yoyote kutoka kwa kundi kubwa la Waadventista; lakini yalitumika kuleta shutuma juu ya kazi ya ukweli.",
        "Uhubiri wa ujumbe wa kwanza mnamo 1843, na wa kilio cha usiku wa manane mnamo 1844, ulielekea moja kwa moja kukandamiza ushabiki na mfarakano. Wale walioshiriki katika mivumo hii mizito walikuwa na upatano; mioyo yao ilijawa na upendo mmoja kwa mwingine, na kwa Yesu, ambaye walitarajia kumwona hivi karibu. Imani moja, tumaini moja lililobarikiwa, liliwainua juu ya udhibiti wa ushawishi wowote wa kibinadamu na ikawa ngao dhidi ya mashambulizi ya Shetani."
      ]
    },
    "keyPoints": {
      "en": [
        "Sin is  of God’s law"
      ],
      "sw": [
        "Dhambi huleta utengano na mauti"
      ]
    }
  },
  {
    "id": "midnight-cry",
    "description": {
      "en": [
        "“While the bridegroom tarried, they all slumbered and slept. And at midnight there was a cry made, Behold, the bridegroom cometh; go ye out to meet him. Then all those virgins arose, and trimmed their lamps.” Matthew 25:5-7. In the summer of 1844 Adventists discovered the mistake in their former reckoning of the prophetic periods, and settled upon the correct position. The 2300 days of Daniel 8:14, which all believed to extend to the second coming of Christ, had been thought to end in the spring of 1844; but it was now seen that this period extended to the autumn of the same year, and the minds of Adventists were fixed upon this point as the time for the Lord’s appearing.",
        "The proclamation of this time message was another step in the fulfillment of the parable of the marriage, whose application to the experience of Adventists had already been clearly seen. As in the parable the cry was raised at midnight announcing the approach of the bridegroom, so in the fulfillment, midway between the spring of 1844, when it was first supposed that the 2300 days would close, and the autumn of 1844, at which time it was afterward found that they were really to close, such a cry was raised, in the very words of Scripture: “Behold, the Bridegroom cometh; go ye out to meet Him.”",
        "Like a tidal wave the movement swept over the land. From city to city, from village to village, and into remote country places it went, until the waiting people of God were fully aroused. Before this proclamation fanaticism disappeared, like early frost before the rising sun. Believers once more found their position, and hope and courage animated their hearts.",
        "The work was free from those extremes which are ever manifested when there is human excitement without the controlling influence of the Word and Spirit of God. It was similar in character to those seasons of humiliation and returning unto the Lord which among ancient Israel followed messages of reproof from His servants. It bore the characteristics which mark the work of God in every age. There was little ecstatic joy, but rather deep searching of heart, confession of sin, and forsaking of the world. A preparation to meet the Lord was the burden of agonizing spirits. There was persevering prayer and unreserved consecration to God.",
        "The midnight cry was not so much carried by argument, though the Scripture proof was clear and conclusive. There went with it an impelling power that moved the soul. There was no doubt, no questioning. Upon the occasion of Christ’s triumphal entry into Jerusalem, the people who were assembled from all parts of the land to keep the feast, flocked to the Mount of Olives, and as they joined the throng that were escorting Jesus, they caught the inspiration of the hour and helped to swell the shout, “Blessed is He that cometh in the name of the Lord.” Matthew 21:9. In like manner did unbelievers who flocked to the Adventist meetings—some from curiosity, some merely to ridicule—feel the convincing power attending the message, “Behold, the Bridegroom cometh!”",
        "At that time there was faith that brought answers to prayer—faith that had respect to the recompense of reward. Like showers of rain upon the thirsty earth, the Spirit of grace descended upon the earnest seekers. Those who expected soon to stand face to face with their Redeemer felt a solemn joy that was unutterable. The softening, subduing power of the Holy Spirit melted the heart, as wave after wave of the glory of God swept over the faithful, believing ones.",
        "Carefully and solemnly those who received the message came up to the time when they hoped to meet their Lord. Every morning they felt that it was their first duty to secure the evidence of their acceptance with God. Their hearts were closely united, and they prayed much with and for one another. They often met together in secluded places to commune with God, and the voice of intercession ascended to heaven from the fields and groves. The assurance of the Saviour’s approval was more necessary to them than their daily food, and if a cloud darkened their minds, they did not rest until it was swept away. As they felt the witness of pardoning grace, they longed to behold Him whom their souls loved."
      ],
      "sw": [
        "“Hata bwana arusi alipokawia, wote wakasinzia wakalala usingizi. Lakini usiku wa manane, pakawa na ukelele, Haya, bwana arusi; tokeni mwende kumlaki. Ndipo walipoondoka wanawali wale wote, wakazitengeneza taa zao.” Mathayo 25:5-7. Katika majira ya joto ya mwaka 1844, Waadventista waligundua kosa katika ukokotoaji wao wa awali wa vipindi vya unabii, na kuanza msimamo sahihi. Siku 2300 za Danieli 8:14, ambazo wote waliamini kuwa zinafika hadi kuja kwa mara ya pili kwa Kristo, zilifikiriwa kuisha katika majira ya kuchipua ya mwaka 1844; lakini sasa ilionekana kuwa kipindi hiki kilifika hadi majira ya vuli ya mwaka huohuo, na akili za Waadventista zikaelekezwa kwenye jambo hili kama wakati wa kutokea kwa Bwana.",
        "Utangazaji wa ujumbe huu wa wakati ulikuwa hatua nyingine katika utimilifu wa mfano wa ndoa, ambao matumizi yake katika uzoefu wa Waadventista yalikuwa yameshaonekana wazi. Kama ilivyokuwa katika mfano ukelele ulipigwa usiku wa manane ukitangaza kukaribia kwa bwana arusi, vivyo hivyo katika utimilifu, katikati ya majira ya kuchipua ya 1844 (wakati ilipodhaniwa awali kuwa siku 2300 zingeisha) na majira ya vuli ya 1844 (wakati ambao baadaye ilionekana kuwa ndipo zingeisha hasa), ukelele kama huo ulipigwa, kwa maneno yaleyale ya Maandiko: “Haya, bwana arusi; tokeni mwende kumlaki!”",
        "Kama wimbi kubwa la maji, vuguvugu hilo lilivuma nchi nzima. Kutoka mji hadi mji, kijiji hadi kijiji, na hadi sehemu za mashambani za mbali lilienea, hadi watu wa Mungu waliokuwa wakingoja waliamshwa kikamilifu. Mbele ya tangazo hili ushabiki ulitoweka, kama umande wa asubuhi mbele ya jua linalochomoza. Waumini walipata tena msimamo wao, na tumaini na ujasiri vilihuisha mioyo yao.",
        "Kazi hiyo ilikuwa huru kutokana na yale mambo ya kupita kiasi ambayo hujidhihirisha kila mara kunapokuwa na msisimko wa kibinadamu bila ushawishi unaodhibiti wa Neno na Roho wa Mungu. Ilifanana katika tabia na nyakati zile za unyenyekevu na kurudi kwa Bwana ambazo miongoni mwa Israeli wa kale zilifuata jumbe za karipio kutoka kwa watumishi Wake. Ilibeba sifa zinazozingatia kazi ya Mungu katika kila kizazi. Kulikuwa na furaha kidogo ya msisimko, bali kulikuwa na uchunguzi wa kina wa moyo, ungamo la dhambi, na kuuacha ulimwengu. Maandalizi ya kukutana na Bwana ndiyo yalikuwa mzigo wa roho zilizokuwa katika juhudi kuu. Kulikuwa na maombi ya kudumu na kujiweka wakfu kwa Mungu bila kubakiza kitu.",
        "Kilio cha usiku wa manane hakikubebwa sana na hoja, ingawa ushahidi wa Maandiko ulikuwa wazi na wa kuhitimisha. Pamoja nacho kulikuwa na nguvu inayolazimisha iliyotikisa nafsi. Hakukuwa na shaka, wala maswali. Wakati wa kuingia kwa ushindi kwa Kristo Yerusalemu, watu waliokusanyika kutoka sehemu zote za nchi kuadhimisha sikukuu, walimiminika kwenye Mlima wa Mizeituni, na walipojiunga na umati uliokuwa ukimsindikiza Yesu, walipokea msukumo wa saa ile na kusaidia kuongeza sauti ya ukelele, “Amebarikiwa Yeye ajaye kwa jina la Bwana.” Mathayo 21:9. Vivyo hivyo, wasioamini waliofurika katika mikutano ya Waadventista—wengine kwa udadisi, wengine ili kudhihaki tu—walihisi nguvu ya kusadikisha iliyoambatana na ujumbe, “Haya, bwana arusi!”",
        "Wakati huo kulikuwa na imani iliyoleta majibu ya maombi—imani iliyozingatia malipo ya thawabu. Kama manyunyu ya mvua juu ya nchi yenye kiu, Roho wa neema alishuka juu ya watafutaji wa dhati. Wale waliotarajia kusimama uso kwa uso na Mkombozi wao hivi karibu walihisi furaha nzito isiyoweza kutamkwa. Nguvu ya Roho Mtakatifu ya kulainisha na kunyenyekeza iliyeyusha moyo, wakati wimbi baada ya wimbi la utukufu wa Mungu likipita juu ya wale waaminifu, wanaoamini.",
        "Kwa uangalifu na unyenyekevu, wale walioupokea ujumbe walikaribia wakati ambao walitegemea kukutana na Bwana wao. Kila asubuhi walihisi kuwa wajibu wao wa kwanza ulikuwa kupata ushahidi wa kukubalika kwao na Mungu. Mioyo yao iliunganishwa kwa karibu, na waliomba sana pamoja na kwa ajili ya mmoja na mwingine. Mara nyingi walikutana pamoja katika sehemu za faragha ili kuzungumza na Mungu, na sauti ya maombezi ilipanda mbinguni kutoka mashambani na vichakani. Uhakika wa kibali cha Mwokozi ulikuwa wa lazima kwao kuliko chakula chao cha kila siku, na ikiwa wingu lilitia giza akili zao, hawakupumzika hadi lilipoondolewa. Walipohisi ushuhuda wa neema inayosamehe, walitamani sana kumwona Yeye ambaye nafsi zao zilimpenda."
      ]
    },
    "keyPoints": {
      "en": [
        "The cross reveals God’s love and justice",
        "Christ bore the penalty of sin",
        "Salvation is a gift through sacrifice"
      ],
      "sw": [
        "Msalaba unaonyesha upendo na haki ya Mungu",
        "Kristo alichukua adhabu ya dhambi",
        "Wokovu ni zawadi kupitia dhabihu"
      ]
    }
  },
  {
    "id": "disappoinement",
    "description": {
      "en": [
        "But again they were destined to disappointment. The time of expectation passed, and their Saviour did not appear. With unwavering confidence they had looked forward to His coming, and now they felt as did Mary, when, coming to the Saviour’s tomb and finding it empty, she exclaimed with weeping, “They have taken away my Lord, and I know not where they have laid Him.” John 20:13.",
        "A feeling of awe, a fear that the message might be true, had for a time served as a restraint upon the unbelieving world. After the passing of the time this did not at once disappear; they dared not triumph over the disappointed ones, but as no tokens of God’s wrath were seen, they recovered from their fears and resumed their reproach and ridicule. A large class who had professed to believe in the Lord’s soon coming renounced their faith. Some who had been very confident were so deeply wounded in their pride that they felt like fleeing from the world. Like Jonah, they complained of God, and chose death rather than life.",
        "Those who had based their faith upon the opinions of others, and not upon the Word of God, were now as ready to again exchange their views. The scoffers won the weak and cowardly to their ranks, and all united in declaring that there could be no more fears or expectations now. The time had passed, the Lord had not come, and the world might remain the same for thousands of years.",
        "The earnest, sincere believers had given up all for Christ, and had shared His presence as never before. They had, as they believed, given their last warning to the world, and, expecting soon to be received into the society of their divine Master and the heavenly angels, they had, to a great extent, withdrawn from the unbelieving multitude. With intense desire they had prayed, “Come, Lord Jesus, and come quickly.” But He had not come. And now to take up again the heavy burden of life’s cares and perplexities, and to endure the taunts and sneers of a scoffing world, was indeed a terrible trial of faith and patience.",
        "Yet this disappointment was not so great as was that experienced by the disciples at the time of Christ’s first advent. When Jesus rode triumphantly into Jerusalem, His followers believed that He was about to ascend the throne of David and deliver Israel from her oppressors. With high hopes and joyful anticipations they vied with one another in showing honor to their King. Many spread out their garments as a carpet in His path, or strewed before Him the leafy branches of the palm. In their enthusiastic joy they united in the glad acclaim, “Hosanna to the Son of David!”",
        "When the Pharisees, disturbed and angered by this outburst of rejoicing, wished Jesus to rebuke His disciples, He replied, “If these should hold their peace, the stones would immediately cry out.” Luke 19:40. Prophecy must be fulfilled. The disciples were accomplishing the purpose of God; yet they were doomed to a bitter disappointment. But a few days had passed ere they witnessed the Saviour’s agonizing death and laid Him in the tomb. Their expectations had not been realized in a single particular, and their hopes died with Jesus. Not till their Lord had come forth triumphant from the grave could they perceive that all had been foretold by prophecy, and “that Christ must needs have suffered, and risen again from the dead.” Acts 17:3.",
        "In like manner was prophecy fulfilled in the first and second angels’ messages. They were given at the right time and accomplished the work which God designed to accomplish by them. The world had been looking on, expecting that if the time passed and Christ did not appear, the whole system of adventism would be given up. But while many, under strong temptation, yielded their faith, there were some who stood firm. They could detect no error in their reckoning of the prophetic periods. The ablest of their opponents had not succeeded in overthrowing their position. True, there had been a failure as to the expected event, but even this could not shake their faith in the Word of God.",
        "God did not forsake His people; His Spirit still abode with those who did not rashly deny the light which they had received, and denounce the advent movement. The apostle Paul, looking down through the ages, had written words of encouragement and warning for the tried, waiting ones at this crisis: “Cast not away therefore your confidence, which hath great recompence of reward. For ye have need of patience, that, after ye have done the will of God, ye might receive the promise. For yet a little while, and He that shall come will come, and will not tarry. Now the just shall live by faith: but if any man draw back, My soul shall have no pleasure in him. But we are not of them who draw back unto perdition; but of them that believe to the saving of the soul.” Hebrews 10:35-39.",
        "Their only safe course was to cherish the light which they had already received of God, hold fast to His promises, and continue to search the Scriptures, and patiently wait and watch to receive further light."
      ],
      "sw": [
        "Lakini tena walikuwa wamekusudiwa kukatishwa tamaa. Wakati wa matarajio ulipita, na Mwokozi wao hakutokea. Kwa ujasiri usioyumbayumba walikuwa wamengojekea kuja Kwake, na sasa walihisi kama Mariamu alivyohisi, alipofika kwenye kaburi la Mwokozi na kulikuta tupu, alilia akisema, “Wamemwondoa Bwana wangu, wala mimi sijui walikomweka.” Yohana 20:13.",
        "Hisia ya hofu kuu, hofu kwamba ujumbe ule ungeweza kuwa wa kweli, kwa muda fulani ilikuwa imetumika kama kizuizi kwa ulimwengu usioamini. Baada ya kupita kwa wakati huo, hali hii haikutoweka mara moja; hawakuthubutu kuwakebehi wale waliokata tamaa, lakini kwa kuwa hakuna ishara za ghadhabu ya Mungu zilizonekana, walipona hofu zao na kuanza tena shutuma na dhihaka zao. Kundi kubwa la watu waliokiri kuamini kuja kwa Bwana hivi karibuni walikana imani yao. Baadhi ya wale waliokuwa na uhakika mkubwa walijeruhiwa vibaya katika kiburi chao kiasi kwamba walihisi kama kukimbia ulimwengu. Kama Yona, walimnung’unikia Mungu, na kuchagua kifo badala ya uzima.",
        "Wale waliokuwa wameweka msingi wa imani yao juu ya maoni ya wengine, na si juu ya Neno la Mungu, sasa walikuwa tayari kubadilisha tena mitazamo yao. Wadhihaki walivuta watu dhaifu na waoga kwenye safu zao, na wote waliungana kutangaza kwamba hakuwezi kuwa na hofu au matarajio tena sasa. Wakati ulikuwa umepita, Bwana hakuja, na ulimwengu ungeweza kubaki vilevile kwa maelfu ya miaka.",
        "Waumini wa dhati na wa kweli walikuwa wameacha vyote kwa ajili ya Kristo, na walikuwa wameshiriki uwepo Wake kuliko wakati mwingine wowote. Walikuwa, kama walivyoamini, wametoa onyo lao la mwisho kwa ulimwengu, na wakitarajia kupokelewa hivi karibuni katika ushirika wa Bwana wao wa kimungu na malaika wa mbinguni, walikuwa, kwa kiasi kikubwa, wamejitenga na umati usioamini. Kwa hamu kubwa walikuwa wameomba, “Njoo, Bwana Yesu, na uje upesi.” Lakini hakuja. Na sasa kuanza tena kubeba mzigo mzito wa mahangaiko na mikanganyiko ya maisha, na kuvumilia dhihaka na kashfa za ulimwengu unaodhihaki, kwa kweli lilikuwa jaribu la kutisha la imani na uvumilivu.",
        "Hata hivyo kukata tamaa huku hakukuwa kukubwa kama kule walikopitia wanafunzi wakati wa kuja kwa mara ya kwanza kwa Kristo. Wakati Yesu alipoingia Yerusalemu kwa ushindi, wafuasi Wake waliamini kwamba alikuwa karibu kuketi kwenye kiti cha enzi cha Daudi na kuikomboa Israeli kutoka kwa watesi wake. Kwa matumaini makubwa na matarajio ya furaha walishindana wao kwa wao katika kumheshimu Mfalme wao. Wengi walitandaza nguo zao kama zulia njiani Mwake, au kutandaza mbele Yake matawi ya mitende. Katika furaha yao ya shauku waliungana katika kelele za furaha, “Hosana kwa Mwana wa Daudi!”",
        "Wakati Mafarisayo, wakisumbuliwa na kukasirishwa na mlipuko huu wa furaha, walipotaka Yesu awakemee wanafunzi Wake, Alijibu, “Hawa wakinyamaza, mawe haya yatapiga kelele mara.” Luka 19:40. Unabii ulipaswa kutimia. Wanafunzi walikuwa wakitunza kusudi la Mungu; lakini walikuwa wamehukumiwa kukatishwa tamaa chungu. Lakini siku chache tu zilipita kabla ya kushuhudia kifo cha uchungu cha Mwokozi na kumweka kaburini. Matarajio yao hayakuwa yametimia hata katika jambo moja, na matumaini yao yalikufa pamoja na Yesu. Haikuwa mpaka Bwana wao alipotoka kwa ushindi kutoka kaburini ndipo walipoweza kutambua kwamba yote yalikuwa yametabiriwa na unabii, na “kwamba ilimpasa Kristo kuteswa, na kufufuka katika wafu.” Matendo 17:3.",
        "Vivyo hivyo, unabii ulitimizwa katika jumbe za malaika wa kwanza na wa pili. Zilitolewa kwa wakati unaofaa na zilikamilisha kazi ambayo Mungu alikusudia kuikamilisha kupitia hizo. Ulimwengu ulikuwa ukitazama, ukitarajia kwamba ikiwa wakati ungepita na Kristo asitokee, mfumo mzima wa Uadventista ungeachwa. Lakini wakati wengi, chini ya majaribu makali, walisalimisha imani yao, kulikuwa na baadhi waliosimama imara. Hawakuweza kugundua kosa lolote katika ukokotoaji wao wa vipindi vya unabii. Wapinzani wao stadi zaidi walikuwa hawajafanikiwa kupindua msimamo wao. Ni kweli, kulikuwa na kushindwa kwa lile tukio lililotarajiwa, lakini hata hili lisingeweza kutikisa imani yao katika Neno la Mungu.",
        "Mungu hakuwaacha watu Wake; Roho Wake bado alikaa na wale ambao hawakukana kwa haraka nuru waliyokuwa wameipokea, na kusingizia vuguvugu la marejeo. Mtume Paulo, akitazama mbele kupitia karne zote, alikuwa ameandika maneno ya kutia moyo na onyo kwa wale waliojaribiwa, wakingoja katika mgogoro huu: “Basi msiutupe ujasiri wenu, kwa maana una thawabu kuu. Kwa maana mnahitaji saburi, ili kwamba, mkiisha kuyafanya mapenzi ya Mungu, mpate ile ahadi. Kwa kuwa bado kitambo kidogo sana, Yeye ajaye atakuja, wala hatakawia. Lakini mwenye haki wangu ataishi kwa imani; naye akisita-sita, roho yangu haina furaha naye. Lakini sisi hatumo miongoni mwao wasita-sitao na kupotea, bali tumo miongoni mwa walio na imani ya kutuokoa roho zetu.” Waebrania 10:35-39.",
        "Njia yao pekee ya salama ilikuwa kuthamini nuru ambayo walikuwa tayari wameipokea kutoka kwa Mungu, kushikilia ahadi Zake, na kuendelea kuchunguza Maandiko, na kungoja na kukesha kwa uvumilivu ili kupokea nuru zaidi."
      ]
    },
    "keyPoints": {
      "en": [
        "The cross reveals God’s love and justice",
        "Christ bore the penalty of sin",
        "Salvation is a gift through sacrifice"
      ],
      "sw": [
        "Msalaba unaonyesha upendo na haki ya Mungu",
        "Kristo alichukua adhabu ya dhambi",
        "Wokovu ni zawadi kupitia dhabihu"
      ]
    }
  },
  {
    "id": "sanctuary",
    "description": {
      "en": [
        "The scripture which above all others had been both the foundation and central pillar of the advent faith was the declaration, “Unto two thousand and three hundred days; then shall the sanctuary be cleansed.” Daniel 8:14. These had been familiar words to all believers in the Lord’s soon coming. By the lips of thousands was this prophecy joyfully repeated as the watchword of their faith. All felt that upon the events therein brought to view depended their brightest expectations and most cherished hopes.",
        "These prophetic days had been shown to terminate in the autumn of 1844. In common with the rest of the Christian world, Adventists then held that the earth, or some portion of it, was the sanctuary, and that the cleansing of the sanctuary was the purification of the earth by the fires of the last great day. This they understood would take place at the second coming of Christ. Hence the conclusion that Christ would return to the earth in 1844.",
        "But the appointed time came, and the Lord did not appear. The believers knew that God’s Word could not fail; their interpretation of the prophecy must be at fault; but where was the mistake? Many rashly cut the knot of difficulty by denying that the 2300 days ended in 1844. No reason could be given for this position, except that Christ had not come at the time of expectation.",
        "They argued that if the prophetic days had ended in 1844, Christ would then have come to cleanse the sanctuary by the purification of the earth by fire; and that since He had not come, the days could not have ended.",
        "Though the majority of Adventists abandoned their former reckoning of the prophetic periods, and consequently denied the correctness of the movement based thereon, a few were unwilling to renounce points of faith and experience that were sustained by the Scriptures and by the special witness of the Spirit of God. They believed that they had adopted sound principles of interpretation in their study of the Scriptures, and that it was their duty to hold fast the truths already gained, and to still pursue the same course of Biblical research. With earnest prayer they reviewed their position, and studied the Scriptures to discover their mistake. As they could see no error in their explanation of the prophetic periods, they were led to examine more closely the subject of the sanctuary."
      ],
      "sw": [
        "Andiko ambalo kuliko mengine yote lilikuwa msingi na nguzo kuu ya imani ya marejeo lilikuwa ni lile tamko, “Hata jioni na asubuhi elfu mbili na mia tatu; ndipo patakatifu patapotakasika.” Danieli 8:14. Haya yalikuwa maneno yaliyozoeleka kwa waumini wote wa kuja kwa Bwana upesi. Kupitia vinywa vya maelfu, unabii huu ulikaririwa kwa furaha kama neno la siri la imani yao. Wote walihisi kuwa matukio yaliyoonyeshwa humo ndimo yalitegemea matarajio yao angavu zaidi na matumaini yao waliyoyathamini sana.",
        "Siku hizi za unabii zilikuwa zimeonyeshwa kuishia katika majira ya vuli ya mwaka 1844. Pamoja na ulimwengu wote wa Kikristo, Waadventista wakati huo waliamini kuwa dunia, au sehemu fulani ya dunia, ndiyo lilikuwa patakatifu, na kwamba kutakaswa kwa patakatifu kulikuwa ni kutakaswa kwa dunia kwa moto wa siku kuu ya mwisho. Walielewa kuwa jambo hili lingetokea wakati wa kuja kwa mara ya pili kwa Kristo. Hivyo basi, wakafikia hitimisho kuwa Kristo angerudi duniani mnamo 1844.",
        "Lakini wakati uliowekwa ulifika, na Bwana hakutokea. Waumini walijua kuwa Neno la Mungu haliwezi kushindwa; tafsiri yao ya unabii lazima ilikuwa na makosa; lakini kosa lilikuwa wapi? Wengi kwa haraka walikata fundo la ugumu huo kwa kukanusha kuwa siku 2300 ziliisha mnamo 1844. Hakuna sababu iliyoweza kutolewa kwa msimamo huo, isipokuwa tu kwamba Kristo hakuja wakati wa matarajio.",
        "Walidai kuwa kama siku za unabii zingeisha mnamo 1844, Kristo angekuja wakati huo kutakasa patakatifu kwa kuitakasa dunia kwa moto; na kwa kuwa Hakuja, basi siku hizo zisingeweza kuwa zimeisha.",
        "Ingawa idadi kubwa ya Waadventista waliacha ukokotoaji wao wa awali wa vipindi vya unabii, na hivyo kukanusha usahihi wa vuguvugu lililojengwa juu yake, wachache hawakuwa tayari kukana vipengele vya imani na uzoefu ambao ulitegemezwa na Maandiko na ushuhuda maalum wa Roho wa Mungu. Waliamini kuwa walikuwa wamefuata kanuni thabiti za tafsiri katika kujifunza kwao Maandiko, na kwamba ulikuwa wajibu wao kushikilia sana kweli ambazo tayari walikuwa wamezipata, na kuendelea na mkondo uleule wa utafiti wa Biblia. Kwa maombi ya dhati walipitia upya msimamo wao, na kujifunza Maandiko ili kugundua kosa lao. Kwa kuwa hawakuona kosa lolote katika maelezo yao ya vipindi vya unabii, waliongozwa kuchunguza kwa ukaribu zaidi somo la patakatifu."
      ]
    },
    "keyPoints": {
      "en": [
        "The cross reveals God’s love and justice",
        "Christ bore the penalty of sin",
        "Salvation is a gift through sacrifice"
      ],
      "sw": [
        "Msalaba unaonyesha upendo na haki ya Mungu",
        "Kristo alichukua adhabu ya dhambi",
        "Wokovu ni zawadi kupitia dhabihu"
      ]
    }
  },
  {
    "id": "earthly-and-heavenly-sanctuaries",
    "description": {
      "en": [
        "In their investigation they learned that the earthly sanctuary, built by Moses at the command of God according to the pattern shown him in the mount, was “a figure for the time then present, in which were offered both gifts and sacrifices”; that its two holy places were “patterns of things in the heavens”; that Christ, our great High Priest, is “a minister of the sanctuary, and of the true tabernacle, which the Lord pitched, and not man”; that “Christ is not entered into the holy places made with hands, which are the figures of the true; but into heaven itself, now to appear in the presence of God for us.” Hebrews 9:9, 23; 8:2; Hebrews 9:24.",
        "The sanctuary in heaven, in which Jesus ministers in our behalf, is the great original, of which the sanctuary built by Moses was a copy. As the sanctuary on earth had two apartments, the holy and the most holy, so there are two holy places in the sanctuary in heaven. And the ark containing the law of God, the altar of incense, and other instruments of service found in the sanctuary below, have also their counterpart in the sanctuary above. In holy vision the apostle John was permitted to enter heaven, and he there beheld the candlestick and the altar of incense, and as “the temple of God was opened,” he beheld also “the ark of His testament.” Revelation 4:5; 8:3; Revelation 11:19.",
        "Those who were seeking for the truth found indisputable proof of the existence of a sanctuary in heaven. Moses made the earthly sanctuary after a pattern which was shown him. Paul declared that that pattern was the true sanctuary which is in heaven. (Hebrews 8:2, 5.) John testified that he saw it in heaven.",
        "At the termination of the 2300 days, in 1844, no sanctuary had existed on earth for many centuries; therefore the sanctuary in heaven must be the one brought to view in the declaration, “Unto two thousand and three hundred days; then shall the sanctuary be cleansed.” But how could the sanctuary in heaven need cleansing? Turning again to the Scriptures, the students of prophecy learned that the cleansing was not a removal of physical impurities, for it was to be accomplished with blood, and therefore must be a cleansing from sin. Thus says the apostle: “It was therefore necessary that the patterns of things in the heavens should be purified with these [the blood of animals]; but the heavenly things themselves with better sacrifices than these [even the precious blood of Christ].” Hebrews 9:23."
      ],
      "sw": [
        "Katika uchunguzi wao walijifunza kuwa patakatifu pa duniani, palipojengwa na Musa kwa amri ya Mungu kulingana na mfano alioonyeshwa mlimani, palikuwa “mfano wa wakati huo wa sasa, ambapo sadaka na dhabihu zilitolewa”; kwamba mahali pake pawili patakatifu palikuwa “mifano ya mambo yaliyo mbinguni”; kwamba Kristo, Kuhani wetu Mkuu, ni “mhudumu wa patakatifu, na wa ile hema ya kweli, ambayo Bwana aliiweka, wala si mwanadamu”; kwamba “Kristo hakuingia katika patakatifu palipofanywa kwa mikono, ndio mfano wa ule wa kweli; bali aliingia mbinguni hasa, aonekane sasa mbele za Mungu kwa ajili yetu.” Waebrania 9:9, 23; 8:2; 9:24.",
        "Patakatifu pa mbinguni, ambapo Yesu anahudumu kwa niaba yetu, ndicho kile chapa asili kuu, ambacho patakatifu palipojengwa na Musa palikuwa nakala yake. Kama vile patakatifu pa duniani palivyokuwa na vyumba viwili, patakatifu na patakatifu mno, vivyo hivyo kuna mahali pawili patakatifu katika patakatifu pa mbinguni. Na sanduku lenye sheria ya Mungu, madhabahu ya kufukizia uvumba, na vyombo vingine vya huduma vilivyopatikana katika patakatifu pa chini, pia vina mfano wake katika patakatifu pa juu. Katika maono matakatifu mtume Yohana aliruhusiwa kuingia mbinguni, na huko aliona kinara cha taa na madhabahu ya uvumba, na wakati “hekalu la Mungu lilipofunguliwa,” aliona pia “sanduku la agano lake.” Ufunuo 4:5; 8:3; 11:19.",
        "Wale waliokuwa wakitafuta ukweli walipata ushahidi usiopingika wa kuwepo kwa patakatifu mbinguni. Musa alitengeneza patakatifu pa duniani kwa kufuata mfano alioonyeshwa. Paulo alitangaza kwamba mfano huo ulikuwa patakatifu pa kweli palipo mbinguni. (Waebrania 8:2, 5.) Yohana alishuhudia kwamba alipaona mbinguni.",
        "Mwishoni mwa zile siku 2300, mnamo 1844, hapakuwa na patakatifu duniani kwa karne nyingi; kwa hivyo patakatifu pa mbinguni lazima ndipo palipoonyeshwa katika lile tamko, “Hata jioni na asubuhi elfu mbili na mia tatu; ndipo patakatifu patapotakasika.” Lakini patakatifu pa mbinguni pangewezaje kuhitaji kutakaswa? Wakirudi tena kwenye Maandiko, wanafunzi wa unabii walijifunza kwamba kutakaswa huko hakukuwa kuondolewa kwa uchafu wa kimwili, kwa maana kulipaswa kutimizwa kwa damu, na kwa hivyo lazima kuwe ni kutakaswa kwa dhambi. Hivyo ndivyo asemavyo mtume: “Basi ilikuwa lazima mifano ya mambo yaliyo mbinguni isafishwe kwa hayo [damu ya wanyama]; lakini mambo ya mbinguni yenyewe yasafishwe kwa dhabihu zilizo bora kuliko hizo [hata damu ya thamani ya Kristo].” Waebrania 9:23."
      ]
    },
    "keyPoints": {
      "en": [
        "The cross reveals God’s love and justice",
        "Christ bore the penalty of sin",
        "Salvation is a gift through sacrifice"
      ],
      "sw": [
        "Msalaba unaonyesha upendo na haki ya Mungu",
        "Kristo alichukua adhabu ya dhambi",
        "Wokovu ni zawadi kupitia dhabihu"
      ]
    }
  },
  {
    "id": "cleansing-of-the-sanctuary",
    "description": {
      "en": [
        "As the sins of the people were anciently transferred, in figure, to the earthly sanctuary by the blood of the sin offering, so our sins are, in fact, transferred to the heavenly sanctuary by the blood of Christ. And as the typical cleansing of the earthly was accomplished by the removal of the sins by which it had been polluted, so the actual cleansing of the heavenly is to be accomplished by the removal, or blotting out, of the sins which are there recorded.",
        "This necessitates an examination of the books of record to determine who, through repentance of sin and faith in Christ, are entitled to the benefits of His atonement. The cleansing of the sanctuary therefore involves a work of investigative judgment. This work must be performed prior to the coming of Christ to redeem His people, for when He comes, His reward is with Him to give to every man according to his works. (Revelation 22:12.)",
        "Thus those who followed in the advancing light of the prophetic word saw that instead of coming to the earth at the termination of the 2300 days in 1844, Christ then entered the most holy place of the heavenly sanctuary, into the presence of God, to perform the closing work of atonement, preparatory to His coming."
      ],
      "sw": [
        "Kama vile dhambi za watu zilivyohamishwa hapo kale, kwa mfano, hadi kwenye patakatifu pa duniani kwa damu ya dhabihu ya dhambi, vivyo hivyo dhambi zetu, kwa kweli, zinahamishiwa kwenye patakatifu pa mbinguni kwa damu ya Kristo. Na kama vile kutakaswa kwa mfano kwa patakatifu pa duniani kulivyotimizwa kwa kuondolewa kwa dhambi ambazo zilikuwa zimepachafua, vivyo hivyo kutakaswa halisi kwa patakatifu pa mbinguni kunapaswa kutimizwa kwa kuondolewa, au kufutwa kabisa, kwa dhambi ambazo zimerekodiwa huko.",
        "Hili linahitaji uchunguzi wa vitabu vya kumbukumbu ili kubaini ni nani, kwa njia ya toba ya dhambi na imani katika Kristo, anastahili kupata faida za upatanisho Wake. Kwa hivyo, kutakaswa kwa patakatifu kunahusisha kazi ya hukumu ya upelelezi. Kazi hii lazima ifanyike kabla ya kuja kwa Kristo kuwakomboa watu Wake, kwa maana Atakapokuja, ijara Yake i pamoja Naye kumlipa kila mtu kama kazi yake ilivyo. (Ufunuo 22:12.)",
        "Hivyo wale waliofuata nuru inayozidi kuangaza ya neno la unabii waliona kwamba badala ya kuja duniani mwishoni mwa siku 2300 mnamo 1844, Kristo wakati huo aliingia katika patakatifu mno pa patakatifu pa mbinguni, mbele za Mungu, ili kufanya kazi ya kufunga ya upatanisho, kama maandalizi ya kuja Kwake."
      ]
    },
    "keyPoints": {
      "en": [
        "The cross reveals God’s love and justice",
        "Christ bore the penalty of sin",
        "Salvation is a gift through sacrifice"
      ],
      "sw": [
        "Msalaba unaonyesha upendo na haki ya Mungu",
        "Kristo alichukua adhabu ya dhambi",
        "Wokovu ni zawadi kupitia dhabihu"
      ]
    }
  },
  {
    "id": "third-angel-message",
    "description": {
      "en": [
        "When Christ entered the most holy place of the heavenly sanctuary to perform the closing work of the atonement, He committed to His servants the last message of mercy to be given to the world. Such is the warning of the third angel of Revelation 14. Immediately following its proclamation, the Son of man is seen by the prophet coming in glory to reap the harvest of the earth.",
        "As foretold in the Scriptures, the ministration of Christ in the most holy place began at the termination of the prophetic days in 1844. To this time apply the words of the Revelator, “The temple of God was opened in heaven, and there was seen in His temple the ark of His testament.” Revelation 11:19. The ark of God’s testament is in the second apartment of the sanctuary. As Christ entered there, to minister in the sinner’s behalf, the inner temple was opened, and the ark of God was brought to view.",
        "They had by faith followed their High Priest from the holy to the most holy, and they saw Him pleading His blood before the ark of God. Within that sacred ark is the Father’s law, the same that was spoken by God Himself amid the thunders of Sinai, and written with His own finger on the tables of stone. Not one command has been annulled; not a jot or tittle has been changed. While God gave to Moses a copy of His law, He preserved the great original in the sanctuary above.",
        "Tracing down its holy precepts, the seekers for truth found, in the very bosom of the Decalogue, the fourth commandment, as it was first proclaimed: “Remember the Sabbath day, to keep it holy... the seventh day is the Sabbath of the Lord thy God.” Exodus 20:8-11. The Spirit of God impressed the hearts of these students of His Word. The conviction was urged upon them that they had ignorantly transgressed the fourth commandment by disregarding the Creator’s rest day.",
        "They could find no evidence in the Scriptures that the fourth commandment had been abolished, or that the Sabbath had been changed; the blessing which first hallowed the seventh day had never been removed. They at once evinced their loyalty to God by keeping His Sabbath holy.",
        "Those who had accepted the light concerning the mediation of Christ and the perpetuity of the law of God, found that these were the truths brought to view in the third message. The angel declares, “Here are they that keep the commandments of God, and the faith of Jesus.” Revelation 14:12. This statement is preceded by a solemn and fearful warning against the worship of the beast and his image."
      ],
      "sw": [
        "Wakati Kristo alipoingia katika patakatifu mno pa patakatifu pa mbinguni ili kufanya kazi ya kufunga ya upatanisho, Aliwakabidhi watumishi Wake ujumbe wa mwisho wa rehema utakaotolewa kwa ulimwengu. Huo ndio onyo la malaika wa tatu wa Ufunuo 14. Mara tu baada ya kutangazwa kwake, Mwana wa Adamu anaonekana na nabii akija katika utukufu kuvuna mavuno ya dunia.",
        "Kama ilivyotabiriwa katika Maandiko, huduma ya Kristo katika patakatifu mno ilianza mwishoni mwa siku za unabii mnamo 1844. Wakati huu unahusiana na maneno ya Mfunuaji, “Hekalu la Mungu lilifunguliwa mbinguni, na sanduku la agano Lake likaonekana ndani ya hekalu Lake.” Ufunuo 11:19. Sanduku la agano la Mungu liko katika chumba cha pili cha patakatifu. Kristo alipoingia huko, ili kuhudumu kwa niaba ya mwenye dhambi, hekalu la ndani lilifunguliwa, na sanduku la Mungu likaonekana.",
        "Walikuwa wamemfuata Kuhani wao Mkuu kwa imani kutoka patakatifu hadi patakatifu mno, na walimwona akitetea kwa damu Yake mbele ya sanduku la Mungu. Ndani ya sanduku hilo takatifu kuna sheria ya Baba, ileile iliyonunuliwa na Mungu Mwenyewe katikati ya radi za Sinai, na kuandikwa kwa kidole Chake Mwenyewe kwenye mbao za mawe. Hakuna amri hata moja iliyofutwa; wala nukta au herufi moja haijabadilishwa. Wakati Mungu alimpa Musa nakala ya sheria Yake, Alihifadhi chapa asili kuu katika patakatifu pa mbinguni.",
        "Wakifuata maagizo yake matakatifu, watafutaji wa ukweli walipata, katikati kabisa ya Amri Kumi, amri ya nne, kama ilivyotangazwa mara ya kwanza: “Ikumbuke siku ya Sabato uitakase... siku ya saba ni Sabato ya Bwana, Mungu wako.” Kutoka 20:8-11. Roho wa Mungu aligusa mioyo ya wanafunzi hawa wa Neno Lake. Ushawishi ulikaziwa kwao kwamba walikuwa wameivunja amri ya nne kwa ujinga kwa kupuuza siku ya mapumziko ya Muumbaji.",
        "Hawakuweza kupata ushahidi wowote katika Maandiko kwamba amri ya nne ilikuwa imefutwa, au kwamba Sabato ilikuwa imebadilishwa; baraka ambayo ilitakasa siku ya saba mara ya kwanza haikuwa imewahi kuondolewa. Mara moja walionyesha uaminifu wao kwa Mungu kwa kuitunza Sabato Yake kuwa takatifu.",
        "Wale waliokuwa wamekubali nuru kuhusu uombezi wa Kristo na uendelevu wa sheria ya Mungu, waligundua kuwa hizi ndizo kweli zilizoonyeshwa katika ujumbe wa tatu. Malaika anatangaza, “Hapa ndipo penye subira ya watakatifu, hao wazishikao amri za Mungu, na imani ya Yesu.” Ufunuo 14:12. Kauli hii inatanguliwa na onyo zito na la kutisha dhidi ya kumwabudu mnyama na sanamu yake."
      ]
    },
    "keyPoints": {
      "en": [
        "The cross reveals God’s love and justice",
        "Christ bore the penalty of sin",
        "Salvation is a gift through sacrifice"
      ],
      "sw": [
        "Msalaba unaonyesha upendo na haki ya Mungu",
        "Kristo alichukua adhabu ya dhambi",
        "Wokovu ni zawadi kupitia dhabihu"
      ]
    }
  },
  {
    "id": "beast-and-its-image",
    "description": {
      "en": [
        "By this first beast is represented the Roman Church, an ecclesiastical body clothed with civil power, having authority to punish all dissenters. The image to the beast represents another religious body clothed with similar powers. The formation of this image is the work of that beast whose peaceful rise and mild professions render it so striking a symbol of the United States. Here is to be found an image of the Papacy. When the churches of our land, uniting upon such points of faith as are held by them in common, shall influence the State to enforce their decrees and sustain their institutions, then will Protestant America have formed an image of the Roman hierarchy. Then the true church will be assailed by persecution, as were God’s ancient people.",
        "The beast with lamblike horns commands “all, both small and great, rich and poor, free and bond, to receive a mark in their right hand, or in their foreheads: and that no man might buy or sell, save he that had the mark, or the name of the beast, or the number of his name.” Revelation 13:16, 17. This is the mark concerning which the third angel utters his warning. It is the mark of the first beast, or the Papacy, and is therefore to be sought among the distinguishing characteristics of that power.",
        "The prophet Daniel declared that the Roman Church, symbolized by the little horn, was to think to change times and laws (Daniel 7:25), while Paul styled it the man of sin (2 Thessalonians 2:3, 4), who was to exalt himself above God. Only by changing God’s law could the Papacy exalt itself above God; whoever should understandingly keep the law as thus changed would be giving supreme honor to that power by which the change was made.",
        "The fourth commandment, which Rome has endeavored to set aside, is the only precept of the Decalogue that points to God as the Creator of the heavens and the earth, and thus distinguishes the true God from all false gods. The Sabbath was instituted to commemorate the work of creation, and thus to direct the minds of men to the true and living God. Had the Sabbath always been kept, there would never have been an idolater, an atheist, or an infidel.",
        "That institution which points to God as the Creator is a sign of His rightful authority over the beings He has made. The change of the Sabbath is the sign, or mark, of the authority of the Romish Church. Those who, understanding the claims of the fourth commandment, choose to observe the false in place of the true Sabbath, are thereby paying homage to that power by which alone it is commanded."
      ],
      "sw": [
        "Kwa mnyama huyu wa kwanza, Kanisa la Roma linawakilishwa, ambalo ni taasisi ya kikanisa iliyovikwa nguvu za kiserikali, ikiwa na mamlaka ya kuwaadhibu wote wanaopingana nayo. Sanamu ya mnyama inawakilisha taasisi nyingine ya kidini iliyovikwa nguvu zinazofanana na hizo. Kuundwa kwa sanamu hii ni kazi ya yule mnyama ambaye kuinuka kwake kwa amani na madai yake ya upole yanamfanya kuwa alama ya kushangaza ya Marekani. Hapa ndipo itakapopatikana sanamu ya Upapa. Wakati makanisa ya nchi yetu, yakiungana katika mambo ya imani wanayokubaliana, yatakaposhawishi Serikali kulazimisha amri zao na kutegemeza taasisi zao, hapo ndipo Marekani ya Kiprotestanti itakapokuwa imeunda sanamu ya utawala wa Roma. Kisha kanisa la kweli litashambuliwa kwa mateso, kama walivyokuwa watu wa Mungu wa kale.",
        "Mnyama mwenye pembe kama za mwanakondoo anaamuru “wote, wadogo kwa wakubwa, na matajiri kwa maskini, na walio huru kwa watumwa, watiwe chapa katika mkono wa kuume au katika vipaji vya nyuso zao; tena kwamba mtu awaye yote asiweze kununua wala kuuza, isipokuwa ana chapa ile, yaani, jina la mnyama yule, au hesabu ya jina lake.” Ufunuo 13:16, 17. Hii ndiyo chapa ambayo malaika wa tatu anatoa onyo kuihusu. Ni chapa ya mnyama wa kwanza, au Upapa, na kwa hivyo inapaswa kutafutwa miongoni mwa sifa bainifu za mamlaka hiyo.",
        "Nabii Danieli alitangaza kwamba Kanisa la Roma, likiwakilishwa na pembe ndogo, lingefikiri kubadili majira na sheria (Danieli 7:25), wakati Paulo aliliita mtu wa kuasi (2 Wathesalonike 2:3, 4), ambaye angejiinua juu ya Mungu. Ni kwa kubadili sheria ya Mungu pekee ndipo Upapa ungeweza kujiinua juu ya Mungu; yeyote ambaye kwa ufahamu angeishika sheria hiyo kama ilivyobadilishwa, atakuwa akitoa heshima kuu kwa mamlaka ile iliyofanya mabadiliko hayo.",
        "Amri ya nne, ambayo Roma imejaribu kuiweka kando, ndiyo agizo pekee la Amri Kumi linaloashiria Mungu kama Muumbaji wa mbingu na nchi, na hivyo kumtofautisha Mungu wa kweli na miungu yote ya uongo. Sabato ilianzishwa ili kukumbuka kazi ya uumbaji, na hivyo kuelekeza akili za wanadamu kwa Mungu wa kweli na aliye hai. Kama Sabato ingekuwa imetunzwa sikuzote, kusingekuwa na mwabudu sanamu, mkanamungu (atheist), au asiyeamini.",
        "Taasisi hiyo inayoashiria Mungu kama Muumbaji ni ishara ya mamlaka Yake halali juu ya viumbe Alivyovifanya. Mabadiliko ya Sabato ni ishara, au chapa, ya mamlaka ya Kanisa la Roma. Wale ambao, wakielewa madai ya amri ya nne, wanachagua kuishika Sabato ya uongo badala ya ile ya kweli, kwa kufanya hivyo wanatoa heshima kwa mamlaka hiyo ambayo pekee ndiyo iliyoamuru mabadiliko hayo."
      ]
    },
    "keyPoints": {
      "en": [
        "The cross reveals God’s love and justice",
        "Christ bore the penalty of sin",
        "Salvation is a gift through sacrifice"
      ],
      "sw": [
        "Msalaba unaonyesha upendo na haki ya Mungu",
        "Kristo alichukua adhabu ya dhambi",
        "Wokovu ni zawadi kupitia dhabihu"
      ]
    }
  },
  {
    "id": "solemn-message",
    "description": {
      "en": [
        "The most fearful threatening ever addressed to mortals is contained in the third angel’s message. That must be a terrible sin which calls down the wrath of God unmingled with mercy. Men are not to be left in darkness concerning this important matter; the warning against this sin is to be given to the world before the visitation of God’s judgments, that all may know why they are to be inflicted, and have opportunity to escape them.",
        "In the issue of the great contest, two distinct, opposite classes are developed. One class “worship the beast and his image, and receive his mark,” and thus bring upon themselves the awful judgments threatened by the third angel. The other class, in marked contrast to the world, “keep the commandments of God, and the faith of Jesus.” Revelation 14:9, 12.",
        "Such were the momentous truths that opened before those who received the third angel’s message. As they reviewed their experience from the first proclamation of the second advent to the passing of the time in 1844, they saw their disappointment explained, and hope and joy again animated their hearts.",
        "Light from the sanctuary illuminated the past, the present, and the future, and they knew that God had led them by His unerring providence. Now with new courage and firmer faith, they joined in giving the warning of the third angel. Since 1844, in fulfillment of the prophecy of the third angel’s message, the attention of the world has been called to the true Sabbath, and a constantly increasing number are returning to the observance of God’s holy day."
      ],
      "sw": [
        "Tishio la kutisha zaidi kuwahi kutolewa kwa wanadamu limo katika ujumbe wa malaika wa tatu. Lazima hiyo iwe dhambi ya kutisha inayoshusha ghadhabu ya Mungu isiyochanganyika na rehema. Wanadamu hawapaswi kuachwa gizani kuhusu jambo hili muhimu; onyo dhidi ya dhambi hii linapaswa kutolewa kwa ulimwengu kabla ya ujio wa hukumu za Mungu, ili wote wajue ni kwa nini zinatolewa, na wapate nafasi ya kuziepuka.",
        "Katika matokeo ya pambano hili kuu, makundi mawili tofauti na yanayopingana yanatokea. Kundi moja “wanamwabudu mnyama na sanamu yake, na kuipokea chapa yake,” na hivyo kujiletea wenyewe hukumu za kutisha zilizotishwa na malaika wa tatu. Kundi lile lingine, likiwa na utofauti mkubwa na ulimwengu, “wanazishika amri za Mungu, na imani ya Yesu.” Ufunuo 14:9, 12.",
        "Hizo ndizo zilikuwa kweli muhimu sana zilizofunguka mbele ya wale waliopokea ujumbe wa malaika wa tatu. Walipopitia uzoefu wao tangu kutangazwa kwa mara ya kwanza kwa marejeo ya pili hadi kupita kwa muda mnamo 1844, waliona kukatishwa tamaa kwao kukielezewa, na tumaini na furaha vikahuisha mioyo yao tena.",
        "Nuru kutoka patakatifu iliangaza wakati uliopita, sasa, na ujao, nao walijua kuwa Mungu alikuwa amewaongoza kwa majaliwa Yake yasiyokosea. Sasa kwa ujasiri mpya na imani thabiti zaidi, waliungana katika kutoa onyo la malaika wa tatu. Tangu 1844, katika utimilifu wa unabii wa ujumbe wa malaika wa tatu, fikira za ulimwengu zimeelekezwa kwenye Sabato ya kweli, na idadi inayoongezeka kila mara wanarejea kwenye ushikaji wa siku takatifu ya Mungu."
      ]
    },
    "keyPoints": {
      "en": [
        "The cross reveals God’s love and justice",
        "Christ bore the penalty of sin",
        "Salvation is a gift through sacrifice"
      ],
      "sw": [
        "Msalaba unaonyesha upendo na haki ya Mungu",
        "Kristo alichukua adhabu ya dhambi",
        "Wokovu ni zawadi kupitia dhabihu"
      ]
    }
  },
  {
    "id": "flood",
    "description": {
      "en": [
        "The descendants of Seth were called the sons of God; the descendants of Cain, the sons of men. As the sons of God mingled with the sons of men, they became corrupt and, by intermarriage with them, lost, through the influence of their wives, their peculiar, holy character, and united with the sons of Cain in their idolatry. Many cast aside the fear of God and trampled upon His commandments. But there were a few that did righteousness, who feared and honored their Creator. Noah and his family were among the righteous few.",
        "The wickedness of man was so great, and increased to such a fearful extent, that God repented that He had made man upon the earth, for He saw that the wickedness of man was great, and that every imagination of the thoughts of his heart was only evil continually. More than one hundred years before the Flood the Lord sent an angel to faithful Noah to make known to him that He would no longer have mercy upon the corrupt race.",
        "Noah was to preach to the people, and also to prepare an ark as God should direct him for the saving of himself and family. He was not only to preach, but his example in building the ark was to convince all that he believed what he preached. Noah and his family were not alone in fearing and obeying God. But Noah was the most pious and holy of any upon the earth, and was the one whose life God preserved to carry out His will in building the ark and warning the world of its coming doom.",
        "God gave all who chose an opportunity to repent and turn to Him. But they believed not the preaching of Noah. They mocked at his warnings and ridiculed the building of that immense vessel on dry land. Noah’s efforts to reform his fellow men did not succeed. But for more than one hundred years he persevered in his efforts to turn men to repentance and to God. Every blow struck upon the ark was preaching to the people. Noah directed, he preached, he worked, while the people looked on in amazement and regarded him as a fanatic."
      ],
      "sw": [
        "Wazao wa Sethi waliitwa wana wa Mungu; wazao wa Kaini waliitwa wana wa wanadamu. Wana wa Mungu walipochanganyika na wana wa wanadamu, wakawa wapotovu na, kwa kuoana nao, walipoteza tabia yao takatifu na ya pekee kupitia ushawishi wa wake zao, na kuungana na wana wa Kaini katika ibada yao ya sanamu. Wengi walitupilia mbali hofu ya Mungu na kuzikanyaga amri Zake. Lakini walikuwapo wachache waliotenda haki, waliomcha na kumheshimu Muumba wao. Nuhu na familia yake walikuwa miongoni mwa wale wachache wenye haki.",
        "Uovu wa mwanadamu ulikuwa mkubwa sana, na uliongezeka kwa kiasi cha kutisha, kiasi kwamba Mungu alijuta kwamba amemfanya mwanadamu duniani, kwani aliona kuwa uovu wa mwanadamu ulikuwa mkubwa, na kwamba kila fikira ya mawazo ya moyo wake ilikuwa mbaya tu daima. Zaidi ya miaka mia moja kabla ya Gharika, Bwana alimtuma malaika kwa Nuhu mwaminifu ili kumfahamisha kuwa Hatakuwa na rehema tena juu ya kizazi hicho kipotovu.",
        "Nuhu alipaswa kuhubiri kwa watu, na pia kuandaa safina kama Mungu alivyomwelekeza kwa ajili ya kujiokoa yeye na familia yake. Hakupaswa kuhubiri tu, bali mfano wake katika kujenga safina ulipaswa kuwashawishi wote kwamba aliamini kile alichokihubiri. Nuhu na familia yake hawakuwa peke yao katika kumcha na kumtii Mungu. Lakini Nuhu alikuwa mcha Mungu na mtakatifu zaidi ya yeyote duniani, na ndiye ambaye Mungu alihifadhi maisha yake ili kutekeleza mapenzi Yake katika kujenga safina na kuuonya ulimwengu juu ya maangamizi yake yanayokuja.",
        "Mungu alimpa kila aliyechagua fursa ya kutubu na kumgeukia Yeye. Lakini hawakuamini mahubiri ya Nuhu. Walidhihaki maonyo yake na kucheka ujenzi wa chombo kile kikubwa nchi kavu. Jitihada za Nuhu za kuwarekebisha wanadamu wenzake hazikufanikiwa. Lakini kwa zaidi ya miaka mia moja alivumilia katika jitihada zake za kuwageuza watu kwenye toba na kwa Mungu. Kila pigo lililopigwa juu ya safina lilikuwa ni mahubiri kwa watu. Nuhu alielekeza, alihubiri, na alifanya kazi, wakati watu wakitazama kwa mshangao na kumchukulia kama mwehu."
      ]
    },
    "keyPoints": {
      "en": [
        "The cross reveals God’s love and justice",
        "Christ bore the penalty of sin",
        "Salvation is a gift through sacrifice"
      ],
      "sw": [
        "Msalaba unaonyesha upendo na haki ya Mungu",
        "Kristo alichukua adhabu ya dhambi",
        "Wokovu ni zawadi kupitia dhabihu"
      ]
    }
  },
  {
    "id": "build-ark",
    "description": {
      "en": [
        "God gave Noah the exact dimensions of the ark and explicit directions in regard to the construction of it in every particular. In many respects it was not made like a vessel but prepared like a house, the foundation like a boat which would float upon water. There were no windows in the sides of the ark. It was three stories high, and the light they received was from a window in the top. The door was in the side. The different apartments prepared for the reception of different animals were so made that the window in the top gave light to all. The ark was made of the cypress or gopher wood, which would know nothing of decay for hundreds of years. It was a building of great durability, which no wisdom of man could invent. God was the designer, and Noah His master builder.",
        "After Noah had done all in his power to make every part of the work correct, it was impossible that it could of itself withstand the violence of the storm which God in His fierce anger was to bring upon the earth. The work of completing the building was a slow process. Every piece of timber was closely fitted, and every seam covered with pitch. All that men could do was done to make the work perfect; yet, after all, God alone could preserve the building upon the angry, heaving billows, by His miraculous power.",
        "A multitude at first apparently received the warning of Noah, yet did not fully turn to God with true repentance. There was some time given them before the Flood was to come, in which they were to be placed upon probation—to be proved and tried. They failed to endure the trial. The prevailing degeneracy overcame them, and they finally joined others who were corrupt in deriding and scoffing at faithful Noah. They would not leave off their sins but continued in polygamy and in the indulgence of their corrupt passions.",
        "The period of their probation was drawing near its close. The unbelieving, scoffing inhabitants of the world were to have a special sign of God’s divine power. Noah had faithfully followed the instructions God had given to him. The ark was finished exactly as God had directed. He had laid in store immense quantities of food for man and beast. And after this was accomplished, God commanded the faithful Noah, “Come thou and all thy house into the ark; for thee have I seen righteous before Me.”"
      ],
      "sw": [
        "Mungu alimpa Nuhu vipimo kamili vya safina na maelekezo ya wazi kuhusiana na ujenzi wake katika kila kipengele. Katika mambo mengi haikutengenezwa kama merikebu bali iliandaliwa kama nyumba, msingi wake ukiwa kama boti ambayo ingeelea juu ya maji. Hapakuwa na madirisha pembeni mwa safina. Ilikuwa na urefu wa ghorofa tatu, na mwanga walioupata ulitoka kwenye dirisha lililokuwa juu. Mlango ulikuwa pembeni. Vyumba tofauti vilivyoandaliwa kwa ajili ya kupokea wanyama mbalimbali vilitengenezwa kiasi kwamba dirisha la juu lilitoa mwanga kwa vyote. Safina ilitengenezwa kwa mti wa sayprosi au mgofero, ambao haungejua kuoza kwa mamia ya miaka. Lilikuwa jengo la uimara mkubwa, ambalo hakuna hekima ya mwanadamu ingeweza kuvumbua. Mungu alikuwa msanifu, na Nuhu alikuwa mjenzi mkuu Wake.",
        "Baada ya Nuhu kufanya kila kitu katika uwezo wake ili kuhakikisha kila sehemu ya kazi iko sahihi, haikuwezekana kwamba chombo hicho kingeweza kuhimili chenyewe vurugu za dhoruba ambayo Mungu katika ghadhabu Yake kali angeileta juu ya dunia. Kazi ya kukamilisha jengo hilo ilikuwa mchakato wa polepole. Kila kipande cha mbao kiliunganishwa kwa ukaribu, na kila mshono ulifunikwa na lami. Kila kitu ambacho wanadamu wangeweza kufanya kilifanyika ili kuifanya kazi hiyo kuwa kamilifu; hata hivyo, baada ya yote, Mungu pekee ndiye angeweza kulihifadhi jengo hilo juu ya mawimbi yenye hasira na yanayopanda, kwa nguvu Yake ya kimuujiza.",
        "Umati wa watu hapo awali walionekana kupokea onyo la Nuhu, lakini hawakumgeukia Mungu kikamilifu kwa toba ya kweli. Kulikuwa na muda waliopewa kabla ya Gharika kuja, ambapo walipaswa kuwekwa katika kipindi cha majaribio—ili kuthibitishwa na kujaribiwa. Walishindwa kuvumilia jaribu hilo. Uharibifu uliokuwa umeenea uliwashinda, na hatimaye wakajiunga na wengine waliokuwa wapotovu katika kumdhihaki na kumfanyia mzaha Nuhu mwaminifu. Hawakuacha dhambi zao bali waliendelea katika mitala na kujiingiza katika tamaa zao mbaya.",
        "Kipindi cha majaribio yao kilikuwa kikikaribia mwisho wake. Wakazi wa ulimwengu wasioamini na wenye kudhihaki walipaswa kuwa na ishara maalum ya nguvu ya kimungu ya Mungu. Nuhu alikuwa amefuata kwa uaminifu maelekezo ambayo Mungu alikuwa amempa. Safina ilikamilika sawasawa na vile Mungu alivyoelekeza. Alikuwa amehifadhi kiasi kikubwa cha chakula kwa ajili ya mwanadamu na mnyama. Na baada ya haya kukamilika, Mungu akamwamuru Nuhu mwaminifu, “Ingia wewe na nyumba yako yote katika safina; kwa maana nimekuona wewe kuwa ni mwenye haki mbele zangu.”"
      ]
    },
    "keyPoints": {
      "en": [
        "The cross reveals God’s love and justice",
        "Christ bore the penalty of sin",
        "Salvation is a gift through sacrifice"
      ],
      "sw": [
        "Msalaba unaonyesha upendo na haki ya Mungu",
        "Kristo alichukua adhabu ya dhambi",
        "Wokovu ni zawadi kupitia dhabihu"
      ]
    }
  },
  {
    "id": "aminal-enter-the-ark",
    "description": {
      "en": [
        "Angels were sent to collect from the forest and field the beasts which God had created. Angels went before these animals, and they followed, two and two, male and female, and clean beasts by sevens. These beasts, from the most ferocious, down to the most gentle and harmless, peacefully and solemnly marched into the ark. The sky seemed clouded with birds of every description. They came flying to the ark, two and two, male and female, and the clean birds by sevens. The world looked on with wonder—some with fear, but they had become so hardened by rebellion that this most signal manifestation of God’s power had but a momentary influence upon them.",
        "And as the doomed race beheld the sun shining in its glory and the earth clad in almost its Eden beauty, they drove away their rising fears by boisterous merriment, and by their deeds of violence seemed to be encouraging upon themselves the visitation of the already awakened wrath of God. Everything was now ready for the closing of the ark, which could not have been done by Noah from within. An angel is seen by the scoffing multitude descending from heaven, clothed with brightness like the lightning. He closes that massive outer door, and then takes his course upward to heaven again.",
        "Seven days were the family of Noah in the ark before the rain began to descend upon the earth. In this time they were arranging for their long stay while the waters should be upon the earth. And these were days of blasphemous merriment by the unbelieving multitude. They thought, because the prophecy of Noah was not fulfilled immediately after he entered the ark, that he was deceived and that it was impossible that the world could be destroyed by a flood. Previous to this there had been no rain upon the earth. A mist had risen from the waters, which God caused to descend at night like dew, reviving vegetation.",
        "Notwithstanding the solemn exhibition they had witnessed of God’s power—of the unnatural occurrence of the beasts’ leaving the forests and fields, and going into the ark, and the angel of God clothed with brightness and terrible in majesty descending from heaven and closing the door; yet they hardened their hearts and continued to revel and sport over the signal manifestations of divine power."
      ],
      "sw": [
        "Malaika walitumwa kukusanya kutoka mwituni na mashambani wanyama ambao Mungu alikuwa amewaumba. Malaika walitangulia mbele ya wanyama hawa, nao wakafuata, wawili wawili, dume na jike, na wanyama walio safi saba saba. Wanyama hawa, kuanzia wale wakali kupita kiasi, hadi wale wapole na wasio na madhara kabisa, waliingia ndani ya safina kwa amani na utulivu mkuu. Anga lilionekana kufunikwa na ndege wa kila aina. Walikuja wakiruka kuelekea kwenye safina, wawili wawili, dume na jike, na ndege walio safi saba saba. Ulimwengu ulitazama kwa mshangao—wengine kwa hofu, lakini walikuwa wamefanywa wagumu na uasi kiasi kwamba dhihirisho hili kuu la nguvu za Mungu lilikuwa na ushawishi wa kitambo kidogo tu juu yao.",
        "Na wakati kizazi kilichohukumiwa kilipotazama jua liking’ara kwa utukufu wake na dunia ikiwa imevikwa uzuri karibu kama ule wa Edeni, walifukuza hofu zao zilizokuwa zikiongezeka kwa makelele ya sherehe, na kwa matendo yao ya ghasia walionekana kujitakia wenyewe ujio wa ghadhabu ya Mungu iliyokuwa tayari imeamshwa. Kila kitu sasa kilikuwa tayari kwa ajili ya kufungwa kwa safina, jambo ambalo lisingeweza kufanywa na Nuhu akiwa ndani. Malaika anaonekana na ule umati wenye kudhihaki akishuka kutoka mbinguni, akiwa amevikwa mwangaza kama wa umeme. Anaufunga ule mlango mkubwa wa nje, na kisha anapaa kuelekea mbinguni tena.",
        "Siku saba familia ya Nuhu ilikuwa ndani ya safina kabla ya mvua kuanza kushuka juu ya nchi. Katika muda huu walikuwa wakijipanga kwa ajili ya kukaa kwao kwa muda mrefu wakati maji yatakapokuwa juu ya nchi. Na hizi zilikuwa siku za sherehe za kufuru kwa umati usioamini. Walifikiri kuwa, kwa sababu unabii wa Nuhu haukutimia mara tu baada ya kuingia katika safina, kwamba alikuwa amedanganywa na kwamba haiwezekani ulimwengu uharibiwe kwa gharika. Kabla ya hapo hapakuwa na mvua juu ya nchi. Ukungu ulikuwa ukipanda kutoka kwenye maji, ambao Mungu aliufanya ushuke usiku kama umande, ukihuisha mimea.",
        "Licha ya dhihirisho lile la kicho walilolishuhudia la nguvu za Mungu—la tukio lisilo la kawaida la wanyama kuacha misitu na mashamba na kuingia ndani ya safina, na malaika wa Mungu aliyevikwa mwangaza na utukufu wa kutisha akishuka kutoka mbinguni na kufunga mlango; bado walifanya mioyo yao kuwa migumu na kuendelea kufanya anasa na michezo juu ya dhihirisho lile la wazi la nguvu za kimungu."
      ]
    },
    "keyPoints": {
      "en": [
        "The cross reveals God’s love and justice",
        "Christ bore the penalty of sin",
        "Salvation is a gift through sacrifice"
      ],
      "sw": [
        "Msalaba unaonyesha upendo na haki ya Mungu",
        "Kristo alichukua adhabu ya dhambi",
        "Wokovu ni zawadi kupitia dhabihu"
      ]
    }
  },
  {
    "id": "storm-breaks",
    "description": {
      "en": [
        "But upon the eighth day the heavens gathered blackness. The muttering thunders and vivid lightning flashes began to terrify man and beast. The rain descended from the clouds above them. This was something they had never witnessed, and their hearts began to faint with fear. The storm increased in violence until water seemed to come from heaven like mighty cataracts. The foundations of the great deep also were broken up. Jets of water would burst up from the earth with indescribable force, throwing massive rocks hundreds of feet into the air.",
        "The people first beheld the destruction of the works of their hands. Their splendid buildings, their beautifully arranged gardens and groves, where they had placed their idols, were destroyed by lightning from heaven. The violence of the storm increased, and there were mingled with the warring of the elements, the wailings of the people who had despised the authority of God. Even Satan himself, who was compelled to be amid the warring elements, feared for his own existence.",
        "While many were blaspheming and cursing their Creator, others were frantic with fear, stretching their hands toward the ark, pleading for admittance. But this was impossible. God had closed the door, the only entrance, and shut Noah in and the ungodly out. Their fear and repentance came too late. Some clung to the ark until borne away with the furious surging of the waters. Every moment during that frightful storm of forty days and forty nights the preservation of the ark was a miracle of almighty power.",
        "The storm did not abate its fury—the waters increased faster than at first. Upon the loftiest heights human beings and beasts strove to hold their position until all were hurled together into the foaming waters. Anxiously did Noah and his family watch the decrease of the waters. After seven days the dove was sent forth again, and when the olive leaf was seen in its mouth, there was great rejoicing. Again an angel descended and opened the door of the ark. Noah could remove the top, but he could not open the door which God had shut."
      ],
      "sw": [
        "Lakini siku ya nane mbingu zilikusanya weusi. Ngurumo za chini na miale ya umeme ilianza kuwatisha wanadamu na wanyama. Mvua ilishuka kutoka kwenye mawingu juu yao. Hili lilikuwa jambo ambalo hawajawahi kulishuhudia, na mioyo yao ilianza kuzimia kwa hofu. Dhoruba iliongezeka kwa ghasia hadi maji yalionekana kushuka kutoka mbinguni kama maporomoko makuu. Misingi ya vilindi vikuu pia ilipasuliwa. Chemchemi za maji zilibubujika kutoka duniani kwa nguvu isiyoelezeka, zikirusha mawe makubwa mamia ya futi hewani.",
        "Watu kwanza walitazama uharibifu wa kazi za mikono yao. Majengo yao ya kifahari, bustani zao zilizopangwa vizuri na misitu midogo, ambapo walikuwa wameweka sanamu zao, viliharibiwa kwa umeme kutoka mbinguni. Ukali wa dhoruba uliongezeka, na katikati ya mapigano ya asili, kulichanganyika na vilio vya watu waliokuwa wamedharau mamlaka ya Mungu. Hata Shetani mwenyewe, ambaye alilazimika kuwa katikati ya vurugu hizo za asili, aliogopa kwa ajili ya kuwepo kwake mwenyewe.",
        "Wakati wengi walikuwa wakimkufuru na kumlaani Muumba wao, wengine walikuwa na hofu kuu, wakinyoosha mikono yao kuelekea kwenye safina, wakisihi waingizwe. Lakini jambo hili haliwezekani. Mungu alikuwa amefunga mlango, kiingilio pekee, na kumfungia Nuhu ndani na waovu nje. Hofu yao na toba yao vilikuja kwa kuchelewa sana. Baadhi walishikilia safina hadi walipochukuliwa na mawimbi makali ya maji. Kila wakati katika dhoruba hiyo ya kutisha ya siku arobaini na usiku arobaini, kuhifadhiwa kwa safina kulikuwa muujiza wa nguvu za Mwenyezi.",
        "Dhoruba haikupunguza ukali wake—maji yaliongezeka haraka kuliko hapo awali. Juu ya vilele virefu kabisa, wanadamu na wanyama walijitahidi kushikilia nafasi zao hadi wote walipotupwa pamoja katika maji yanayotoa povu. Kwa shauku Nuhu na familia yake walitazama kupungua kwa maji. Baada ya siku saba njiwa alitumwa tena, na jani la mzeituni lilipoonekana mdomoni mwake, palikuwa na furaha kubwa. Tena malaika alishuka na kufungua mlango wa safina. Nuhu aliweza kuondoa kifuniko cha juu, lakini hangeweza kufungua mlango ambao Mungu aliufunga."
      ]
    },
    "keyPoints": {
      "en": [
        "The cross reveals God’s love and justice",
        "Christ bore the penalty of sin",
        "Salvation is a gift through sacrifice"
      ],
      "sw": [
        "Msalaba unaonyesha upendo na haki ya Mungu",
        "Kristo alichukua adhabu ya dhambi",
        "Wokovu ni zawadi kupitia dhabihu"
      ]
    }
  },
  {
    "id": "noah-sacrifice-and-god-promise",
    "description": {
      "en": [
        "Noah did not forget God, who had so graciously preserved them, but immediately erected an altar and took of every clean beast, and of every clean fowl, and offered burnt offerings on the altar, showing his faith in Christ the great sacrifice, and manifesting his gratitude to God for their wonderful preservation. The offering of Noah came up before God like a sweet savor. He accepted the offering and blessed Noah and his family. Here a lesson is taught all who should live upon the earth, that for every manifestation of God’s mercy and love toward them the first act of all should be to render to Him grateful thanks and humble worship.",
        "And lest man should be terrified with gathering clouds and falling rains, and should be in continual dread, fearing another flood, God graciously encourages the family of Noah by a promise. “And I will establish My covenant with you; neither shall all flesh be cut off any more by the waters of a flood; neither shall there any more be a flood to destroy the earth. And God said, This is the token of the covenant which I make between Me and you and every living creature that is with you, for perpetual generations: I do set My bow in the cloud, and it shall be for a token of a covenant between Me and the earth.\"",
        "What a condescension on the part of God! What compassion for erring man, to place the beautiful, variegated rainbow in the clouds, a token of the covenant of the great God with man! This rainbow was to evidence the fact to all generations that God destroyed the inhabitants of the earth by a flood, because of their great wickedness. It was His design that as the children of aftergenerations should see the bow in the cloud and should inquire the reason of this glorious arch that spanned the heavens, their parents could explain to them the destruction of the old world by a flood.",
        "This symbol in the clouds is to confirm the belief of all, and establish their confidence in God, for it is a token of divine mercy and goodness to man; that although God had been provoked to destroy the earth by the Flood, yet His mercy still encompasseth the earth. God says when He looketh upon the bow in the cloud He will remember. He would not have us understand that He would ever forget, but He speaks to man in his own language, that man may better understand Him."
      ],
      "sw": [
        "Nuhu hakumsahau Mungu, ambaye alikuwa amewahifadhi kwa neema, bali mara moja alijenga madhabahu na kuchukua katika kila mnyama aliye safi, na katika kila ndege aliye safi, na kutoa sadaka za kuteketezwa juu ya madhabahu, akionyesha imani yake kwa Kristo dhabihu kuu, na kudhihirisha shukrani zake kwa Mungu kwa uhifadhi wao wa ajabu. Sadaka ya Nuhu ilipanda mbele za Mungu kama harufu nzuri. Alikubali sadaka hiyo na kumbariki Nuhu na familia yake. Hapa fundisho linatolewa kwa wote wanaopaswa kuishi duniani, kwamba kwa kila udhihirisho wa rehema na upendo wa Mungu kwao, kitendo cha kwanza cha kila mmoja kinapaswa kuwa kutoa shukrani na ibada ya unyenyekevu Kwake.",
        "Na ili mwanadamu asiogope mawingu yanayokusanyika na mvua inayonyesha, na kuwa katika hofu ya mara kwa mara, akihofia gharika nyingine, Mungu anaitia moyo familia ya Nuhu kwa neema kupitia ahadi. “Nami nitalifanya agano langu nanyi; wala kila mwenye mwili hatafutiliwa mbali tena kwa maji ya gharika; wala hakutakuwa na gharika tena kuiharibu nchi. Mungu akasema, Hii ndiyo ishara ya agano nifanyalo kati ya mimi na ninyi, na kila kiumbe hai kilichoko pamoja nanyi, kwa vizazi vya hata milele: Naweka upinde wangu mawinguni, nao utakuwa ishara ya agano kati ya mimi na nchi.”",
        "Ni unyenyekevu ulioje kwa upande wa Mungu! Ni huruma iliyoje kwa mwanadamu anayekosea, kuweka upinde wa mvua mzuri, wenye rangi mbalimbali mawinguni, ishara ya agano la Mungu mkuu na mwanadamu! Upinde huu wa mvua ulikuwa uthibitishe ukweli kwa vizazi vyote kwamba Mungu aliwaangamiza wakazi wa dunia kwa gharika kwa sababu ya uovu wao mkubwa. Lilikuwa kusudi Lake kwamba watoto wa vizazi vya baadaye watakapoona upinde mawinguni na kuuliza sababu ya tao hili tukufu lililotanda mbinguni, wazazi wao wangeweza kuwaelezea uharibifu wa ulimwengu wa kale kwa gharika.",
        "Ishara hii mawinguni ni kwa ajili ya kuthibitisha imani ya wote, na kuanzisha ujasiri wao kwa Mungu, kwani ni ishara ya rehema ya kimungu na wema kwa mwanadamu; kwamba ingawa Mungu alikuwa amechokozwa hata akaiharibu dunia kwa Gharika, bado rehema Yake inaizunguka dunia. Mungu anasema anapoutazama upinde mawinguni Atakumbuka. Hangependa tuelewe kwamba Anaweza kusahau kamwe, bali anazungumza na mwanadamu kwa lugha yake mwenyewe, ili mwanadamu apate kumwelewa vyema zaidi."
      ]
    },
    "keyPoints": {
      "en": [
        "The cross reveals God’s love and justice",
        "Christ bore the penalty of sin",
        "Salvation is a gift through sacrifice"
      ],
      "sw": [
        "Msalaba unaonyesha upendo na haki ya Mungu",
        "Kristo alichukua adhabu ya dhambi",
        "Wokovu ni zawadi kupitia dhabihu"
      ]
    }
  },
  {
    "id": "new-earth",
    "description": {
      "en": [
        "“And I saw a new heaven and a new earth: for the first heaven and the first earth were passed away.” Revelation 21:1. The fire that consumes the wicked purifies the earth. Every trace of the curse is swept away. No eternally burning hell will keep before the ransomed the fearful consequences of sin. One reminder alone remains: our Redeemer will ever bear the marks of His crucifixion.",
        "“O Tower of the flock, the strong hold of the daughter of Zion, unto thee shall it come, even the first dominion.” Micah 4:8. The kingdom forfeited by sin, Christ has regained, and the redeemed are to possess it with Him. “The righteous shall inherit the land, and dwell therein for ever.” Psalm 37:29.",
        "A fear of making the saints’ inheritance seem too material has led many to spiritualize away the very truths which lead us to look upon the new earth as our home. Christ assured His disciples that He went to prepare mansions for them. Yet the apostle Paul declares, “Eye hath not seen, nor ear heard... the things which God hath prepared for them that love Him.”",
        "In the Bible the inheritance of the saved is called a country. There the great Shepherd leads His flock to fountains of living waters. The tree of life yields its fruit every month. On those peaceful plains, beside those living streams, God’s people, so long pilgrims and wanderers, shall find a home."
      ],
      "sw": [
        "“Kisha nikaona mbingu mpya na nchi mpya; kwa maana mbingu za kwanza na nchi ya kwanza zimekwisha kupita.” Ufunuo 21:1. Moto unaowaangamiza waovu unaisafisha dunia. Kila alama ya laana inafagiliwa mbali. Hakuna hovyo la moto linalowaka milele litakaloweka mbele ya waliokombolewa matokeo ya kutisha ya dhambi. Kikumbusho kimoja tu kinabaki: Mwokozi wetu atazichukua daima alama za kusulubiwa Kwake.",
        "“Nawe, Ee mnara wa kundi, kilima cha binti Sayuni, kitaletwa kwako, naam, ule utawala wa kwanza utakuja.” Mika 4:8. Ufalme uliopotea kwa sababu ya dhambi, Kristo ameurudisha, na waliokombolewa wataumiliki pamoja Naye. “Wenye haki watairithi nchi, nao watakaa humo milele.” Zaburi 37:29.",
        "Hofu ya kufanya urithi wa watakatifu uonekane kama kitu halisi imewafanya wengi kuubadili kuwa wa kiroho tu na kuacha ukweli unaotufanya tuitazame nchi mpya kama nyumbani kwetu. Kristo aliwahakikishia wanafunzi Wake kwamba anakwenda kuwaandalia makao. Lakini mtume Paulo anasema, “Jicho halikuona, wala sikio halikusikia... mambo ambayo Mungu aliwaandalia wale wampandao.”",
        "Katika Biblia urithi wa waliookolewa unaitwa nchi. Humo Mchungaji mkuu huwaongoza kundi Lake kwenye chemchemi za maji yaliyo hai. Mti wa uzima hutoa matunda yake kila mwezi. Katika nchi tambarare zenye amani, kando ya mito hiyo ya maji yaliyo hai, watu wa Mungu, ambao kwa muda mrefu walikuwa wasafiri na wapitaji, watapata nyumbani."
      ]
    },
    "keyPoints": {
      "en": [
        "Eternal life is knowing God",
        "Relationship with God begins now",
        "Daily communion sustains spiritual life"
      ],
      "sw": [
        "Uzima wa milele ni kumjua Mungu",
        "Uhusiano na Mungu unaanza sasa",
        "Ushirika wa kila siku huimarisha maisha ya kiroho"
      ]
    }
  },
  {
    "id": "new-jerusalem",
    "description": {
      "en": [
        "There is the New Jerusalem, “having the glory of God,” her light “like unto a stone most precious.” Revelation 21:11. In the city of God “there shall be no night.” We shall ever feel the freshness of the morning, and shall ever be far from its close. “I saw no temple therein: for the Lord God Almighty and the Lamb are the temple of it.” Revelation 21:22.",
        "There immortal minds will study with never-failing delight the wonders of creative power, the mysteries of redeeming love. Every faculty will be developed, every capacity increased. The acquirement of knowledge will not weary the mind or exhaust the energies. There the grandest enterprises may be carried forward, the loftiest aspirations reached.",
        "As the years of eternity roll, they will bring richer and more glorious revelations of God and of Christ. As knowledge is progressive, so will love, reverence, and happiness increase. The more men learn of God, the greater will be their admiration of His character.",
        "“And every creature which is in heaven, and on earth... heard I saying, Blessing, and honour, and glory, and power, be unto Him that sitteth upon the throne, and unto the Lamb for ever and ever.” Revelation 5:13. Sin and sinners are no more, God’s entire universe is clean, and the great controversy is forever ended."
      ],
      "sw": [
        "Kuna Yerusalemu Mpya, “wenye utukufu wa Mungu,” na nuru yake “kama jiwe la thamani kubwa sana.” Ufunuo 21:11. Katika mji wa Mungu “hakutakuwa na usiku.” Daima tutahisi upya wa asubuhi, na daima tutakuwa mbali na mwisho wake. “Nami sikuona hekalu ndani yake; kwa maana Bwana Mungu Mwenyezi na Mwana-Kondoo ndio hekalu lake.” Ufunuo 21:22.",
        "Huko akili zisizokufa zitajifunza kwa furaha isiyofifia maajabu ya nguvu za uumbaji, na mafumbo ya upendo unaokomboa. Kila kipaji kitaendelezwa, kila uwezo utaongezeka. Kujipatia maarifa hakutachosha akili wala kumaliza nguvu. Huko miradi mikubwa zaidi inaweza kuendelezwa, matarajio ya juu kabisa kufikiwa, na malengo makuu kutimizwa.",
        "Na kadiri miaka ya umilele inavyopita, italeta ufunuo tajiri zaidi na wenye utukufu zaidi wa Mungu na wa Kristo. Kadiri maarifa yanavyoongezeka, ndivyo upendo, heshima, na furaha vitakavyoongezeka. Kadiri wanadamu wanavyojifunza zaidi kumhusu Mungu, ndivyo utakavyokuwa mkuu zaidi mshangao wao kwa tabia Yake.",
        "“Na kila kiumbe kilichoko mbinguni, na juu ya nchi... nalikisikia kikisema, Baraka, na heshima, na utukufu, na uweza una Yeye aketiye juu ya kiti cha enzi, na Mwana-Kondoo hata milele na milele.” Ufunuo 5:13. Dhambi na wenye dhambi hawapo tena, ulimwengu wote wa Mungu ni msafi, na pambano kuu limekwisha milele."
      ]
    },
    "keyPoints": {
      "en": [
        "Eternal life is knowing God",
        "Relationship with God begins now",
        "Daily communion sustains spiritual life"
      ],
      "sw": [
        "Uzima wa milele ni kumjua Mungu",
        "Uhusiano na Mungu unaanza sasa",
        "Ushirika wa kila siku huimarisha maisha ya kiroho"
      ]
    }
  }
]